{"title":"The Cars 24 Bit Vinyl Pack","uid":8393672,"size":4325065295,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:00715a783b106205369070b3308aec370977c5e1&amp;dn=The+Cars+24+Bit+Vinyl+Pack&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"politux","files":-1,"time":1366504356,"description":"\n  The Cars 24 Bit Vinyl Pack\n\n  Genre: Pop/Rock\n  Style: New Wave\n  Source: Vinyl\n  Codec: FLAC\n  Bit Rates: ~2,800 - 3,000\n  Bits Per Sample: 24\n  Sample Rate: 96,000 Hz\n\n  1978 The Cars \n  1979 Candy-O\n  1984 Heartbeat City\n  1984 Heartbeat City (Japan)\n  1985 Greatest Hits\n  \n\nBlondie may have had a string of number one hits and Talking Heads may have won the hearts of the critics, but the Cars were the most successful American new wave band to emerge in the late '70s. With its sleek, mechanical pop/rock, the band racked up a string of platinum albums and Top 40 singles that made it one of the most popular American rock &amp; roll bands of the late '70s and early '80s. While they were more commercially oriented than their New York peers, the Cars were nevertheless inspired by proto-punk, garage rock, and bubblegum pop. The difference was in packaging. Where their peers were as equally inspired by art as music, the Cars were strictly a rock &amp; roll band, and while their music occasionally sounded clipped and distant, they had enough attitude to cross over to album rock radio, which is where they made their name. \n\nNevertheless, the Cars remained a new wave band, picking up cues from the Velvet Underground, David Bowie, and Roxy Music. Ric Ocasek and Ben Orr's vocals uncannily recalled Lou Reed's deadpan delivery, while the band's insistent, rhythmic pulse was reminiscent of Berlin-era Iggy Pop. Furthermore, the Cars followed Roxy Music's lead regarding LP cover art, in their case having artist Alberto Vargas design a sexy pinup-style illustration for the cover of their sophomore album, Candy-O. Similar cover art remained the Cars' primary visual attraction until 1984, when the group made a series of striking videos to accompany the singles from Heartbeat City. The videos for &quot;You Might Think,&quot; &quot;Magic,&quot; and &quot;Drive&quot; became MTV staples, sending the Cars to near-superstar status. Instead of following through with their success, the Cars slowly faded away, quietly breaking up after releasing one final album in 1987.\n","torrent":{"xt":"urn:btih:00715a783b106205369070b3308aec370977c5e1","amp;dn":"The+Cars+24+Bit+Vinyl+Pack","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"00715a783b106205369070b3308aec370977c5e1","infoHashBuffer":{"type":"Buffer","data":[0,113,90,120,59,16,98,5,54,144,112,179,48,138,236,55,9,119,197,225]},"announce":[],"urlList":[]}}