{"title":"Gianna Nannini - Giannissima TQMP","uid":4764615,"size":437237142,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:011ac942fd3c3f3a0bd550de0bcefd5ce9adc884&amp;dn=Gianna+Nannini+-+Giannissima+TQMP&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"zootallure","files":32,"time":1236818870,"description":"Una delle poche rockettare vere rimaste (opinione mia), a 33 anni dall' uscita del suo primo disco, ancora in forma strabiliante, riempie i stadi di tutta Europa. Ti prende, ti centrifuga , ti sbatte a destra e manca e ti fa stare bene! Gianna &quot;energia pura&quot; Nannini in Giannissima, l' album dal vivio del '91che, quando lo metti sullo stereo e alzi il volume, scuote tutto e tutti!\n\nOne of the few female rockers left out there (my opinion), 33 years after her first record is still in a very good shape. She is selling out stadiums accross Europe. She takes you, centrifuges you, she hits you to left and right and she makes you feel good! Gianna &quot;pure energy&quot; Nannini in Giannissima, a '91 live recording, which, when you put it on the stereo and raise the volume is rocking everything and everyone!\n\nBrought to you by TQMP. (The Quality Music Project)\n\nIn this project we, fellow pirates share only quality items out of our CD collections in lossless FLAC and include covers, especially for those who like to burn and print and put it in a nice and shiny jewelcase. Well, you all know the drill :)\n\nRipped by Exact Audio Copy V0.99 from 01-23-2008, encoded to FLAC\nGet Your Free Copy of the EAC and FLAC suite at: &lt;a href=&quot;\nhttp://www.exactaudiocopy.de/en/index.php/resources/download/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.exactaudiocopy.de/en/index.php/resources/download/&lt;/a&gt;\n\nPlease feel free to join the TQMP project!\nThe &quot;rules&quot; are simple: Rip your CD (no 1980's cassettetapes or vinylrips please!) in lossless format AND include artwork. Include cue- and logfiles for the purists and the TQMP searchtag in your title, so it can easily be found. (Yes, on Google as well..)\n\n\nSay Ã‚Â»thank youÃ‚Â« by seeding... just seed, it is not harmful to your health :-)","torrent":{"xt":"urn:btih:011ac942fd3c3f3a0bd550de0bcefd5ce9adc884","amp;dn":"Gianna+Nannini+-+Giannissima+TQMP","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"011ac942fd3c3f3a0bd550de0bcefd5ce9adc884","infoHashBuffer":{"type":"Buffer","data":[1,26,201,66,253,60,63,58,11,213,80,222,11,206,253,92,233,173,200,132]},"announce":[],"urlList":[]}}