{"title":"R-Undelete 4.9.Build 159222 Portable (x86/x64) Multilingual","uid":12539841,"size":39285968,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:01b1d85c89038fbcc809a249b4b9864d71130a95&amp;dn=R-Undelete+4.9.Build+159222+Portable+%28x86%2Fx64%29+Multilingual&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"jovo_bih","files":1,"time":1444381837,"description":"***********************************************************\r\nR-Undelete 4.9.Build 159222 Portable (x86/x64) Multilingual\r\n***********************************************************\r\n\r\nIn comparison with the free Home version R-UNDELETE recovers lost files from NTFS, NTFS5 (created or updated by Win2000/XP/2003/Vista/2008/Win7/Win8/Win10) disks as well as recovers them from FAT (FAT12, FAT16, FAT32, exFAT) disks.\r\n\r\nUsing the same unique data recovery technology IntelligentScan as the heavyweight R-Studio, R-Undelete is an inexpensive and easy-to-use yet powerful file undelete solution for FAT and NTFS file systems.\r\n\r\nR-Undelete recovers files on any local disks recognized by the software. In addition, raw file recovery (scan for known file types) can be used for heavily damaged or unknown file systems.\r\nGraphic files, video and audio files (all files are supported if a proper codec is installed on the system) can be previewed before they are recovered.\r\n\r\nIn comparison with the previous versions, R-Undelete 4.x versions are supplemented with an improved wizard-style interface oriented on data recovery novices and an option to recover files from damaged and deleted partitions that bring R-Undelete to the highly rated R-Studio level except for some special data recovery features like RAID , Hex editing and Network support.\r\n\r\nFound files and folders can now be easily sorted by the original structure, file extension or file creation/modification time.\r\nAdded S.M.A.R.T. (Self-Monitoring, Analysis and Reporting Technology) attribute monitoring for hard drives allows the users to examine disk health and predict their possible failures. Microsoft's new file system ReFS (Resilient File System) is supported together with Windows 2012 Server OS. \r\n\r\nStarting from the version 4.5, R-Undelete creates an image and simultaneously scans the data being copied.\r\nThe program creates two files stored in the same place: an image file and a file with the scan info.\r\nThe upgraded file viewer supports the additional file formats including Adobe Acrobat pdf, Microsoft Office documents doc, xls, ppt (Office 97-2003), docx, xlsx, pptx.\r\nA new, faster, and more robust algorithm for Known File Types scanning and FAT file system processing has been implemented.\r\nThe algorithm is adapted to multi-core processing and prevents the program from freezing and crashing in a critical situation. \r\n\r\n***************************\r\nR-Studio utilities recover files: \r\n***************************\r\n\r\n* Removed without Recycle Bin, or when Recycle Bin has been emptied;\r\n* Removed by virus attack or power failure;\r\n* From disks with bad sectors. In this case, R-Undelete can first copy the entire logical disk or its part into an image file and then process the image file. This is especially useful when new bad sectors are constantly appearing on the disk, and remaining information must be immediately saved.\r\n* After the partition with the files was reformatted, even for different file system;\r\n*     When the partition structure on a hard disk was changed or damaged. In this case, R-Undelete scans hard disk trying to find previously existing partitions and then recovers files from found partitions.\r\n\r\n\r\n******************************************\r\nLicense type\r\n******************************************\r\nCommercial System kit\r\n\r\n******************************************\r\nInstallation\r\n******************************************\r\nExtract (65 MB disk space), run RUndelete6432.exe / RUndelete6464.exe\r\n\r\n******************************************\r\nHomepage: http://www.r-undelete.com/\r\n******************************************","torrent":{"xt":"urn:btih:01b1d85c89038fbcc809a249b4b9864d71130a95","amp;dn":"R-Undelete+4.9.Build+159222+Portable+%28x86%2Fx64%29+Multilingual","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"01b1d85c89038fbcc809a249b4b9864d71130a95","infoHashBuffer":{"type":"Buffer","data":[1,177,216,92,137,3,143,188,200,9,162,73,180,185,134,77,113,19,10,149]},"announce":[],"urlList":[]}}