{"title":"POtHS - Prophetic Times - 70 - The Lazarus Phenomenon and The Fi","uid":7486150,"size":3177970877,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:02137c3b7688bcb3f251b481045b28f0f12bd28a&amp;dn=POtHS+-+Prophetic+Times+-+70+-+The+Lazarus+Phenomenon+and+The+Fi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"POtHS11","files":-1,"time":1343596287,"description":"POtHS\nPouring Out the Holy Spiritruth\n\n\nPOtHS - Prophetic Times - 70 - The Lazarus Phenomenon and - The Final Frontier  \n\n   \n\n\n\n\n\nPOtHS Comments on This one: This is &quot;Spirit World Stuff&quot; That few will understand.\n\nThe Lazarus Phenomenon:\n\nThe Movie was produced by Johan Sturm of Eternal Productions, to explain the phenomenon of Near Death Experiences to a world wide audience. The Lazarus Phenomenon - The Movie has a running time of 100 minutes, and includes some amazing computer generated graphics of Heaven and Hell. The movie is Cinema quality, and has already been screened in many public cinemas in many countries. The narrative is documentary in style, filmed on the actual locations of the events portrayed, with fantastic special effects, and amazing music.\n\n\nThe Final Frontier - The Movie:\nSince the beginning of time we have been trying to find the answers for the reason for living. We also want to answer the question of what happens after we die. This movie attempts to answer the question, &quot;What will we all experience beyond the grave?&quot;\n\nTowards the end of the twentieth century, doctors became aware of a phenomenon in which resuscitated patients reported Near Death Experiences, otherwise known as NDE's, during which they encountered an after life reality. The phenomenon of NDE's, in which individuals reported consciousness beyond clinical death, has been documented for centuries.\n\nPatients report experiencing Heaven and Hell after clinical death, during NDE's. What exactly is this phenomenon? Is this phenomenon the result of brain chemicals causing hallucinations, or are the patients experiencing reality?\n\n\nAlso included:\nLearn Why Jesus BANNED Heaven From Famous Uganda Pastor\nShorts\nSigns of the Times\nSIN-ister Clips\nThe Holy Spirit\n\nThis is dedicated to my Mom who passed at 11:44 pm PST ON 1-25-2011. Now she knows.\n\n","torrent":{"xt":"urn:btih:02137c3b7688bcb3f251b481045b28f0f12bd28a","amp;dn":"POtHS+-+Prophetic+Times+-+70+-+The+Lazarus+Phenomenon+and+The+Fi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"02137c3b7688bcb3f251b481045b28f0f12bd28a","infoHashBuffer":{"type":"Buffer","data":[2,19,124,59,118,136,188,179,242,81,180,129,4,91,40,240,241,43,210,138]},"announce":[],"urlList":[]}}