{"title":"Tellurium in Organic Synthesis 2nd ed","uid":15383232,"size":2569444,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0262afc3ff535f8a0c79ade5f7ed9a6645fb0624&amp;dn=Tellurium+in+Organic+Synthesis+2nd+ed&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1469254285,"description":"Tellurium in Organic Synthesis 2nd ed - Nicola Petragnani, Hélio A. Stefani (AP, 2007).pdf\r\n\r\nThe increasing number of publications that use tellurium clearly demonstrates the important role of tellurium compounds as unique and powerful tools in a broad range of organic chemical manipulations, often characterized by their selective behavior.\r\nTellurium in Organic Synthesis provides an overview of the principal aspects of organic tellurium chemistry. Many chapters have been enriched and updated in this second edition. New chapters include overviews of toxicology and pharmacology and a review on the preparation and reactivity of several tellurium heterocycles. \r\nThe first part of the book focuses on the preparation of selected inorganic tellurium compounds and on the main classes of organotellurium compounds. The second part, and main interest of the book, details the use of these inorganic and organic compounds as reagents to perform specific organic manipulations and synthesis. Reactions covered include reduction, formation and reaction of anionic species, deprotection, tellurium cyclizations, formation of alkenes, use of vinyllic tellurides, free radical chemistry, transmetallations, and removal of tellurium.\r\n\r\n* Overview of inorganic and organic tellurium chemistry \r\n* Synthetic applications of tellurium compounds\r\n* All topics accompanied by detailed experimental procedures","torrent":{"xt":"urn:btih:0262afc3ff535f8a0c79ade5f7ed9a6645fb0624","amp;dn":"Tellurium+in+Organic+Synthesis+2nd+ed","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0262afc3ff535f8a0c79ade5f7ed9a6645fb0624","infoHashBuffer":{"type":"Buffer","data":[2,98,175,195,255,83,95,138,12,121,173,229,247,237,154,102,69,251,6,36]},"announce":[],"urlList":[]}}