{"title":"Living Free - Tips and Tricks for LIving Off Grid","uid":14529992,"size":397790,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0292bb0ce78b9cf0668c0a9a465c0806a4ad1103&amp;dn=Living+Free+-+Tips+and+Tricks+for+LIving+Off+Grid&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"coolart99","files":1,"time":1462425966,"description":"\n\r\nMy name is Art (aka) GHOST WOLF ART and I'm are working on getting a camper van. My hope is to go across the country working on pc repairs for people out there that needs my help..  Following along with me as I start my Journey Series Video of me making it one day at a time. Experience my highs and lows as I will make mistakes and learn.  I completely buy into the idea of living in a van full time and this channel is intended to be a chronicle of my struggle in developing a life of full time travel with the end goal of funding it entirely thing with pc/laptop repair income that I can earn anywhere,Today I am acting on a freedom dream instead of just talking about it. One step at a time.So come alone with me on my videos and see the real life that you too could be doing..\r\n\r\ni also need help to fine my brother who was lasted seen in New Mexico the state, please share this book to help spread the word. \r\n\r\nDisclaimer The views and opinions stated in this book are all simply the Authors opinions. At no point are they to be considered fact. Anything suggested in this book is also to be used by your digression. The Author is not responsible for any decisions you make in your own life. \r\n\r\nWe all know that it takes a certain type of person to want to leave the hustle and bustle of mainstream society behind and find a quiet, peaceful place to let all the stress pass us by. In fact, since you’re reading this right now, I bet you’re one of those people. Well, I’m here to tell you from experience that it’s very possible, whether you’re over your head in bills or not. Things can change, and you’re obviously taking the first step. Why are more people searching for a way out of mainstream society these days? I think it’s because life has become so complicated. \r\n\r\nThere are laws for everything you do. According to surveys, most people on average commit one or two felonies a day without even being aware of it. That’s a scary thought. We have neighborhoods now with associations that dictate what, when and where you can place anything in your own yard that you pay for. We have law enforcement officers that are given illegal quotas for tickets they give out each month. Cameras are being placed all around us watching our every move with facial recognition software that logs everything you do. \r\n\r\nWhere you go, and what you buy. Our cellular phones track where we are. And make us available anytime day or night. No escape. We have schools that charge for education. We have careers that are repetitious and mind numbing. That of course, we need, in order to pay for the overpriced entertainment that we only need to help us escape the reality of the same job that pays for it","torrent":{"xt":"urn:btih:0292bb0ce78b9cf0668c0a9a465c0806a4ad1103","amp;dn":"Living+Free+-+Tips+and+Tricks+for+LIving+Off+Grid","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0292bb0ce78b9cf0668c0a9a465c0806a4ad1103","infoHashBuffer":{"type":"Buffer","data":[2,146,187,12,231,139,156,240,102,140,10,154,70,92,8,6,164,173,17,3]},"announce":[],"urlList":[]}}