{"title":"The Battle of Salamis (2011) epub","uid":9508290,"size":2096113,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:02b698f8dcceb62ab338eb37159a3c5f078b8e97&amp;dn=The+Battle+of+Salamis+%282011%29+epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bookzilla","files":1,"time":1390355766,"description":"The Battle of Salamis: The Naval Encounter that Saved Greece -- and Western Civilization\n\n\nOn a late September day in 480 B.C., Greek warships faced an invading Persian armada in the narrow Salamis Straits in the most important naval battle of the ancient world. Overwhelmingly outnumbered by the enemy, the Greeks triumphed through a combination of strategy and deception. More than two millennia after it occurred, the clash between the Greeks and Persians at Salamis remains one of the most tactically brilliant battles ever fought. The Greek victory changed the course of western history -- halting the advance of the Persian Empire and setting the stage for the Golden Age of Athens. \n In this dramatic new narrative account, historian and classicist Barry Strauss brings this landmark battle to life. He introduces us to the unforgettable characters whose decisions altered history: Themistocles, Athens' great leader (and admiral of its fleet), who devised the ingenious strategy that effectively destroyed the Persian navy in one day; Xerxes, the Persian king who fought bravely but who ultimately did not understand the sea; Aeschylus, the playwright who served in the battle and later wrote about it; and Artemisia, the only woman commander known from antiquity, who turned defeat into personal triumph. Filled with the sights, sounds, and scent of battle, The Battle of Salamis is a stirring work of history.","torrent":{"xt":"urn:btih:02b698f8dcceb62ab338eb37159a3c5f078b8e97","amp;dn":"The+Battle+of+Salamis+%282011%29+epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"02b698f8dcceb62ab338eb37159a3c5f078b8e97","infoHashBuffer":{"type":"Buffer","data":[2,182,152,248,220,206,182,42,179,56,235,55,21,154,60,95,7,139,142,151]},"announce":[],"urlList":[]}}