{"title":"EMINEM RELAPSE ALBUM","uid":4970440,"size":182997148,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:038cde1b2f048c9150905d2206a6b49fcd48fd3b&amp;dn=EMINEM+RELAPSE+ALBUM&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"alanwatson","files":-1,"time":1245744434,"description":"One of the biggest selling rappers of all time, Eminem returns to blow up the hip-hop scene with his sixth studio album, Relapse. Venturing back to the lab with iconic producer and mentor Dr. Dre, the prolific lyricist reignites his early sound to cook up a collection of fiery tracks that impact with sinister emotion and snarl ferociously with the rhymester's characteristic wit.\n\nIn 2004, Eminem surprised fans worldwide with the news that he would be taking a break from the music industry. Five years on, and with greatest hits collection Curtain Call being the only release to break his musical hiatus, the rapping icon has returned rejuvenated and at the top of his game. Relapse opens in true Slim Shady-style with the comedic skit 'Dr. West'. Akin to the opening tracks of The Marshall Mathers LP, the light-heartedness of the introduction gives way to the dark and vicious tirade '3 a.m.' With a bouncing beat, the track similar to The Slim Shady LP's 'Bonnie &amp; Clyde', dips up and down as Marshall spits a series of violent, horror-filled lyrics that flow like perverse poetry. Eminem's ability as a songwriter shines through as he tackles the familiar topics of his mother and drug abuse on the captivating 'My Mom' and 'Must Be The Ganja' respectively. Challenging his demons, Marshall lets the sinister vibes run strong with the venomous outbursts 'Medicine Ball' and 'Insane'. Heavy in content, these tracks offer a shady contrast to the top 5 singles 'We Made You' and 'Crack A Bottle'. Fuelled by Dr. Dre's jumping beats and tongue-in-cheek references to popular culture, the sing-a-long anthems have a carnival feel that highlights the contagiously fun side of Eminem, seen previously on the chart-topping single 'Without Me'. As well as producing the record, Dre offers his impressive vocal services on the colossal 'Old Time's Sake'. Pulling from both artists previous work, the track layers modern stylistics with old school sounds to deliver a complex and infectious sound that brings all of the album's diverse elements together in one glorious mix.\n\nThis record offers something for everyone. By sampling the fundamentals of tracks from all of his releases, ranging from his breakthrough debut right through to his last long player, Encore, Eminem has created a riotous, highly addictive record that teems with tension. Possibly one of the most highly anticipated comeback albums in music history, Relapse has exceeded even the greatest of expectations.\n\n1. Dr. West (Skit)\n2. 3 a.m.\n3. My Mom\n4. Insane\n5. Bagpipes From Baghdad\n6. Hello\n7. Tonya (Skit)\n8. Same Song &amp; Dance\n9. We Made You\n10. Medicine Ball\n11. Paul (Skit)\n12. Stay Wide Awake\n13. Old Time's Sake\n14. Must Be The Ganja\n15. Mr. Mathers (Skit)\n16. Deja Vu\n17. Beautiful\n18. Crack A Bottle\n19. Steve Berman (Skit)\n20. Underground/Ken Kaniff","torrent":{"xt":"urn:btih:038cde1b2f048c9150905d2206a6b49fcd48fd3b","amp;dn":"EMINEM+RELAPSE+ALBUM","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"038cde1b2f048c9150905d2206a6b49fcd48fd3b","infoHashBuffer":{"type":"Buffer","data":[3,140,222,27,47,4,140,145,80,144,93,34,6,166,180,159,205,72,253,59]},"announce":[],"urlList":[]}}