{"title":"Aphrodiziac CD-2","uid":14581954,"size":726554624,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:040084a5423abcf4f8653d752c3847cd096e0166&amp;dn=Aphrodiziac+CD-2&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"hunter534","files":1,"time":1462882363,"description":"Gestapo Cabaret, Giant Black Cocks, Whores and Nazis, Filthy Fucking, Leather Queening, Bondage Slave, Rubber Vac-Bag, Pussy Shave, Suspended Bitches, Throats Are Fucked, Faces Splattered, Nothing Ducked, Poopshoots Plundered, Cracks Are Stretched, The Word That Stays Inside Your Head...Aphordiziac! Tanya Hyde is back with this devilishly dark and sexy flick. Filled with fetish attire, huge sex toys, big cocks hungry for shaved cunts. Once you enter Tanya's world, you'll never want to leave. The curvaceous Aletta is our first temptress; walking into an abandoned warehouse she soon stumbles across a masked stud, tied up. Soon Aletta is sucking on his huge erect dick as he moans with pleasure. Aletta then discovers another sex slave; she sits on his face then proceeds to ride his big black cock, twirling her nipples with her fingers as she gets her fix of cock. This is just the beginning! These horny studs soon stuff all of Aletta's holes in a fast paced DP scene, emptying their white juices all over her pert ass. Dark haired beauty Ree Petra and the luscious Claudia Rossi get hot and heavy in a steamy lesbian scene, soon they crave some cock and ride a muscular slave. 50's style Cindy Dollar and Uniformed babe Simone Style get there pussies and asses stuffed by two suited men in a bar. Stunning Lucy Belle takes on three men in an explosive four way scene. No hole is left unscathed.\r\n\r\nGenre: Anal, Big Tits, Interracial, IR, Gangbang\r\nCast: Aletta Ocean, Ree Petra, Claudia Rossi, Missy Macabre, Cindy Dollar, Simonne Style, Lucy Belle, Marc Rose, Andy Mann, Jay Snakes, Omar\r\n\r\nCOVER+SCEENSHOT:\r\n \nhttp://photo-up.info/img-5731b3e033ee3.html \r\n \nhttp://photo-up.info/img-5731b3eacfee6.html","torrent":{"xt":"urn:btih:040084a5423abcf4f8653d752c3847cd096e0166","amp;dn":"Aphrodiziac+CD-2","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"040084a5423abcf4f8653d752c3847cd096e0166","infoHashBuffer":{"type":"Buffer","data":[4,0,132,165,66,58,188,244,248,101,61,117,44,56,71,205,9,110,1,102]},"announce":[],"urlList":[]}}