{"title":"Shakira - Don't Bother","uid":5146815,"size":166225924,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:041b5496f65441788431fe9cddbd2cf1782f05c0&amp;dn=Shakira+-+Don%5C%27t+Bother&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":-1,"time":1257308783,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;Don't Bother&quot; is the first single released from Shakira's second English language studio album, Oral Fixation Vol. 2 (2005).\n\nThe music video for the song, directed by the visual artist Jaume de Laiguana, premiered on MTV's Making the Video on October 27. The music video for the song shows Shakira's boyfriend returning at her home early in the morning (which insinuates that he was with another woman), and lying down to sleep. When he sleeps, Shakira picks up his car keys and drives it to a scrap heap. When she gets there she starts destroying his car, doing a &quot;voodoo&quot; on him using his car. Everything she does to his car is reflected on his body. Another vignette shows her lying on his body.\n\nThe music video for &quot;Don't Bother&quot; is perhaps Shakira's most sensual, - along with the video for &quot;La Tortura&quot; -; the actor who portraits Shakira's boyfriend is shirtless on most of the duration of the music video, Shakira is shown in the shower with him (both with clothes on) wearing a low-cut nightgown, later committing an act of wanton vandalism.\n\nThe car ruined in the video was a 1967 Ford Mustang &quot;Shelby GT 500&quot; replica built to look like the &quot;Eleanor&quot; car from the movie Gone in 60 Seconds. The pink guitar played by Shakira was custom made by Hamer Guitars. It is a Hamer Special Korina Jr. model with a Seymour Duncan SP-90 soapbar pickup.\n\nThis video can be seen on Oral Fixation Volumes 1 &amp; 2 Bonus DVD.\n\nShe promoted the single with a live performance on 2005 MTV Europe Music Awards.\n\nThe lyrics of the song describe a woman who has been left by her boyfriend for another girl that is unbelievably superior in almost all aspects. She tells him not to bother making up for hurting her, because she will not be crying for him; instead, she will move on with her own life. Although, these expressions may be ironic when she says: &quot;Don't Bother, be unkind.&quot;\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:041b5496f65441788431fe9cddbd2cf1782f05c0","amp;dn":"Shakira+-+Don%5C%27t+Bother","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"041b5496f65441788431fe9cddbd2cf1782f05c0","infoHashBuffer":{"type":"Buffer","data":[4,27,84,150,246,84,65,120,132,49,254,156,221,189,44,241,120,47,5,192]},"announce":[],"urlList":[]}}