{"title":"Bug Me Videos 1-10","uid":10486208,"size":12220468052,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:053f824d5a6efd51c211cb863582871c795cced5&amp;dn=Bug+Me+Videos+1-10&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"fraggie1975","files":11,"time":1404435056,"description":"All bugme video's.\nNot my rip!\nProps to original ripper!!\n\nVolume 1 General Maintenance, \nby Rick Higgins\t\n\nRick Higgins (a real VW mechanic) guides you step-by-step through an oil change, tune up, valve adjustment, setting timing, tuning carburetor, adjusting clutch, adjusting belt, and adjusting brakes. Running time: 62 min.\n\n---------------------------------------------\n \t\nVolume 2 Remove Engine, \nby Rick Higgins\t\n\nIn Volume 2 &quot;MOTOR REMOVAL &amp; CLUTCH SERVICE &quot;, Bug Me Video's Rick Higgons demonstrates how to pull the motor. He starts with showing where and how to lift the car and secure it on stands. Then shows in detail how to remove each necessary screw and nut to separate the motor from the car. Over 1 hour of easy to follow instruction includes:\n\nPULLING MOTOR  and REPLACING:\nCLUTCH\nRELEASE BEARING\nCRANK-FLYWHEEL SEAL\nREAR TRANSMISSION MOUNTS\nCLUTCH CABLE \n\n----------------------------------------------\n\n \t\t\t\nVolume 3 Complete Engine Rebuild, \nby Rick Higgins\t\n\nVolume 3: After the Volkswagen engine is removed (Volume 2), covers a complete engine rebuild including tear down, inspection, clean up and rebuilding. Thorough, easy to follow video. 158 minutes. \n\n-----------------------------------------------\n\n \t\t\nVolume 4 VW Brakes, \nby Rick Higgins\t\n\nVolume 4: Shows Volkswagen brake system operation and troubleshooting. Learn to replace the master cylinder, brake lines and hoses, wheel cylinders, drums, calipers and more! 105 minutes\n\nVolume #4 begins by showing several ways to remove the rear axle nut that holds the rear brake drum on. Once off we inspect the different brakes parts and show how to replace a faulty rear axle grease seal which can ruin new brakes if not corrected.If you are just getting into the VW mechanic thing, you NEED this DVD. Excellent pictures, narration, and tech. The information here is reliable and well presented, and not leading you down the wrong road! Consider the whole set! \n\n------------------------------------------------\n\n \t\nVolume 5 Transmission Replacement, by Rick Higgins\n\nVolume 5: Features the removal and replacement of older Volkswagen swing axle transmission and the newer Independent Rear Suspension (I.R.S.) transmission. 105 minutes. All the decisions and aspects of when you are either rebuilding a transaxle, or exchanging it. As usual, outstanding video and narration, and Rick Higgins makes it look really easy. You can save a LOT of $ by doing the job yourself after watching this one. Since used and rebuilt Transmissions are still readily available for the VW at Prices that are barely more than the cost of the parts to rebuild them, we are producing this video to show how to exchange your transmission. Later we go inside on a rebuild! \n\n------------------------------------------------\n\n \t\t\t\nVolume 6 Floor Pans, \nby Rick Higgins\t\n\nVolume 6: This instructional video features Volkswagen floor pan repair and replacement, including removal and reinstallation of the body, preparation for repair, installation of floor pan seals and more. 105 minutes  \n\n------------------------------------------------\n\n \t\nVolume 7 Heater Channel Replacement, \nby Rick Higgins\t\n\nVolume 7: This video shows you how to replace VW heater channels, lower rear quarter panels and the lower front hinge pillar. Replacement is shown both with the body on AND off the chassis. Also includes installation of the convertible reinforcement rails. 100 minutes.\n\n------------------------------------------------\n\nVolume 8 &quot;Type 4 Engine Rebuild&quot;\nby Jake Raby\n\nA complete engine rebuild video, it covers the type 4 engine used in the late model bus, and 914 Porsche.\n\nIncludes:\n-Tear down\n-Inspection\n-Reassembly\n\nLearn all the details of what makes a type 4 engine so different, and the right way to go about rebuilding one.\n\nRunning time: 3 hours.\n\n------------------------------------------------\n\n \t\nVolume 9, Wiring, \nby Rick Higgins\n\nVolume 9: Installation of a complete wiring harness on a 1963 Volkswagen Bug. The differences and progression in the wiring of both standard and Super Beetles is also shown. Also includes modifications to solve the problem of not being able to replace obsolete parts. 160 minutes. This video also shows modifications necessary because of obsolete components (in case you can't find them).\n\nWARNING: This does NOT cover fuel injection!\n\n------------------------------------------------\n\n \t\nVolume 10, Electrical Troubleshooting, \nby Rick Higgins\n\t\n\nVolume 10: The newest addition to the Volkswagen Bug-Me-Video collection might just be the answer to your electrical nightmare. This video will show you Electrical Troubleshooting tips for battery care, starting system, charging system, how to convert 6 Volt to 12 Volt, turn signal arm replacement, ignition switch, how to install gauges, how to solder and much, much more! \n ","torrent":{"xt":"urn:btih:053f824d5a6efd51c211cb863582871c795cced5","amp;dn":"Bug+Me+Videos+1-10","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"053f824d5a6efd51c211cb863582871c795cced5","infoHashBuffer":{"type":"Buffer","data":[5,63,130,77,90,110,253,81,194,17,203,134,53,130,135,28,121,92,206,213]},"announce":[],"urlList":[]}}