{"title":"From Gutenberg to Zuckerberg (2014) John Naughton (multi)","uid":9505985,"size":5116367,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:06111b76af5836a0469626a9b295f25788437877&amp;dn=From+Gutenberg+to+Zuckerberg+%282014%29+John+Naughton+%28multi%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"7","files":-1,"time":1390317962,"description":"From Gutenberg to Zuckerberg: Disruptive Innovation in the Age of the Internet (2014) John Naughton (multi)\n\n\nFrom Gutenberg to Zuckerberg: Disruptive Innovation in the Age of the Internet by John Naughton\n\n\nFormat: mobi/epub/azw3\nLength: 352 pages\nGenre: Non-Fiction/Science &amp; Technology\nDate: 7 January 2014\n\nAn accessible guide to the internet...Naughton draws on more than two decades of study to explain how the internet works and the challenges and opportunities it will offer to future generations. -- The Times\n\nOur society has gone through a weird, unremarked transition: we've gone from regarding the Net as something exotic to something that we take for granted as a utilitarian necessity, like mains electricity or running water. In the process we've been remarkably incurious about its meaning, significance or cultural implications. Most people have no idea how the network works, nor any conception of its architecture; and few can explain why it has been - and continues to be - so uniquely disruptive in social, economic and cultural contexts. In other words, our society has become dependent on a utility that it doesn't really understand.\n\nJohn Naughton has distilled the noisy chatter surrounding the internet's relentless evolution into nine clear-sighted and accessible areas of understanding. In doing so he affords everyone the requisite knowledge to make better use of the technologies and networks around us, and see lucidly into their future implications.\n\nAlong the way From Gutenberg to Zuckerberg covers areas as diverse as the science of complexity, the economics of abundance, the appeal of disruption and the problematic nature of intellectual property. From Gutenberg to Zuckerberg gives you all the basic, conceptual equipment you need to understand the Internet phenomenon.\n\nAuthor:\n\nJohn Naughton is the bestselling author of A Brief History of the Future: The Origins of the Internet. He is also the Observer's 'Networker' columnist and a prominent blogger at memex.naughtons.org. Naughton is also vice president of Wolfson College, Cambridge, England, where he lives.  \n\n","torrent":{"xt":"urn:btih:06111b76af5836a0469626a9b295f25788437877","amp;dn":"From+Gutenberg+to+Zuckerberg+%282014%29+John+Naughton+%28multi%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"06111b76af5836a0469626a9b295f25788437877","infoHashBuffer":{"type":"Buffer","data":[6,17,27,118,175,88,54,160,70,150,38,169,178,149,242,87,136,67,120,119]},"announce":[],"urlList":[]}}