{"title":"Martin Rees - Just Six Numbers","uid":6620866,"size":43322044,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:0634e036a521f368c35077d1f8c91e3f8748c76e&amp;dn=Martin+Rees+-+Just+Six+Numbers&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":20,"time":1313988680,"description":"Just Six Numbers: The Deep Forces That Shape The Universe\nBy Martin Rees\n\n\nFormat: MP3\nBitrate: 32 Kbps\n\n\nJust six numbers govern the shape, size, and texture of our universe. If their values were only fractionally different, we would not exist: nor, in many cases, would matter have had a chance to form. If the numbers that govern our universe were elegant--1, say, or pi, or the Golden Mean--we would simply shrug and say that the universe was an elegant mathematical puzzle. But the numbers Martin Rees discusses are far from tidy. Was the universe tweaked or is it one of many universes, all run by slightly different, but equally messy, rules?\n\nThis is familiar ground, though rarely so comprehensively explored. What makes Rees's book exceptional is his conviction that cosmology is as materialistic and as conceptually simple as any of the earth sciences. Indeed, cosmology is simpler in one important respect: once the starting point is specified, the outcome is in broad terms predictable. All large patches of the universe that start off the same way end up statistically similar. In contrast, if the Earth's history were re-run, it could end up with a quite different biosphere.\n\nRees demonstrates how the cosmos is full of fossils from which we can deduce how our universe developed as surely as we infer the earth's past from the relics found in sedimentary rocks. Rees's theme is nothing less than the colossal richness of the universe. It is an ambitious book, but if anything, it deserves to be longer.\n\n\nRunning Time: 3:00:20\n","torrent":{"xt":"urn:btih:0634e036a521f368c35077d1f8c91e3f8748c76e","amp;dn":"Martin+Rees+-+Just+Six+Numbers","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0634e036a521f368c35077d1f8c91e3f8748c76e","infoHashBuffer":{"type":"Buffer","data":[6,52,224,54,165,33,243,104,195,80,119,209,248,201,30,63,135,72,199,110]},"announce":[],"urlList":[]}}