{"title":"HISTORY OF POP AND ROCK MUSIC - part 454","uid":7998663,"size":784862467,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:065acf46103cf9cf9e62c8417222f4b29648b635&amp;dn=HISTORY+OF+POP+AND+ROCK+MUSIC+-+part+454&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"pupovaczlatko","files":-1,"time":1357688723,"description":"\n\n                       PART  454\n\n  \n                 SEPULTURA  -  Territory  (1993)\n                 SEPULTURA  - Roots Bloody Roots  (1996)\n                 LIVING SACRIFICE  -  Reject  (1997)\n                 KORN  - Coming Undone  (2006)\n\n\n\n       &quot;Territory&quot; is Sepultura's sixth official single, and the last of three to be taken from the album &quot;Chaos A.D&quot;., released in 1993. Like most of the band's singles, the song is one of the band's best-known songs and remains a concert staple to this day. A music video was filmed for the single which features the band playing and walking through the desert, often daubed in Dead Sea mud, intercut with footage of slums and favelas and footage from Israel and the Palestinian territory: armed Israeli soldiers and policemen, pro-Palestinian graffiti, Bedouins, Haredim kissing the stones of the Western Wall, pages of the Qur'an and the Hebrew Bible and Christian ceremonies in the Old City of Jerusalem. It ends with a newspaper clip about the signing of the Oslo Accords and a walking soldier.  The video, directed by Paul Rachman, was released to TV stations in October 1993. It won the International Viewer's Choice award for best video (Brazil) at the 1994 MTV Video Music Awards. In 1995 it was released on the VHS Third World Chaos, which was re-released on DVD in 2002 as part of Chaos DVD.\n\n      &quot;Roots Bloody Roots&quot; is a song by Sepultura, the song is released as the first single from their sixth album Roots, released in 1996. The song is the band's best known and remains a concert staple to this day. This song is one of the most widely recognized metal songs of the '90's. Like most Sepultura songs, the song is thought to be another protest song. The most common meaning that fans come up with is that everyone needs to preserve their own roots, and not modernize, forget or feel shame for them. This is shown in the lyrics We don't need to change, our ways to be saved. The music video shows Brazilians practicing Capoeira and native tribes playing the drums in their tribe uniforms.\nAnother theory is that Max is talking about his own country's roots. The video shows scenes of Catholic churches. It can also be about slavery in Brazil, and how blood was spilt so generations to come wouldn't be enslaved. This is shown in the lyrics And all I want to see, set us free.\n\n      &quot;Reject&quot; is a song by the Christian metal band Living Sacrifice, featured on their 1997 album &quot;Reborn&quot;.This is the band's fourth album and first album on Solid State Records. &quot;Reborn&quot; is also the first album in which Bruce Fitzhugh would serve as the band's vocalist. This was guitarist Jason Truby's last album with the band, his brother Chris Truby would also appear on this recording as the band's bassist. \n\n     &quot;Coming Undone&quot; is a song written and recorded by nu metal band Korn and The Matrix for Korn's seventh studio album, &quot;See You on the Other Side&quot;. It was released as the album's second single in February 2006.The song reached number four on Billboard's Mainstream Rock Songs chart and number fourteen on the Alternative Songs chart. It also managed to peak at number seventy-nine on the Hot 100, making it Korn's fourth biggest hit on the chart.\n","torrent":{"xt":"urn:btih:065acf46103cf9cf9e62c8417222f4b29648b635","amp;dn":"HISTORY+OF+POP+AND+ROCK+MUSIC+-+part+454","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"065acf46103cf9cf9e62c8417222f4b29648b635","infoHashBuffer":{"type":"Buffer","data":[6,90,207,70,16,60,249,207,158,98,200,65,114,34,244,178,150,72,182,53]},"announce":[],"urlList":[]}}