{"title":"A Christmas Far from Home (2014).epub Gooner","uid":13082056,"size":11327634,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:06d7b32f8b782ebfa2b51d4f88b5ddd08cd56015&amp;dn=A+Christmas+Far+from+Home+%282014%29.epub+Gooner&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"GoonerTPB","files":1,"time":1450910047,"description":"A Christmas Far from Home - An Epic Tale of Courage and Survival during the Korean War (2014).epub Gooner\r\n\r\nPublisher: Da Capo Press; First Edition edition (October 28, 2014)\r\nLanguage: English\r\nISBN-10: 0306822326\r\nISBN-13: 978-0306822322\r\n\r\nThe day after Thanksgiving, five months into the Korean War, General Douglas MacArthur flew to American positions in the north and grandly announced an end-the-war-by-Christmas offensive, despite recent evidence of intervention by Mao's Chinese troops. Marching north in plunging temperatures, General Edward Almond's X Corps, which included a Marine division under the able leadership of General Oliver Smith, encountered little resistance. But thousands of Chinese, who had infiltrated across the frozen Yalu River, were lying in wait and would soon trap tens of thousands of US troops.\r\n\r\nLed by the Marines, an overwhelmed X Corps evacuated the frigid, mountainous Chosin Reservoir vastness and fought a swarming enemy and treacherous snow and ice to reach the coast. Weather, terrain, Chinese firepower, and a 4,000-foot chasm made escape seem impossible in the face of a vanishing Christmas. But endurance and sacrifice prevailed, and the last troopships weighed anchor on Christmas Eve.\r\n\r\nIn the tradition of his Silent Night and Pearl Harbor Christmas, Stanley Weintraub presents another gripping narrative of a wartime Christmas season","torrent":{"xt":"urn:btih:06d7b32f8b782ebfa2b51d4f88b5ddd08cd56015","amp;dn":"A+Christmas+Far+from+Home+%282014%29.epub+Gooner","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"06d7b32f8b782ebfa2b51d4f88b5ddd08cd56015","infoHashBuffer":{"type":"Buffer","data":[6,215,179,47,139,120,46,191,162,181,29,79,136,181,221,208,140,213,96,21]},"announce":[],"urlList":[]}}