{"title":"Miles Davis - Miles in Tokyo (1964) [Jazz][mp3 192][h33t][schon5","uid":4948933,"size":78265872,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:0798b3e0880640ebf4a7b79a59b7457f5957654d&amp;dn=Miles+Davis+-+Miles+in+Tokyo+%281964%29+%5BJazz%5D%5Bmp3+192%5D%5Bh33t%5D%5Bschon5&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"schon55","files":12,"time":1244796010,"description":"Miles Davis - Miles in Tokyo \nRecording Date: July 14, 1964\nAudio CD: March 15, 2005 \nLabel: Sony \nTime: 54:16\nBitrage: 192 kbps\n\nRecorded in '64, Miles in Tokyo finds the iconic Miles Davis performing with his almost-second great quintet. Tenor saxophonist Sam Rivers, a more accomplished and daring experimentalist than his predecessor, George Coleman, joined the group after a fellow Bostonian, drummer Tony Williams, recommended him to Davis.  There are times on this recording when one might understand why Davis and Rivers never meshed, and times when the partnership is quite wonderful, though brief. \n\nOn &quot;If I Were a Bell&quot;, for example, after a lucid and melodic statement by Davis, Rivers purposely goes off- center on his solo.  He does it with enough force that his motions are neither subtle nor nuanced; they're noticeable.  Yet on the more forlorn and dark &quot;My Funny Valentine&quot;, he shows greater care to stay within the song's melody, a treatment that resonates well with the rest of the group. \n\n&quot;So What&quot; is taken at a faster pace than the version on the seminal Kind of Blue with, again, Davis and Rivers varying in their melodic approaches. By &quot;Walkin&quot;, though, it is Davis who alters his style, accepting some restless elements into his approach. He flies fast and furiously through his solo, provoking Williams into some manic beats. Williams, for his part, always sounded best in contexts that were more &quot;out&quot; than &quot;in&quot;, and the inclusion of Rivers on this date certainly allowed him greater, rhythmic latitudes. Herbie Hancock, as well, finds some dissonant and interesting moments on &quot;Walkin'&quot;.  The finale, &quot;All of You&quot;, finds Davis muted and lyrical, Rivers wild but compliant, and the rest of the group providing a wonderful groove. \n\nMonths after this concert in September of '64, the definitive version of the second great quintet, with Wayne Shorter on tenor, finally took form.  The almost-second great quintet heard on Miles in Tokyo is an aberration, a rare gem, and worth investigating. ~ Allaboutjazz.com\n\nPersonnel:\nMiles Davis (trumpet)\nSam Rivers (tenor saxophone)\nHerbie Hancock (piano)\nRon Carter (bass)\nTony Williams (drums)\n\nTracks:\n1. Introduction by Teruo Isono 1:10\n2. If I Were A Bell 10:17\n3. My Funny Valentine 12:50\n4. So What 8:05\n5. Walkin' 9:15\n6. All Of You 11:18 \n7. Go-Go (Theme and Announcement) 1:20","torrent":{"xt":"urn:btih:0798b3e0880640ebf4a7b79a59b7457f5957654d","amp;dn":"Miles+Davis+-+Miles+in+Tokyo+%281964%29+%5BJazz%5D%5Bmp3+192%5D%5Bh33t%5D%5Bschon5","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0798b3e0880640ebf4a7b79a59b7457f5957654d","infoHashBuffer":{"type":"Buffer","data":[7,152,179,224,136,6,64,235,244,167,183,154,89,183,69,127,89,87,101,77]},"announce":[],"urlList":[]}}