{"title":"Ren and Stimpy Crock O Christmas","uid":4571078,"size":66820034,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:084f0e475b58203c9bffbc56204f136184f9d503&amp;dn=Ren+and+Stimpy+Crock+O+Christmas&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"crunkest","files":13,"time":1229059826,"description":"&gt;160 kbps VBR, found on friend's private ftp in 2007\n\nfrom http://en.wikipedia.org/wiki/Crock_O%27_Christmas\n\nRen &amp; Stimpy's Crock O' Christmas is a humorous music/story Christmas album featuring Nickelodeon's early 1990's animated characters Ren &amp; Stimpy.\n\nThe album, released September 21, 1993, follows Ren and Stimpy as they prepare for the holidays; in their case, the holiday is &quot;Yaksmas Eve,&quot; a reference to the second episode of the original 1991 season in which they prepare for Yak Shaving Day and a visit from the Gilded Yak via his flying &quot;enchanted canoe.&quot; Soiled diapers are hung from mantlepieces in lieu of Christmas stockings while another tradition calls for filling of one's uncle's boots with coleslaw. It is hoped that the Gilded Yak, who lives at the &quot;West Pole&quot; and who appears via the drain of the bathtub, will leave shaving cream scum in the bathroom sink.\n\nRen &amp; Stimpy's Crock O' Christmas was re-released on compact disc August 5, 1997 on the Rhino Kid record label. As in the case with later episodes of the television program, Billy West provided the speaking and singing voices of both Ren and Stimpy.\n\n\n[edit] Track listing\n\n    * 1. &quot;Fleck the Walls&quot; - Stimpy explains to Ren that it is Yaksmas Eve to the tune of Deck the Halls.\n    * 2. &quot;Cat Hairballs&quot; - Stimpy sings about the gifts he can make out of his hairballs to the tune of Jingle Bells.\n    * 3. &quot;We Wish you a Hairy Chestwig&quot; - Ren and Stimpy sing about the &quot;chestwig&quot; they've gotten for Mr. Pipe to the tune of We Wish You a Merry Christmas, wishing him a &quot;hairy chestwig and a bucket of beards&quot;.\n    * 4. &quot;It's A Wizzleteats Kind Of Christmas&quot; - Stimpy sings a song about Stinky Wizzleteats, singer of the &quot;Happy Happy Joy Joy&quot; song; his &quot;souped-up sausage cart&quot; is the basis for the album cover.\n    * 5. &quot;We're Going Shopping&quot; - Stimpy drags Ren into the mall to do some Christmas shopping.\n    * 6. &quot;Yak Shaving Day&quot; - Ren and Stimpy stumble on the secret gathering place of the Gilded Yaks.\n    * 7. &quot;What Is Christmas?&quot; - Stimpy and his son Stinky the Fart remember the events of &quot;Son of Stimpy&quot;.\n    * 8. &quot;Cobb To The World&quot; - Ren and Stimpy sing the song of &quot;good king&quot; Wilbur Cobb, a senile senior citizen, to the tune of Joy to the World.\n    * 9. &quot;Happy Holiday Hop&quot; - Ren and Stimpy attend TV star Muddy Mudskipper's holiday celebration.\n    * 10. &quot;I Hate Christmas&quot; - While Stimpy goes to bed, Ren sings the blues about his personal disdain for the holiday.\n    * 11. &quot;The Twelve Days Of Yaksmas&quot; - Ren and Stimpy count down the Yaksmas gifts of Ren's cousin SvÃƒÂ«n Hoek to the tune of The Twelve Days of Christmas.\n    * 12. &quot;Decorate Yourself&quot; - Ren and Stimpy sing an anthem in the style of We Are the World about decorating oneself for the holidays.\n","torrent":{"xt":"urn:btih:084f0e475b58203c9bffbc56204f136184f9d503","amp;dn":"Ren+and+Stimpy+Crock+O+Christmas","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"084f0e475b58203c9bffbc56204f136184f9d503","infoHashBuffer":{"type":"Buffer","data":[8,79,14,71,91,88,32,60,155,255,188,86,32,79,19,97,132,249,213,3]},"announce":[],"urlList":[]}}