{"title":"Douglas Reeman","uid":11178184,"size":876331135,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:0a4f8b4c35b515c1e4d99d70816b8bec91fa850d&amp;dn=Douglas+Reeman&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":5,"uploader":"mustafa-crap","files":40,"time":1412816290,"description":"Not my rips.\nDouglas Reeman (Blackwood Family), books 1, 2, 3 and 4. I do not have book 5 Knife Edge, can some one post please.\n\nBook 1 - Badge of Glory\n\nIt was an age of Empire, an age of contrast, and an age of dramatic change - and one which would determine the destinies of nations as well as of men. Captain Philip Blackwood of the Royal Marines rejoins his ship, HMS Audacious, in the August of 1850, anxious to get back into action. Per Mare - Per Terram is the Marines' motto.\n\nIn the torturous heat of Africa, where they are sent to stamp out the remaining strongholds of slavery, and later, in the bitter war of the Crimea, Philip Blackwood and his men learn to obey it without question. The first novel in an enthralling and colorful saga, spanning 150 years in the history of a great seafaring family and the tradition in which they served.\n\nBook 2 - The First to Land\n\n899, China. The Mandarins are becoming troublesome again and there are rumors that attacks will soon begin on British trade missions and legations. Captain David Blackwoodof the Royal Marines, received a VC in the bloody battle for Benin, Africa but is now being packed off to this apparent backwater.\n\nBut there are plenty of troubles in store for Blackwood in the shape of an errant nephew and a beautiful German Countess who insists he personally escort her up river on a small steamer into the heart of the country.China is a sleeping tiger that will soon awake when the Boxer Rebellion erupts into bloody war in 1900. True to their motto, the Royal marines are the first to land - and the last to leave.\n\nBook 3 - The Horizon\n\nWorld War I, 1915, Jonathan Blackwood fights from the sea, supported by the Royal Navy in the battlefields of the Dardanelles and Gallipoli, watching the slaughter mounting around him, helpless to save either himself or his men. The days of the scarlet-coated marines of his forefathers are gone, giving way to a new warfare of grim trenches and ruthlessly efficient machine-guns.\n\nBook 4 - Dust On The Sea\n\nIt is 1943, and Captain Mike Blackwood, Royal Marine Commando, is a survivor. Young, toughened and tried in the hellish crucible of Burma, he labours, sometimes faltering, beneath the weight of tradition, the glorious heritage of his family, and the burden of his own self-doubt.\n\n\nFor Blackwood, the horizon is not the lip of the trench seen by men of the Corps in the previous war, but the ramp of a landing craft smashing down into the sea, and the fire of the enemy on a Sicilian beach. Here, tradition is not enough, and Mike Blackwood must find within himself qualities of leadership which will inspire those Royal Marines who are once again the first to land, and among the first to die.","torrent":{"xt":"urn:btih:0a4f8b4c35b515c1e4d99d70816b8bec91fa850d","amp;dn":"Douglas+Reeman","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0a4f8b4c35b515c1e4d99d70816b8bec91fa850d","infoHashBuffer":{"type":"Buffer","data":[10,79,139,76,53,181,21,193,228,217,157,112,129,107,139,236,145,250,133,13]},"announce":[],"urlList":[]}}