{"title":"Nausicaa In The Valley Of The Wind[Hyperdrive25]","uid":6529991,"size":653015065,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:0aad2e31ec63ed9800499c0fa95d932fd1aef05a&amp;dn=Nausicaa+In+The+Valley+Of+The+Wind%5BHyperdrive25%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Hyperdrive25","files":-1,"time":1310304299,"description":"                  Nausicaa of The Valley Of The Wind 1984\n                  =======================================\nA.V Info:\n---------\nRuntime= 01:58:20 (approx. 2hrs)\nResolution/Aspect ratio=704*384, 4:3 Fullscreen\nVideo bit rate=731kbps\nFrame rate=23fps\nAudio bit rate=64kbps\nAudio Sample rate=48khz \nAudio Channels=2(stereo)\nAudio Language=English\nSubtitles=English\n\nNausicaa of the Valley of the Wind is a 1984 Japanese post-apocalyptic anime film written and directed by Hayao Miyazaki, based on his manga of the same name. The film has environmentalist undertones and was presented by the World Wide Fund for Nature when it was released in 1984. While created before Studio Ghibli was founded, the film is considered to be the beginning of the studio, and is often included as part of the Studio's works, including the Studio Ghibli Collection DVDs. Among its numerous awards, it won the Animage Anime Grand Prix prize in 1984.\n\nPlot\n----\nOne thousand years after the &quot;Seven Days of Fire&quot;, an apocalyptic war which destroyed civilization and Earth's ecosystem, scattered settlements exist throughout the Toxic jungle (renamed Sea of Decay in subtitles and the manga translation), a forest swarming with giant insects. Everything in the Toxic Jungle is lethal to humans.\n\nNausicaÃƒÂ¤, a princess of the Valley of the Wind is a skillful fighter, but also humane and peace-loving. She communicates with the giant insects (particularly the Ohmu, gigantic, armored, caterpillar insects who are the most intelligent in the Jungle.) Lord Yupa, a wise wandering warrior, is dedicated to finding the legendary &quot;man in blue&quot; who has the power to reunite people and nature. NausicaÃƒÂ¤ is inspired by Lord Yupa and she explores the Toxic Jungle to help her understand it. She travels long distances by &quot;windriding&quot;: flying an advanced jet assisted glider.\n\nA struggle among several kingdoms ensues when an airship crashes near the Valley. NausicaÃƒÂ¤ tries to rescue a wounded girl, who reveals herself as Princess Lastelle of Pejite. The airship, from the kingdom of Tolmekia, carries an embryo of a Giant Warrior, one of the lethal creatures used in ancient war. The dying Lastelle tells NausicaÃƒÂ¤ to destroy the embryo.\n\nThe Pejite discovered the embryo, but the more powerful Tolmekia stole it and took Lastelle as a hostage. The Tolmekians' airship was attacked by insects, causing them to crash. Tolmekians, under the leadership of princess Kushana, invade the Valley to secure the Warrior embryo. Kushana explains that the Giant Warrior will burn the Toxic Jungle, even though legends warn against this.\n\nKushana attempts to return to Pejite, along with NausicaÃƒÂ¤ and several new hostages. Before leaving, NausicaÃƒÂ¤ reveals to Yupa a hidden garden of jungle plants, which are not toxic because the plants grow in sand and water obtained from a deep, untainted well. NausicaÃƒÂ¤ explains that the jungle is toxic due to the tainted by man soil that covers the land, even in the Valley. Since she has to depart, however, she shut off the water which keep the plants alive.\n\nSeveral Tolmekian airships are attacked and destroyed by a Pejite gunship. NausicaÃƒÂ¤, Mito and Kushana escape to a surviving gunship. They crash land in the jungle and NausicaÃƒÂ¤ communicates with several Ohmus discovering the pilot of the downed Pejite gunship is still alive. With the help of her glider, NausicaÃƒÂ¤ rescues the pilot, Asbel of Pejite, the twin brother of Princess Lastelle. However, NausicaÃƒÂ¤ and Asbel are swallowed by quicksand and end up in a strange, non-toxic world below the jungle. NausicaÃƒÂ¤ realizes the jungle plants purify the polluted topsoil, producing clean water, which remains hidden underground.\n\nNausicaÃƒÂ¤ and Asbel return to Pejite, which is devastated after insects are lured from the Sea of Decay to attack the occupying Tolmekians. The Pejite survivors, on a single airship, reveal that they will do the same thing in the Valley to recapture the Giant Warrior. The Pejite try to prevent NausicaÃƒÂ¤ from alerting the Tolmekians, but Asbel helps her escape. While flying home to the Valley, she encounters a herd of enraged Ohms following a baby Ohm being used by the Pejites to lure the herd to the Valley. NausicaÃƒÂ¤ releases the baby Ohm and gains its trust.\n\nMeanwhile, the Tolmekians try to stop the herd with armored vehicles, but fail. Kushana arrives with the Giant Warrior to stop the Ohm, but the Warrior is unsuccessful. The Warrior dies during the fight because it was awakened too early from its larval stage.\n\nNausicaÃƒÂ¤ and the baby Ohm arrive and are overrun as they attempt to calm the enraged Ohmu. The Ohmus then calm down and use their tentacles to revive NausicaÃƒÂ¤. Everyone sees that NausicaÃƒÂ¤'s dress is stained blue with blood of the baby Ohm, meaning NausicaÃƒÂ¤ must be the blue savior sought by Lord Yupa. The film ends with scenes of people and insects living together in peace.\n\n[Review By Your Friendly Neighbourhood Hyperdrive25]\n....................................................\nI was driven to see this sci-fi adventure film due to its high rating on IMDB.\nI wasn't disappointed. This film is exceptional. Miyazaki has a superb command of his material. He creates for us an atmosphere of unimaginable beauty. The main character of the film NausicaÃƒÂ¤ is very aware of her surroundings and manages to solve all of her problems using peaceful means wherever it is possible. She lives in harmony with her surroundings and attempts to understand the problems faced by her people. And ultimately it is she who manges to solve the riddle of the toxic jungle. I rate this film as being better than Final Fantasy: The Spirits Within\nand even James Cameron's Avatar.\n\n___________________________________________________________________________________\n\nPlaypack Guide For DVD/CD Player: This file can be played with any DIVX/MP4 compatible DVD/VCD Player. \nJust burn the files onto a CD using Nero or Ashampoo Buring Studio by making a DATA CD.\n\nPlayback guide for PC: To play this video make sure you have VLC media player \n                       (VideoLAN) or SMplayer installed on your PC.\n\n\nDownload VLC Media Player: http://www.videolan.org/\n\nDownload SMPlayer: http://smplayer.sf.net/\n\n\n\nAnother Quality Torrent Courtesy of Hyperdrive25. All My torrents are here:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/Hyperdrive25&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/Hyperdrive25&lt;/a&gt;\n\n\nRemember To Keep Seeding. A little seeding goes a long way...\n\n***************************ITS TIME TO GO HYPER!!!*********************************\n\nI love to share,\nI love to care,\nI like to sing,\nSo that I can bring,\nA ray of sunshine in your life.\n\n\nRemember: its YOUR WORLD. I just live in it. :) \n\n          *** A BIG THANK YOU FOR ALL YOU SEEDERS OUT THERE! *** \n                            \n                        KEEP UP THE GOOD WORK!\n\n                            I LOVE U ALL!\n","torrent":{"xt":"urn:btih:0aad2e31ec63ed9800499c0fa95d932fd1aef05a","amp;dn":"Nausicaa+In+The+Valley+Of+The+Wind%5BHyperdrive25%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0aad2e31ec63ed9800499c0fa95d932fd1aef05a","infoHashBuffer":{"type":"Buffer","data":[10,173,46,49,236,99,237,152,0,73,156,15,169,93,147,47,209,174,240,90]},"announce":[],"urlList":[]}}