{"title":"Kate Earl - Fate Is The Hunter","uid":4193478,"size":52581478,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:0abd933f4628f09139b495140747eaed11745b14&amp;dn=Kate+Earl+-+Fate+Is+The+Hunter&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"niceguy_jack","files":11,"time":1211091205,"description":"~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*\nKate Earl - Fate Is The Hunter (2005)\n\n1|Someone To Love\n2|When You&amp;#039;re Older\n3|Officer\n4|Silence\n5|Cry Sometimes\n6|Anything\n7|Free\n8|Come This Far\n9|Sweet Sixteen\n10|Hero\n~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*~*\n\nKate Earl, born Kate Joy Smithson, October 8, 1981 ?Katie? to Charles and Pomposa Smithson in Chugiak, Alaska is a Filipino American singer-songwriter, now based in Los Angeles. Her debut album, Fate Is The Hunter, was released on May 10, 2005. She has garnered moderate airplay with her single, ?Officer?.\n\nComparisons to her Alaskan musical predecessor, Jewel, are inevitable. However, Kate?s sound is arguably more grounded, mature, and substantial - both lyrically and musically. Her vocal abilities also stand out. As evidenced by such tracks as ?Someone To Love? and ?Hero?, they are sweet and soothing one minute, yet fiery and powerful the next.\n\nKaties parents Chuck and Pompi owned and operated the Circle S gas station on North Birchwood Loop Road, where she also worked. Thus, she became known as ?the girl from the gas station.? During this time, Kate discovered music as a means of escaping her dreary, cold surroundings. Began playing piano when she was 4, sang in choir and at 14 became the first female worship leader at her hometown church Peters Creek Christian Center where she also received her entire education k-12, picked up guitar at 17 and left home for a missionary training program in michigan. Kate considered every major city but settled on Los Angeles because the of the pleasant climate. Earl moved to Los Angeles in 2004 to pursue her dream of being a musician. Within six months, she was signed by The Record Collection. Much of Fate is the Hunter is inspired by Earl?s late father, who died the day before her sixteenth birthday after a drawn out battle with cancer.\n\nCheck out hershe was an incredible new song called Melody coming out on her new album coming Summer 2008. \n\n","torrent":{"xt":"urn:btih:0abd933f4628f09139b495140747eaed11745b14","amp;dn":"Kate+Earl+-+Fate+Is+The+Hunter","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0abd933f4628f09139b495140747eaed11745b14","infoHashBuffer":{"type":"Buffer","data":[10,189,147,63,70,40,240,145,57,180,149,20,7,71,234,237,17,116,91,20]},"announce":[],"urlList":[]}}