{"title":"Marta Hugon - 2006 - Tender Trap FLAC","uid":10044866,"size":260068615,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:0b422a2db9f39c8240488e40674e3d88177dd7cc&amp;dn=Marta+Hugon+-+2006+-+Tender+Trap+FLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"eika256","files":-1,"time":1398518427,"description":"Marta Hugon - 2006 - Tender Trap\n\nMarta Hugon's affection for the material she covers on Tender Trap is apparent from the start. Hugon is a confident singer with a pleasant tone, exhibiting only the occasional intonation issue and some difficulty sustaining notes in her upper register. While she doesn't scat or improvise on this recording, Hugon's sensibility is deeply rooted in the jazz tradition, and she can swing with the best of them when it's called for. The final bars of &quot;Old Devil Moon, however, give us a glimpse of Hugon's potential as an improviser as she noodles over pianist Felipe Melo's swinging outro.\nMelo, a standout on this recording, is solid throughout, providing support and great interplay with Hugon. The trio of inspired soloists who back Hugon manage to pull back and not detract from the vocalist when it's her time to shine. And shine she does, especially on &quot;Falsa Baina, singing in her native Portuguese. She deftly handles the tune's quick rhythms and exhibits an infectious exuberance. Hugon should consider recording an album of Jobim classics and Brazilian bossas. All indications are that it would be spectacular.\nGuest guitarists Bruno Santos (on &quot;I Feel So Smoochie ) and Andre Fernandes (on &quot;I Wish I Knew ) both fit in seamlessly with the trio. Fernandes' solo in particular is very engaging and brings to mind the work of Barney Kessel. I get the feeling from listening to this disc that these musicians have been heavily influenced by the greats of Kessel's generation. Shades of Oscar Peterson, Ray Brown and Ed Thigpen are all heard, which is welcome indeed.\nThe arrangements are all infused with a sense of respect for the material, while managing to not wallow in nostalgia. The title track in particular doesn't owe too much to any of its more familiar recorded versions, opening with elegant brushwork from drummer Andre Sousa Machado and a melodic bass line from Bernardo Moreira.\nHugon and company have carved a nice little niche for themselves with this warm, relaxed session. (AllAboutJazz)\n\nTrak list:\n01 - In Love In Vain\n02 - Old Devil Moon\n03 - I Concentrate On You\n04 - I Fell So Smoochie\n05 - I Wish I Knew\n06 - Tender Trap\n07 - That Old Black Magic\n08 - Too Close For Confort\n09 - Too Young To Go Steady\n10 - Falsa Baiana\n11 - Manhattan\n\nPersonnel:\nMarta Hugon: vocals; \nFilipe Melo: piano; \nBernardo Moreira: bass; \nAndre Sousa Machado: drums; \nBruno Santos: guitar (4); \nAndre Fernandes: guitar (5).\n\nEnjoy and share!","torrent":{"xt":"urn:btih:0b422a2db9f39c8240488e40674e3d88177dd7cc","amp;dn":"Marta+Hugon+-+2006+-+Tender+Trap+FLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0b422a2db9f39c8240488e40674e3d88177dd7cc","infoHashBuffer":{"type":"Buffer","data":[11,66,42,45,185,243,156,130,64,72,142,64,103,78,61,136,23,125,215,204]},"announce":[],"urlList":[]}}