{"title":"Sacred Line 1.2b Overhaul 64Bit Setup","uid":8217538,"size":209989586,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:0b56a1dd90b3e9abfcdd3e14887273167741e00a&amp;dn=Sacred+Line+1.2b+Overhaul+64Bit+Setup&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"sashadarko","files":1,"time":1362377218,"description":"Sacred Line is a free first person dark adventure/surreal thriller with story-driven explorative physics-based gameplay, black-white-red silent movie/BD style and multistructural abstract non-cliche plot. It takes its place in a fully developed universe where your main enemy is a union of third-world countries which is trying to set totalitarian regime over the whole planet polluting and destroying everything around them. In this game you will face their leader which was summoned by the ancient sect, dealing with unknown sources of power and paranormal activity.\n\nYou are playing Ellen, a private detective, who is trying to survive in Eastern Europe. Lately detective business, which she inherited from her missing sister Sarah, almost ceased its existence and one day before she was going to close her office she got an anonymous call. The unknown asked her to find some hidden forest outpost and told her about its position. That was just the beginning. \n\n\n\nCurrent version is 1.2b Reborn (released 27.02.13), includes new content, secret ending and update of graphics/physics plus bug/grammar fixes.\n\n\n\nAlmost every object in game is physically interactive. You can drag a lot things using Left Mouse Button, glasses and walls are breakable.\nThe game supports only 16:9 monitors and minimal resolution 1280x720.\nThis game is recommended to experienced and thinking players who know english well and can understand complex plots with abstract components.","torrent":{"xt":"urn:btih:0b56a1dd90b3e9abfcdd3e14887273167741e00a","amp;dn":"Sacred+Line+1.2b+Overhaul+64Bit+Setup","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0b56a1dd90b3e9abfcdd3e14887273167741e00a","infoHashBuffer":{"type":"Buffer","data":[11,86,161,221,144,179,233,171,252,221,62,20,136,114,115,22,119,65,224,10]},"announce":[],"urlList":[]}}