{"title":"Flyover Nation_ You Can't Run a Country You've Never Been To","uid":15498435,"size":178170119,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:0c3d8071f79a140f8a029a7e4e7a08b25c5da0c3&amp;dn=Flyover+Nation_+You+Can%27t+Run+a+Country+You%27ve+Never+Been+To&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"usparc56","files":3,"time":1470462793,"description":"Flyover Nation: You Can't Run a Country You've Never Been To\r\nWritten by: Dana Loesch\r\nNarrated by: Teri Schnaubelt\r\nLength: 7 hrs and 13 mins \r\nUnabridged Audiobook\r\nRelease Date:06-21-16\r\nPublisher: Brilliance Audio\r\n\r\n5.00 (10 ratings)\r\n\r\nDana Loesch explains that the biggest political problem today is that the people who run this country have no idea what life is really like for ordinary Americans. In fact, they have contempt for the very people they claim to represent.\r\nWhen the owners of a small pizza parlor in Indiana were asked by the local press whether they would ever cater a gay wedding, they said no, citing their personal religious beliefs. The internet responded with immediate outrage, posting death threats and vicious online reviews, and forcing them to shut down. All for expressing a personal opinion rooted in faith, in response to a completely hypothetical question. A new front in the culture war had been opened.\r\n\r\nWhen the owners of the pizza parlor told Dana Loesch on a Blaze TV interview that they might never reopen, Loesch started a fundraising campaign. Hundreds of thousands of dollars quickly poured in to support them. The people donating weren't taking a stand against gay rights; they just believed that a random mom-and-pop shop shouldn't be run out of business because media and political elites on both coasts caricature and vilify rural Americans.\r\n\r\nMost of the problems with our country today can be traced to a very simple cause - the growing disconnect between the government and media elites and the rest of us, the old-fashioned, hard-working, God-fearing Americans who are proud to live in middle America. As Loesch explains, too many people getting on their high horse about Wal-Mart have never shopped in one. Protesters outraged at small town cops have never been helped by one. Environmentalists who claim to want to protect the spotted owl have never been in the woods with one. Atheists who attack committed Christians have never sat in a pew with one.\r\n\r\nLoesch doesn't take aims solely at the Democrats; some Republicans in Congress and on the presidential campaign trail have also forgotten what life is like for the people back home. While these so-called leaders may have forgotten the people in coal towns and farming communities, the voters in those communities haven't forgotten Washington's betrayals. And it will show in 2016.\r\nAs one of the most powerful and recognizable voices on talk radio today, Dana Loesch is leading a revolution of America's new Silent Majority","torrent":{"xt":"urn:btih:0c3d8071f79a140f8a029a7e4e7a08b25c5da0c3","amp;dn":"Flyover+Nation_+You+Can%27t+Run+a+Country+You%27ve+Never+Been+To","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0c3d8071f79a140f8a029a7e4e7a08b25c5da0c3","infoHashBuffer":{"type":"Buffer","data":[12,61,128,113,247,154,20,15,138,2,154,126,78,122,8,178,92,93,160,195]},"announce":[],"urlList":[]}}