{"title":"The Real Texas GOG","uid":7901637,"size":237029691,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:0c575676a3db3bf51449f74b7afefea81144dee1&amp;dn=The+Real+Texas+GOG&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"AN0NYMOUS142857","files":-1,"time":1354978980,"description":"genre: action / adventure / modern\nrelease date: June 14, 2012\ncompatible with: Windows (XP, Vista, 7, 8)\nlanguages: English\ndeveloper / publisher: Kitty Lambda Games / Kitty Lambda Games\ngame modes: single-player\n\nBonus content included for FREE with purchase:\nsoundtrack\ndesigner's notebook\n26 papercraft figures\n\nWhat's cool about it:\n\nExplore Strange, Texas: a Kafka-esque parody stuck halfway between modern-day America and olden-days, RPG England.\nZelda-style puzzles and action elements mixed with an Ultima-style RPG conversation trees and inventory system.\nLots of subquests, secrets to find, dungeons to delve, and townspeople to help.\n\nOverview:\n\nSam, an ordinary Texas rancher, is on holiday in England when he falls into a blue portal and lands in Strange, Texas.\n\nHe soon discovers that this town has more than enough problems of it's own. The residents of Strange all seem to be pulled in and trapped from other times and places, just like Sam-- yet things here are oddly familiar.\n\nThe Real Texas is a unique blend of action-RPG with strategic real-time combat and many-layered puzzles. Quests and story situations all play into the central mysteries of Strange, a town with a vast, interconnected dungeon underneath. The keyword system is a definite and enjoyable throwback to many great PC RPGs, and means some NPCs have clues to give only if you type them in (most dialogue options are clickable, though.) Uncover the mysteries of &quot;real world&quot; Castle Rockingham, where Sam's vacation was originally supposed to take place, but is now an abandoned castle filled only with ghosts. Uncover secret items and equipment, read books, unlock treasure chests, solve riddles, gather clues, and avoid the estate tax (if you can.)\n\nAdd to all of this a challenging quickdraw gun-combat system with six types of classic cowboy and fantasy weapons, a full clothing and equipment system (underwear optional) with various effects, and The Real Texas has a lot to offer any fan of old-school RPGs or action-adventure games.\n\nMinimum system requirements: Windows XP / Windows Vista / Windows 7, 1.8 GHz Processor(Intel Core 2 Duo or better), 1 GB RAM, DirectX 9.0c-compatible video card with OpenGL 1.2 , 200 MB HDD, Mouse, Keyboard.\n\nInstallation\n\nInstall and play","torrent":{"xt":"urn:btih:0c575676a3db3bf51449f74b7afefea81144dee1","amp;dn":"The+Real+Texas+GOG","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0c575676a3db3bf51449f74b7afefea81144dee1","infoHashBuffer":{"type":"Buffer","data":[12,87,86,118,163,219,59,245,20,73,247,75,122,254,254,168,17,68,222,225]},"announce":[],"urlList":[]}}