{"title":"Tim Cummiskey Trio - Redeeming Time - Jazz Guitar - Jazz Organ","uid":11855298,"size":146799880,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:0e12c2bca537130a232b592a78bc296b30593f37&amp;dn=Tim+Cummiskey+Trio+-+Redeeming+Time+-+Jazz+Guitar+-+Jazz+Organ&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"L_Hammond","files":12,"time":1430149338,"description":"Tim Cummiskey Trio - Redeeming Time - Jazz Guitar - Jazz Organ\n\nThe Tim Cummiskey Trio assembled for this great jazz guitar/jazz organ trio project puts Tim in fine company, with Columbus legend Hank Marr on organ and drummer Jim Rupp, an alumnus of the Woody Herman, Maynard Ferguson, and Glenn Miller Orchesstras.\n\n\nTracklisting:\n01. Unit 7 (7:12)\n02. Darn That Dream (7:22)\n03. Black Nile (5:03)\n04. Hank's Riff (6:09)\n05. How Insensitive (4:53)\n06. Inner Urge (5:52)\n07. Invitation (6:18)\n08. Time Remembered (5:05)\n09. This I Dig Of You (5:34)\n10. Fever Dream (6:42)\n\nTotal Time: 60:14\n\n\nPersonnel:\n- Tim Cummiskey, guitar\n- Hank Marr, organ\n- Jim Rupp, drums\n\n\nLabel: CoJazz\nReleased: September 24, 2003\n\nFormat: MP3 320 kbit/s. All songs are tagged by the book.\n\n--------\n\nReview by Dr. Ted McDaniel, Columbus, Ohio\nJust in case Tim Cummiskey is mistakenly described as an &quot;up and coming&quot; jazz guitarist, let the level of playing revealed on this album serve as living testimony that this artist has already &quot;arrived&quot; The Tim Cummiskey Trio assembled for this project puts Tim in fine company, with Columbus legend Hank Marr on organ and drummer Jim Rupp, an alumnus of the Woody Herman, Maynard Ferguson, and Glenn Miller Orchesstras. While Tim Cummiskey has appeared on numerous recordings as a sideman, Redeeming The Time is his second recording as the leader.\n\nUpon listening to Tim Cummiskey's Redeeming The Time, one hears the work of a fertile mind that offers boundless creative expression. And I don't just mean heady, cerebral playing, but playing that comes from the heart, as well, with lots of musical sensitivity and imagination. Cummiskey's choice of tunes for this album reveals his respect and love for the compositions of music masters like Wayne Shorter, Joe Henderson, Bill Evans, Antonio Carlos Jobim, Sam Jones, Hank Mobley, and Lee Morgan, along with Jimmy Van Huesen and Bronslau Kaper. Additionally he includes one of his own compositions and another cowritten with Hank Marr. Tim Cummiskey proves my adage that jazz music is really about rhythm.\n\nIf you enjoy swing, you will marvel at the groove set down in Unit 7 or Invitation, two of my favorites. Cummiskey wastes no time in showing you that he has chops galore. While modern stylists since Charlie Parker typically have utilized the double-time figure in their improvisations, Cummiskey's use of double-time figures occurs at any point of the bar. At times they go over the bar, and often are grouped in four, but often appear in triplet, too. The beauty of Cummiskey's rhythms is that they come at you at a virtuosic machine-gun pace that makes you say wow! Sometimes the juxtapositioning of his rapid-fire rhythms create surprise and tension, but they get properly resolved, and besides, he can do all of this and still swing. Listen to the vamp ending of Black Nile, and see for yourself.\n\nIf you like the blues, then check out Hank's Riff. Here Cummiskey understands the blues as primary language and reveals his affection for earthy, soulful playing. Of course, with Hank Marr on organ, there is plenty of groove and grease in this kitchen. When Leroi Jones (Amira Baraka) published his seminal work, Blues People, in 1963, he surely must have had Hank Marr in mind, and both Cummiskey and Rupp add their special ingredients to the mix.\n\nOther important aspects of this recording are the rich harmonic vocabulary and beautiful melodic renditions evidenced by Cummiskey in the more relaxed tunes of this session. All guitarists and pianists love Jobim for his beautiful and exquisite harmonies and melodies. Cummiskey's choice of How Insensitive discloses some of his most sensitive playing. The gentle side of Cummiskey comes through in Jobim's pretty, Latin-flavored tune that provides a wonderful template for yet another beautiful and creative ride from Cummiskey.\n\nThe ballad Darn That Dream, Bill Evan's Time Remembered, along with Cummiskey's own Fever Dream provide us with more tenderness and introspection. Improvisation is the hallmark and defining essence of creativity in the jazz tradition. Whether listening to Inner Urge or This I Dig Of You, or any of the ten tunes featured on Redeeming The Time, one will be impressed with the improvising prowess of Tim Cummiskey. Sit back, relax and enjoy, and redeem your time listening to the artistry of Tim Cummiskey, jazz guitarist. \n\n--------\n\nL Hammond, The Pirate Bay, where you'll find more jazz organ","torrent":{"xt":"urn:btih:0e12c2bca537130a232b592a78bc296b30593f37","amp;dn":"Tim+Cummiskey+Trio+-+Redeeming+Time+-+Jazz+Guitar+-+Jazz+Organ","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0e12c2bca537130a232b592a78bc296b30593f37","infoHashBuffer":{"type":"Buffer","data":[14,18,194,188,165,55,19,10,35,43,89,42,120,188,41,107,48,89,63,55]},"announce":[],"urlList":[]}}