{"title":"Nanoparticle Emissions from Combustion Engines","uid":12650178,"size":11000783,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0e7dcc2b36de9fd9c79758b06060bfdd267cd90d&amp;dn=Nanoparticle+Emissions+from+Combustion+Engines&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1446117056,"description":"Nanoparticle Emissions from Combustion Engines - Jerzy Merkisz, Jacek Pielecha (Springer, 2015).pdf\r\n\r\nISBN 9783319159270\r\n\r\nThis book focuses on particulate matter emissions produced by vehicles with combustion engines. It describes the physicochemical properties of the particulate matter, the mechanisms of its formation and its environmental impacts (including those on human beings). It discusses methods for measuring particulate mass and number, including the state-of-the-art in Portable Emission Measurement System (PEMS) equipment for measuring the exhaust emissions of both light and heavy-duty vehicles and buses under actual operating conditions. The book presents the authors’ latest investigations into the relations between particulate emission (mass and number) and engine operating parameters, as well as their new findings obtained through road tests performed on various types of vehicles, including those using diesel particulate filter regeneration. The book, which addresses the needs of academics and professionals alike, also discusses relevant European regulations on particulate emissions and highlights selected methods aimed at the reduction of particulate emissions from automobiles","torrent":{"xt":"urn:btih:0e7dcc2b36de9fd9c79758b06060bfdd267cd90d","amp;dn":"Nanoparticle+Emissions+from+Combustion+Engines","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0e7dcc2b36de9fd9c79758b06060bfdd267cd90d","infoHashBuffer":{"type":"Buffer","data":[14,125,204,43,54,222,159,217,199,151,88,176,96,96,191,221,38,124,217,13]},"announce":[],"urlList":[]}}