{"title":"CaÃƒÂ§adores de Vampiras LÃƒÂ©sbicas - Lesbian Vampire Killers","uid":5340864,"size":734025082,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:1081abe4ac934c350ebd7c0c0af7e87eabd42fe6&amp;dn=Ca%C3%83%C2%A7adores+de+Vampiras+L%C3%83%C2%A9sbicas+-+Lesbian+Vampire+Killers&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"OscarAlhoII","files":-1,"time":1265480256,"description":"SE AS LEGENDAS NÃƒÆ’O APARECEREM, INSTALA ISTO:  &lt;a href=&quot;\nhttp://www.codecguide.com/download_k-lite_codec_pack_basic.htm&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.codecguide.com/download_k-lite_codec_pack_basic.htm&lt;/a&gt;\n\n\nCenturies ago, Baron Wolfgang MacLaren vanquished the Vampire Queen Carmilla in the remote Cragwich; however, before decapitating the evil vampire, she curses the locals and descendants of the baron, swearing that every woman would turn into a lesbian vampire on the eighteenth birthday. On the present days, the clumsy and naive cuckold Jimmy is dumped again by his girlfriend Judy and misses her. His best friend Fletch is fired in his job of clown after hitting an annoying boy. The two friends are broken and decide to camp in the countryside to forget their problems, and Jimmy throws a dart in a map in a pub to decide where they should go. They head to Cragwich and when they arrive in the bar Baron's Rest, they see four hot girls leaving the place in a Kombi. The innkeeper offers the old Mircalla cottage in the woods for them, the same place the girls will lodge. Meanwhile, Lotte, Heide, Anke and Trudi have trouble with their van and Jimmy and Fletch reach them in the forest and they offer a ride to the guys to the cottage. They introduce themselves as students of folklore and they are researching the Vampire Queen Carmilla. When Fletch believes that he will have a night of beer and sex with three sexy girls and Jimmy and Lotte have a crush on each other, the cottage is surrounded by a group of lesbian vampires that vampires intend to use Jimmy and Lotte's blood to bring Carmilla back to life. They are abducted by the vampires, but Fletch escapes and meets Reverend Vicar that tells him that Jimmy is a descendant of the baron and only hope to stop the evil curse of Cragwich.\n\n\nDois inÃƒÂºteis desgraÃƒÂ§ados, um deles de coraÃƒÂ§ÃƒÂ£o despedaÃƒÂ§ado pela traiÃƒÂ§ÃƒÂ£o e abandono da namorada, o outro recentemente despedido, decidem ir passar um fim-de-semana ao campo. Por mero acaso ou azar vÃƒÂ£o para a uma aldeola no interior de Inglaterra que vive hÃƒÂ¡ sÃƒÂ©culos uma terrÃƒÂ­vel maldiÃƒÂ§ÃƒÂ£o em que todas as mulheres no dia do seu 18Ã‚Âº aniversÃƒÂ¡rio se tornam vampiras e lÃƒÂ©sbicas. Cabe agora a estes dois inÃƒÂºteis acabar com a maldiÃƒÂ§ÃƒÂ£o e caÃƒÂ§ar um grupo de, no mÃƒÂ­nimo atraentes, Vampiras LÃƒÂ©sbicas liderado por Camila, predadora de jovens indefesas, com a ajuda do louco vigÃƒÂ¡rio local e do seu arsenal de armas, no mÃƒÂ­nimo bizarro.\n\n\n\n CaÃƒÂ§adores de Vampiras LÃƒÂ©sbicas.avi\n699 MB\n\n1:22:51\n640x272\n1181kbps\n25 fps\nAudio-128kbps\n\n\n CaÃƒÂ§adores de Vampiras LÃƒÂ©sbicas.srt\n71.3 KB","torrent":{"xt":"urn:btih:1081abe4ac934c350ebd7c0c0af7e87eabd42fe6","amp;dn":"Ca%C3%83%C2%A7adores+de+Vampiras+L%C3%83%C2%A9sbicas+-+Lesbian+Vampire+Killers","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1081abe4ac934c350ebd7c0c0af7e87eabd42fe6","infoHashBuffer":{"type":"Buffer","data":[16,129,171,228,172,147,76,53,14,189,124,12,10,247,232,126,171,212,47,230]},"announce":[],"urlList":[]}}