{"title":"[NDS] High School Musical Rom TriplePack-USA","uid":4973767,"size":108279463,"categoryP":"games","categoryS":"handheld","magnet":"?xt=urn:btih:10cfebe0b090702f01937a867d8bd786bccf8476&amp;dn=%5BNDS%5D+High+School+Musical+Rom+TriplePack-USA&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dsromking","files":-1,"time":1245893434,"description":"High School Musical - Makin The Cut\n\nThe Disney High School Musical stars are taking their show on the road for the competition of a lifetime! East High School`s last winter musical was a smashing success and now this talented team is taking their performance on the road. In this addictive, rhythm-based game, help the cast of High School Musical dance and perform their way across the country as they work together to claim the Best Youth Musical in America championship title!\n\n    * Use the DS Touch Screen to dance and tap you way through all your favourite High School Musical songs in addictive rhythm-based games.\n    * Play as Troy, Gabriella, Sharpay, Ryan, Chad and Taylor or create your own unique character.\n    * Earn new outfits each &quot;step&quot; of the way, and customise your character to fit your personal style.\n    * Challenge your friends and see who can get the highest score in head-to-head, wireless competitions.\n    * Express your creativity! Mix and mash your video.\n\nHigh School Musical 2 - Work This Out\n\nSchools out, scream and shout! Join Troy, Gabriella, Ryan, Sharpay, Chad and Taylor in the all-new interactive High School Musical experience, High School Musical: Work This Out! Inspired by the record-breaking Disney Channel movie High School Musical 2, this musical adventure game for Nintendo DS allows players to become part of brand new storylines extending beyond the movie sequel all set at the Lava Springs Resort. Play as any of the six High School Musical stars as they work, dance and play their way to winning the Star Dazzle talent show. Explore the lavish Lava Springs country club, carry out daily assignments, find and collect hidden items and rehearse dance routines. High School Musical: Work This Out!, published by Disney Interactive Studios, mixes adventure and rhythm gameplay to bring fans closer to the movies than ever before!\n\n    * Play as Troy, Gabriella, Ryan, Sharpay, Chad and Taylor and interact with other characters like Kelsi and Zeke\n    * Explore the Lava Springs Resort as seen in High School Musical 2\n    * Features all 10 songs from High School Musical 2 and listen to the songs even when the Nintendo DS is closed\n    * Compete to win the Star Dazzle Award\n    * Play with friends wirelessly using one game cartridge\n\n\n\nHigh School Musical 3 - Senior Year \n\nExperience the music, scenes and characters from the &quot;High School Musical 3: Senior Year&quot; film. This is a unique rhythm-based dance game that lets you take on the role of the main characters and play along to the rhythm of songs from the theatrical release. The game features trivia-based personality quizzes that let you determine the Wildcat whose personality is most like yours. This feature lets fans dance through the game as that specific character, performing songs and experiencing the fun themed to Troy, Gabriella, Sharpay, Ryan, Chad or Taylor's personalities. In addition, High School Musical 3: Senior Year utilizes the DS stylus and D-pad to capture special photos to create a custom East High senior yearbook layout, to keep for years to come.\n\n    * Challenge friends by taking multiplayer BFF quizzes\n    * Answer trivia-based quizzes to determine player personalities based on HSM characters\n    * Capture special moments from the senior year to create yearbook layout\n    * Listen to songs from High School Musical 3 - Senior Year in the innovative jukebox mode using headphones even when the DS is closed\n    * Includes DGamer - the online community exclusively for Disney gamers. Customize unique 3-D avatar, create a persistent profile, chat with friends in a High School Musical chat room, share High School Musical themed accessories, earn in-game honors and unlock exclusive Disney content.\n\n\n","torrent":{"xt":"urn:btih:10cfebe0b090702f01937a867d8bd786bccf8476","amp;dn":"%5BNDS%5D+High+School+Musical+Rom+TriplePack-USA","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"10cfebe0b090702f01937a867d8bd786bccf8476","infoHashBuffer":{"type":"Buffer","data":[16,207,235,224,176,144,112,47,1,147,122,134,125,139,215,134,188,207,132,118]},"announce":[],"urlList":[]}}