{"title":"Star Wars: Crosscurrent (by Paul S. Kemp)","uid":9179332,"size":322268,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:114d46a6f77c1432c9b5f9e4789f29e61a46a751&amp;dn=Star+Wars%3A+Crosscurrent+%28by+Paul+S.+Kemp%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"timberley","files":-1,"time":1384207552,"description":"Crosscurrent is a novel by Paul S. Kemp that was released on January 26, 2010. It takes place during the Great Hyperspace War as well as after the Legacy of the Force series and features Jaden Korr as a lead character. It also ties in to Lost Tribe of the Sith: Precipice. \n\nThe book features Jaden Korr as one of the main characters. He is a Jedi Knight best known as a main character of a 2003 videogame Star Wars: Jedi Knight: Jedi Academy.\n\n==Publisher's summary==\nAn ancient Sith ship hurtles into the future carrying a lethal cargo that could forever destroy Luke Skywalker's hopes for peace.\n\nThe Civil War is almost over when Jedi Knight Jaden Korr experiences a Force vision so intense he must act. Enlisting two salvage jocks and their ship, Jaden sets out into space. Someone -- or something -- appears to be in distress.\n\nBut what Jaden and his crew find confounds them. A five-thousand-year-old dreadnaught -- bringing with it a full force of Sith and one lone Jedi -- has inadvertently catapulted eons from the past into the present. The ship's weapons may not be cutting-edge, but its cargo, a special ore that makes those who use the dark side nearly invincible, is unsurpassed. The ancient Jedi on board is determined to destroy the Sith. But for Jaden, even more is at stake: for his vision has led him to uncover a potentially indestructible threat to everything the Jedi Order stands for. ","torrent":{"xt":"urn:btih:114d46a6f77c1432c9b5f9e4789f29e61a46a751","amp;dn":"Star+Wars%3A+Crosscurrent+%28by+Paul+S.+Kemp%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"114d46a6f77c1432c9b5f9e4789f29e61a46a751","infoHashBuffer":{"type":"Buffer","data":[17,77,70,166,247,124,20,50,201,181,249,228,120,159,41,230,26,70,167,81]},"announce":[],"urlList":[]}}