{"title":"Jayne Mansfield documentary from A&amp;E Network","uid":7793607,"size":361839319,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:118995c9ea9c1b4639aeb7ababf67e81da256db4&amp;dn=Jayne+Mansfield+documentary+from+A%26amp%3BE+Network&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"loninappleton","files":2,"time":1352085144,"description":"Jayne Mansfield, Blond Ambition: \n\nA Documentary on the life of Jayne Mansfield\nfrom a Biography series on A&amp;E\nruntime 44 minutes\nAVI\n\n\nThis was packaged as a featurette with the dvd version of the film &quot;The Girl Can't Help It&quot; (1956); a rock and roll exploitation film.  Because The Girl Can't Help It is available already, I have upped this documentary separately.  If there is interest I can put the two up together.\n\nI'll give nothing away from this documentary but say that it was interesting in that we learn a great deal about the talent that Jayne Mansfield had which was glossed over for the opportunity to be a famous beauty.\n\nNostalgia for the world of cheesecake pinups is something that is currently popular.  The revival of Burlesque is one example.  And you can see that in another documentary called &quot;Immodesty Blaize, Burlesque Undressed&quot; which I among others have seeded.\n\nIt's also important to note the film &quot;The Notorious Bettie Page&quot; (available on torrents)  as well as the sexploitation films of Doris Wishman from the early 60's which have been unearthed and torrented in a few places.  These last two are sources that are directed by women.  The making of the Bettie Page film gives even more insight into how sex is viewed over time and from the women director's perspective.  The dvd of Bettie Page has an execellent &quot;making of&quot; featurette on that film from HBO.\n\n\nnotes written April 7th,  2012\n\nNew Torrent made 11/4/12 from a sizing problem on my earlier release of this.\n\n","torrent":{"xt":"urn:btih:118995c9ea9c1b4639aeb7ababf67e81da256db4","amp;dn":"Jayne+Mansfield+documentary+from+A%26amp%3BE+Network","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"118995c9ea9c1b4639aeb7ababf67e81da256db4","infoHashBuffer":{"type":"Buffer","data":[17,137,149,201,234,156,27,70,57,174,183,171,171,246,126,129,218,37,109,180]},"announce":[],"urlList":[]}}