{"title":"Kebnekaise_Elefanten","uid":4401858,"size":77565621,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:1261907e6746ebef2b046988c1abde3ddd3824c2&amp;dn=Kebnekaise_Elefanten&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"errkdumajadu","files":8,"time":1221699401,"description":"Kebnekaise - Elefanten\n\nKenny Hakansson, guitar\nMats Glenngard, violin\nTomas Netzler, bass\nHassan Bah, percussion\nAke Eriksson, drums\nPelle Ekman, drums\nPelle Holm, drums\n\n\n &quot;Camel with Bongos!&quot;\n\nThis was gonna be my review of Elefanten, Kebnekaise&amp;#039;s excellent fifth LP but as this was my first attempt at a ProgArchives.Com Review i thought I&amp;#039;d better make the effort and write a proper one. This group, and Lp, has a lot going for it and places Kebnekaise squarely within the Swedish tradition, prog with complex dynamics and a folk tinge, similar to their compatriots Kaipa and Ragnarok. While a folky overall feel dominates the playing is more spirited than than say Ragnarok&amp;#039;s first, mainly due to the strange instrumental line-up that Kebnekaise boast, which singles them out amongst the Swedish acts. Having instruments similar to Amon Duul II&amp;#039;s, i.e voilin and a lot of percussion, but their sound is very different than the Duul. What strikes one first about the Lp is the great drumming by, and the wealth of extra percussion give it a dynamism missing in other Swedish prog. I&amp;#039;ve read that the musicians were very interested in African drumming and poly-rythmic textures, and it does seem sometimes like Osibisa have momentarily invaded the proceedings, but crucially, the percussion never seems to overwhelm the mix, but is intuitively placed. The drumming style is full of impressive little fills and trills, calling to mind Arti E Mesteri&amp;#039;s drummer. What most impresses me about this LP though is the great guitar work by Kenny Hakansson, most known internationally for his work with Bo Hansson. Going back to my initial gambit one could say the style is very close to Camel, with Hakansson&amp;#039;s plnaget and melodic guitar stylings recalling Snow Goose-era Latimer, as well as Dave Gilmour. The violin gives it a Mahavishnu orchestra feel at the most dramatic moments, with some funky runs on bass, and some extended percussion workouts. Overall, a great addition especially if the Swedish sound pleases you. Kebnekaise bring a little dynamism and dare I say it &quot;funk&quot; to the inscribed Swedish folk- prog sound. Also like most Swedish acts they also had an eye firmly  on traditional indigenous folk musics as well, and one of the highlights is their arrangement of a traditonal tune that finsihes Side Two. Side one&amp;#039;s shorter tracks (there are just two on Side Two) show a great virtuosity. the best of Camel is really the nearest similarity I can think off, but Kebnekiase are so much more as well. I for one will be checking out other work by them. Originally Released on Silence label SRS 4642. \n","torrent":{"xt":"urn:btih:1261907e6746ebef2b046988c1abde3ddd3824c2","amp;dn":"Kebnekaise_Elefanten","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1261907e6746ebef2b046988c1abde3ddd3824c2","infoHashBuffer":{"type":"Buffer","data":[18,97,144,126,103,70,235,239,43,4,105,136,193,171,222,61,221,56,36,194]},"announce":[],"urlList":[]}}