{"title":"Lady From Louisiana (1941) Xvid 1cd [DDR]","uid":9178053,"size":734986240,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:12b759e3a10c68169e4ccf44d6a58b8040865db5&amp;dn=Lady+From+Louisiana+%281941%29+Xvid+1cd+%5BDDR%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":5,"uploader":"SaM","files":-1,"time":1384187229,"description":"Lady From Louisiana (1941) Xvid 1cd [DDR]\n\nLady from Louisiana is a 1941 American disaster film starring John Wayne. It was produced and directed by Bernard Vorhaus for Republic Pictures.\nRepublic Pictures spared no expense in making the film, with large numbers of costumed extras and recreations of Mardi Gras. The studio's high standard of action scenes and special effects miniatures come to the fore in the fight scenes and flood climax.\nThe film mixes the romance and action with a comedic touch, with Wayne performing a light, Walking Tall type scenario.\nA 1941 Time magazine review noted the similarities between Wayne's Thomas E. Dewey type character and Huey Long.\n\n    CAST:- \n    John Wayne as John Reynolds\n    Ona Munson as Julie Mirbeau\n    Ray Middleton as Blackburn &quot;Blackie&quot; Williams\n    Henry Stephenson as General Anatole Mirbeau\n    Helen Westley as Blanche Brunot\n    Jack Pennick as Cuffy Brown\n    Dorothy Dandridge as Felice\n    Shimen Ruskin as Gaston\n    Jacqueline Dalya as Pearl\n    Paul Scardon as Judge Wilson\n    Major James H. McNamara as Senator Cassidy\n    James C. Morton as Littlefield\n    Maurice Costello as Edwards\n    Mantan Moreland as Servant\n\nSYNOPSIS:- Lady from Louisiana (1941)\nYankee lawyer John Reynolds (Wayne) and Southern Belle Julie Mirbeau (Ona Munson) meet and fall in love on a riverboat going to New Orleans in the Gay Nineties. Upon arrival they are met by Julie's father (Henry Stephenson) who runs the popular Louisiana State Lottery Company and Reynold's Aunt Blanche (Helen Westley) who is a key figure in the anti-Lottery forces hoping Wayne as State's Attorney will end the Lottery.\n\nCorrectly gauging the situation as &quot;playing Romeo and Juliet&quot;, Wayne is invited to the Mirbeau mansion where Julie and her father explain that not only are the people of New Orleans fun loving and like gambling such as the Lottery, but the Lottery funds many charitable institutions such as hospitals and levees for the river.\n\nUnknown to General Mirbeau is his assistant Blackie's (Ray Middleton) protection rackets and murders of lottery winners through his army of thugs led by Cuffy Brown (Jack Pennick). The Lottery forces also have information sources in the State's Attorney's office that reveals every move Wayne has planned to raid illegal activities as well as corrupting judges and other officials through their brothels.\n\nThe battle between the two forces esclates leading into a climax of lightning striking and destroying a courthouse where a trial is going on and a break in the levees during torrential rains that flood the city.\n\nTECHNICAL SPECIFICATIONS:-\nVideo Codec: XviD ISO MPEG-4\nVideo Bitrate: 845 kbps\nVideo Resolution: 640x480\nVideo Aspect Ratio:1.333:1\nFrames Per Second: 29.970\nAudio Codec: 0x2000 (Dolby AC3) AC3\nAudio Bitrate: 192kb/s CBR 48000 Hz\nAudio Streams:  2\nAudio Languages: English\nSubtitles:NONE\nRipped by: Trinidad [DDR]  \nDuration: 1:22:59","torrent":{"xt":"urn:btih:12b759e3a10c68169e4ccf44d6a58b8040865db5","amp;dn":"Lady+From+Louisiana+%281941%29+Xvid+1cd+%5BDDR%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"12b759e3a10c68169e4ccf44d6a58b8040865db5","infoHashBuffer":{"type":"Buffer","data":[18,183,89,227,161,12,104,22,158,76,207,68,214,165,139,128,64,134,93,181]},"announce":[],"urlList":[]}}