{"title":"Museum of Curiosity Coding Special BBC Radio 4 AAC M4A [MPup]","uid":12482756,"size":32119692,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:12d6f4b68f4160b9f32ed54d3d5a739950f616a1&amp;dn=Museum+of+Curiosity+Coding+Special+BBC+Radio+4+AAC+M4A+%5BMPup%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"makinapufterpup","files":1,"time":1443075199,"description":"The.Museum.of.Curiosity.2015.09.10.Coding.Special.BBC.Radio.4.AAC.m4a.[MPup]\r\n\r\nAudioCodec: AAC audio file\r\nChannels: 2 channels / Stereo\r\nSamplingRate: 48.000 kHz\r\nBitRate: 128 kbps\r\n\r\nRuntime: 33 minutes\r\n\r\nThis week, the Museum's Steering Committee discusses computers made with dominoes, praises the mother of all computer programs and reveals that the first computer bug was actually a moth.\r\n\r\n[img]http://extraimago.com/images/2015/09/24/08fe9326f2a592fb9d67206844ecfd9b.png[/img]\r\n\r\nThe Professor of Ignorance John Lloyd and his newest new curator Sarah Millican welcome:\r\n\r\n- Matt Parker, who left Australia to teach maths in the UK before joining the Festival of the Spoken Nerd comedy group. He is a regular on Radio 4's The Infinite Monkey Cage, presents the Discovery Channel's You Have Been Warned and has shown off his Rubik's Cube skills on CBBC's How to Be Epic at Everything. His latest book Things to Make and Do in the Fourth Dimension explores such topics as the fairest way to cut a pizza and the most efficient way to tie your shoelaces. Matt's favourite numbers are 496, 3,435 and 2,025.\r\n\r\n- Eben Upton, who in 2006 conceived the idea of the Raspberry Pi, a credit-card sized fully-programmable computer that went on sale in 2011 and has since sold more than 5 million, becoming the fastest-selling British personal computer in history. MIT has since named him one of the world's top 35 innovators under the age of 35 and he has been awarded the Royal Academy of Engineering Silver Medal.\r\n\r\n- Sydney Padua, a Canadian graphic novelist and animator and who has worked on blockbuster movies such as The Illusionist, Clash of the Titans and John Carter as well as teaching at the Animation Workshop in Denmark and at the University of Middlesex. Most recently she has written and illustrated The Thrilling Adventures of Lovelace and Babbage, a New York Times bestselling graphic novel in which 19th century computer pioneers Ada Lovelace and Charles Babbage build a vast mechanical computer - and use it to fight crime for Queen Victoria.\r\n\r\nThe show was researched by Anne Miller and Stevyn Colgan of QI.\r\n\r\nThe producers were Richard Turner and James Harkin and was a BBC Radio Comedy Production","torrent":{"xt":"urn:btih:12d6f4b68f4160b9f32ed54d3d5a739950f616a1","amp;dn":"Museum+of+Curiosity+Coding+Special+BBC+Radio+4+AAC+M4A+%5BMPup%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"12d6f4b68f4160b9f32ed54d3d5a739950f616a1","infoHashBuffer":{"type":"Buffer","data":[18,214,244,182,143,65,96,185,243,46,213,77,61,90,115,153,80,246,22,161]},"announce":[],"urlList":[]}}