{"title":"Chasing Stars","uid":7854274,"size":384687750,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:131d6be3878d19fcab137bfce99a58d539eafb36&amp;dn=Chasing+Stars&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"cloak-and-dagger","files":-1,"time":1353698984,"description":"It is taken for granted in the knowledge economy that companies must employ the most talented performers to compete and succeed. Many firms try to buy stars by luring them away from competitors. But Boris Groysberg shows what an uncertain and disastrous practice this can be.\n\nAfter examining the careers of more than a thousand star analysts at Wall Street investment banks, and conducting more than two hundred frank interviews, Groysberg comes to a striking conclusion: star analysts who change firms suffer an immediate and lasting decline in performance. Their earlier excellence appears to have depended heavily on their former firms' general and proprietary resources, organizational cultures, networks, and colleagues. There are a few exceptions, such as stars who move with their teams and stars who switch to better firms. Female stars also perform better after changing jobs than their male counterparts do. But most stars who switch firms turn out to be meteors, quickly losing luster in their new settings.\n\nGroysberg also explores how some Wall Street research departments are successfully growing, retaining, and deploying their own stars. Finally, the book examines how its findings apply to many other occupations, from general managers to football players.\n\n&quot;Chasing Stars&quot; offers profound insights into the fundamental nature of outstanding performance. It also offers practical guidance to individuals on how to manage their careers strategically, and to companies on how to identify, develop, and keep talent.","torrent":{"xt":"urn:btih:131d6be3878d19fcab137bfce99a58d539eafb36","amp;dn":"Chasing+Stars","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"131d6be3878d19fcab137bfce99a58d539eafb36","infoHashBuffer":{"type":"Buffer","data":[19,29,107,227,135,141,25,252,171,19,123,252,233,154,88,213,57,234,251,54]},"announce":[],"urlList":[]}}