{"title":"Seeing Dark Things - The Philosophy of Shadows (Malestrom)","uid":4801471,"size":3455601,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:13dd160b4882b62f640fcc2d81e7fe6bea8667b6&amp;dn=Seeing+Dark+Things+-+The+Philosophy+of+Shadows+%28Malestrom%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"malestrom_HH","files":1,"time":1238055791,"description":" &lt;a href=&quot;http://www.image-upload.net/images/sanvibgiopmicvoyz3xo.jpeg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.image-upload.net/images/sanvibgiopmicvoyz3xo.jpeg&lt;/a&gt;\n\nSeeing Dark Things: The Philosophy of Shadows\nPublisher: Oxford University Press, USA | ISBN: 0195326571 | edition 2007 | PDF | 328 pages\n\nIf a spinning disk casts a round shadow does this shadow also spin? When you experience the total blackness of a cave, are you seeing in the dark? Or are you merely failing to see anything (just like your blind companion)? Seeing Dark Things uses visual riddles to explore our ability to see shadows, silhouettes, and black birds--plus some things that are only metaphorically &quot;dark&quot; such as holes. These dark things are anomalies for the causal theory of perception which states that anything we see must be a cause of what we see. This orthodoxy successfully explains why you see the front of this page rather than its rear. However, the causal theory has trouble explaining how you manage to see the black letters on this page. The letters are made visible by the light they fail to reflect rather than the light they reflect. Nevertheless, Roy Sorensen defends the causal theory of perception by treating absences as causes. His fourteen chapters draw heavily on common sense and psychology to vindicate the assumption that we directly perceive absences. Seeing Dark Things is philosophy for the eye. It contains fifty-nine figures designed to prompt visual judgment. Sorensen proceeds bottom-up from observation rather than top-down from theory. He regards detailed analysis of absences as premature; he hopes a future theory will refine the pictorial thinking stimulated by the book's riddles. Just as the biologist pursues genetics with fruit flies, the metaphysician can study absences by means of shadows. Shadows are metaphysical amphibians with one foot on the terra firma of common sense and the other in the murky waters of non-being. Sorensen portrays the causal theory of perception's confrontation with the shadows as a triumph against alien attack--a victory that deepens a theory that resonates so strongly with common sense and science. In sum, Seeing Dark Things is an unorthodox defense of an orthodox theory.","torrent":{"xt":"urn:btih:13dd160b4882b62f640fcc2d81e7fe6bea8667b6","amp;dn":"Seeing+Dark+Things+-+The+Philosophy+of+Shadows+%28Malestrom%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"13dd160b4882b62f640fcc2d81e7fe6bea8667b6","infoHashBuffer":{"type":"Buffer","data":[19,221,22,11,72,130,182,47,100,15,204,45,129,231,254,107,234,134,103,182]},"announce":[],"urlList":[]}}