{"title":"The Simpsons Season 18 Episodes 1-8 by deathmule","uid":3576516,"size":1840943104,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:156d86f922f648d40f06062e533bf4fc37d21fee&amp;dn=The+Simpsons+Season+18+Episodes+1-8+by+deathmule&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"deathmule","files":8,"time":1166054826,"description":"The Simpsons Season 18 Episodes 1-8 by deathmule\nsorry on subs, this is a NTSC DVD\n\n\n\n \\&quot;The Mook, The Chef, The Wife and Her Homer\\&quot;\n1801 F78888 SI-1715\nOriginal Airdate: 09/10/06\nThe Simpson family is introduced to Fat Tony\\&amp;#039;s son, Michael, while carpooling and Lisa quickly befriends the quiet boy after all of the other kids avoid him. As a sign of gratitude, Fat Tony has the Simpsons over for dinner and is shockingly gunned down by a rival family moments after Michael tells his father that he would rather be a chef than take over the family business. After Michael turns down the gang?s offer to be the new kingpin, Homer steps up and leads his family on a mob spree. Michael can?t bear to see what the Simpsons have become and invites the rival family over for a surrender dinner where he poisons the food and returns power to his family.\n \n\n \\&quot;Jazzy and the Pussycats\\&quot;\n1802 F78888 SI-1718\nOriginal Airdate: 09/17/06\nAfter an outburst at the funeral for Homer\\&amp;#039;s dead Vegas wife, Marge takes Bart to a shrink who prescribes playing the drums over Ritalin. Bart quickly upstages Lisa at a jazz jam and is recruited into a respected trio. A dejected Lisa turns her back on music and pours her heart into rescuing animals from the local pound. Lisa is able to keep her menagerie a secret until a pet tiger attacks her brother. Bart organizes a benefit concert to have his mangled drumming arm operation but has a last minute change of heart and donates the proceeds to an animal shelter in his sister\\&amp;#039;s name.\n \n\n \\&quot;Please Homer Don\\&amp;#039;t Hammer \\&amp;#039;Em\\&quot;\n1803 F80147 SI-1720\nOriginal Airdate: 09/24/06\nMarge discovers her gift for carpentry but has to use Homer as a front in order to overcome people?s predisposed prejudices against women builders. Even though he is completely inept, Homer takes credit for all of Marge?s work which causes her to abandon him just before he lands a job rebuilding a historic Springfield rollercoaster. When Homer?s life is in danger while taking the rebuilt coaster?s maiden voyage, Marge arrives and the couple works out their differences just before the Homer careens off the coaster. Meanwhile, Bart uses Skinner?s peanut allergy to force the Principal to do his bidding.\n\n\n\n\n &quot;Treehouse of Horror XVII&quot;\n1804 F81379 SI-1717\nOriginal Airdate: 11/05/06\nMARRIED TO THE BLOB - Homer ingests a blob from a mysterious asteroid and suffers from unstoppable hunger. After a feeding frenzy that includes hundreds of Springfield residents, Marge confronts Homer who admits the blob exited him early in his rampage. Rather than be destroyed, Homer is put in charge of eliminating the town&amp;#039;s homeless population.\n \nYOU GOTTA KNOW WHEN TO GOLEM - Bart steals a clay Golem for Krusty and enjoys having a personal slave until Lisa orders the monster to talk. The family quickly grows tired of the Golem&amp;#039;s neurotic personality and creates a clay female counterpart to keep it in line.\n\nTHE DAY THE EARTH LOOKED STUPID - The town creates a self fulfilling prophecy of disasters after believing the radio broadcast of WAR OF THE WORLDS to be real. When Kang and Kodos later arrive, the residents find themselves enslaved rather than being made twice the fools.\n\n\n\n\n&quot;G.I. (Annoyed Grunt)&quot;\n1805 F82446 SI-1721\nOriginal Airdate: 11/12/06\nAfter getting Bart out of a commitment he made to join the Army at 18, Homer falls prey to a couple of Army recruiters and ends up in basic training. Treating it like a summer camp, Homer infuriates his sergeant by not cracking under pressure from the hazing and humiliation. Marge and Grandpa end-up trapped in the Army as well due to some questionable tactics by the recruiters when they appeal to get Homer out of basic training. The group is put in a mock military operation as terrorists so the Army can show the power and excellence of the new computer system; however, Homer and the others continue to avoid capture and eventually leave the operation to get food in Springfield where they are mistaken for real \nterrorists. After leading the military on a humiliating chase through town, Homer is able to take down the US Army by threatening them with the power plant.\n\n\n &quot;Moe &amp;#039;N&amp;#039; A Lisa&quot;\n1806 F79331 SI-1719\nOriginal Airdate: 11/19/06\nWhile doing a school report on Moe, Lisa discovers his dark poetic talent and helps get him published in ?AMERICAN POETRY PERSPECTIVES?.  The poems earn him and the Simpson family an invitation to a literary conference in Vermont where rather than be considered a hack by his peers, Moe marginalizes Lisa?s contributions.  Moe is later unable to assemble a poem to recite and ends up saving face with Lisa by reciting a sentimental piece about their friendship that bombs his career. \n \n\n&quot;Ice Cream of Margie (With The Light Blue Hair&quot;\n1807 F82305 SI-1722\nOriginal Airdate: 11/26/06\nHomer is fired from the plant and quickly lands a successful career as an ice cream man.  Marge feels she is constantly being overshadowed by Homer&amp;#039;s many careers (astronaut, Krusty impersonator, etc...) and she starts creating popsicle stick sculptures to work through her depression.  The pieces quickly takeoff and Marge believes she&amp;#039;ll rise out of Homer&amp;#039;s shadow at an art opening until Homer (who is being chased by the ice cream Mafia) crashes his truck into the event and sets the pieces on fire.  Marge believes the accident was a deliberate attempt at making sure she is never as happy as her husband and she begins ignoring her family.  Marge later realizes her error and reconnects with her husband by making a giant statue of a near nude Homer in town square.\n\n\n1808 F82305 SI-1722\nOriginal Airdate n/a\ninfo n/a\n\n\n\n\n","torrent":{"xt":"urn:btih:156d86f922f648d40f06062e533bf4fc37d21fee","amp;dn":"The+Simpsons+Season+18+Episodes+1-8+by+deathmule","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"156d86f922f648d40f06062e533bf4fc37d21fee","infoHashBuffer":{"type":"Buffer","data":[21,109,134,249,34,246,72,212,15,6,6,46,83,59,244,252,55,210,31,238]},"announce":[],"urlList":[]}}