{"title":"Opera Italia  (BBC 2010 - Complete Series)","uid":5644482,"size":1620090475,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:162e6915ca46d471f5fb053bb4569d7d920cfc4d&amp;dn=Opera+Italia++%28BBC+2010+-+Complete+Series%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"dylanolya","files":-1,"time":1277243183,"description":"Three-part series tracing the history of Italian opera presented by Antonio Pappano, world-renowned conductor and music director  at the Royal Opera House, Covent Garden. The series features sumptuous music, stunning Italian locations and some of the biggest names in opera as contributors.\n\nIn the first programme, Pappano takes a whistle-stop tour of the beginnings of opera, from Monteverdi to Rossini. He also looks at the works of two non-Italian composers, Handel and Mozart, both of whom were pivotal in the development of the art form. Along the way he enlists the help of some of the world's greatest singers - Juan Diego Florez, Joyce DiDonato, Danielle de Niese, Sarah Connolly and Pietro Spagnoli.\n\nThe second episode focuses on Verdi, whose operas are central to Pappano's conducting repertoire and the backbone of the international opera scene. It shows how Verdi's music was influenced by composers such as Bellini and particularly Donizetti, whose gothic masterpiece Lucia di Lammermoor is explored with the help of soprano Diana Damrau.\n\nPappano looks at six of Verdi's most famous works - Nabucco, Rigoletto, Don Carlo, Otello, Falstaff and La Traviata, the last of which Pappano rehearses and conducts at the Royal Opera House with the starry cast of Renee Fleming, Joseph Calleja and Thomas Hampson.\n\nPappano travels to Le Roncole in northern Italy where Verdi was born amidst a turbulent political environment, and politics became a major influence on Verdi's operas in later life. He conducts Va Pensiero from Nabucco at a vast open-air concert in Naples, a chorus which was to become a powerful symbol of political unity for the Italian people.\n\nThe final episode is devoted to Puccini, the worthy successor to Verdi. Puccini's operas are cinematic in their scale with ravishing, passionate and clever music, as he took Italian opera into the 20th century.\n\nPappano looks at five of Puccini's most popular operas - La Boheme, Tosca, Madame Butterfly, Gianni Schicchi and Turandot. He travels to Rome to meet stage director Franco Zeffirelli and talk about Puccini and Zeffirelli's famous production of Turandot.\n\nPappano also talks to one of the great Puccini interpreters, the soprano Renata Scotto, about the composer, Madame Butterfly and the role of Mimi in La Boheme. Also featured are soprano Angela Gheorghiu, tenors Jonas Kaufmann and Roberto Alagna and baritone Sir Thomas Allen.\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:162e6915ca46d471f5fb053bb4569d7d920cfc4d","amp;dn":"Opera+Italia++%28BBC+2010+-+Complete+Series%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"162e6915ca46d471f5fb053bb4569d7d920cfc4d","infoHashBuffer":{"type":"Buffer","data":[22,46,105,21,202,70,212,113,245,251,5,59,180,86,157,125,146,12,252,77]},"announce":[],"urlList":[]}}