{"title":"One Fast Move or I'm Gone","uid":9434305,"size":1202364801,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:1652340eb6294809b2174e71c79110d51fe660bd&amp;dn=One+Fast+Move+or+I%27m+Gone&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"jimohagan","files":1,"time":1388868090,"description":"He was called the vibrant new voice of his generation -- the avatar of the Beat movement. In 1957, on the heels of the triumphant debut of his groundbreaking novel, On The Road, Jack Kerouac was a literary rock star, lionized by his fans and devotees. But along with sudden fame and media hype came his unraveling, and, by 1960, Kerouac was a jaded cynic, disaffected from the Beat culture he helped create and tortured by self-doubt, addiction and depression. Desperate for spiritual salvation and solitude, as well as a place to dry out, he secretly retreats to Lawrence Ferlinghetti's rustic cabin in the Big Sur woods. But his plan is foiled by his own inner demons, and what ensues that summer becomes the basis for Kerouac's gritty, yet lyrically told, semi-autobiographical novel, Big Sur. One Fast Move or I'm Gone: Kerouac's Big Sur, takes the viewer back to Ferlinghetti's cabin and to the Beat haunts of San Francisco and New York City for an unflinching, cinematic look at the compelling events the book is based on. The story unfolds in several synchronous ways: through the narrative arc of Kerouac's prose, told in voice-over by actor and Kerouac interpreter, John Ventimiglia (of HBO's The Sopranos); through first-hand accounts and recollections of Kerouac's contemporaries, whom many of the characters in the book are based on such as Lawrence Ferlinghetti, Carolyn Cassady, Joyce Johnson and Michael McClure; by the interpretations and reflections of writers, poets, actors and musicians who have been deeply influenced by Kerouac's unique gifts like Tom Waits, Sam Shepard, Robert Hunter, Patti Smith, Aram Saroyan, Donal Logue and S.E. Hinton; and by stunning, High Definition visual imagery set to original music composed and performed by recording artist, Jay Farrar of Son Volt, with additional performance by Benjamin Gibbard of Death Cab for Cutie.","torrent":{"xt":"urn:btih:1652340eb6294809b2174e71c79110d51fe660bd","amp;dn":"One+Fast+Move+or+I%27m+Gone","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1652340eb6294809b2174e71c79110d51fe660bd","infoHashBuffer":{"type":"Buffer","data":[22,82,52,14,182,41,72,9,178,23,78,113,199,145,16,213,31,230,96,189]},"announce":[],"urlList":[]}}