{"title":"Michio Kaku - Physics of the Impossible","uid":4449475,"size":679032127,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:17b3ad202eb1feeb2fb1dd53ef4d9f473549046f&amp;dn=Michio+Kaku+-+Physics+of+the+Impossible&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"jwhitt62","files":166,"time":1224194026,"description":"One hundred years ago, scientists would have said that lasers, televisions, and the atomic bomb were beyond the realm of physical possibility. In PHYSICS OF THE IMPOSSIBLE, the renowned physicist Michio Kaku explores to what extent the technologies and devises of science fiction that are deemed equally impossible today might well become commonplace in the future.\n\nFrom teleportation to telekinesis, Kaku uses the world of science fiction to explore the fundamentals and the limits of the laws of physics as we know them today. In a compelling and thought-provoking narrative, he explains: How the science of optics and electromagnetism may one day enable us to bend light around an object, like a stream flowing around a boulder, making the object invisible to observers &quot;downstream&quot;; How ramjet rockets, laser sails, antimatter engines, and nano-rockets may one day take us to the nearby stars; How telepathy and psycho-kinesis, once considered pseudoscience, may one day be possible using advances in MRI, computers, superconductivity, and nano-technology; Why a time machine is apparently consistent with the known laws of quantum physics, although it would take an unbelievably advanced civilization to actually build one.\n","torrent":{"xt":"urn:btih:17b3ad202eb1feeb2fb1dd53ef4d9f473549046f","amp;dn":"Michio+Kaku+-+Physics+of+the+Impossible","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"17b3ad202eb1feeb2fb1dd53ef4d9f473549046f","infoHashBuffer":{"type":"Buffer","data":[23,179,173,32,46,177,254,235,47,177,221,83,239,77,159,71,53,73,4,111]},"announce":[],"urlList":[]}}