{"title":"Deine Lakaien - 20 Years of Electronic Avantgarde[FLAC - LOSSLES","uid":4170693,"size":778247283,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:17dec769b05f252dbbb5633be62a6907c78b8b45&amp;dn=Deine+Lakaien+-+20+Years+of+Electronic+Avantgarde%5BFLAC+-+LOSSLES&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"99AM","files":29,"time":1209843921,"description":"FLAC files + CUE sheet + Covers\nReleased date: June 11, 2007.\n\nHere is the audio cds from the special 2007 live show package:\n\nTrack Listing:\n\nTracks CD1:\n1. Lonely\n2. Slowly comes My night\n3. Follow Me\n4. Madiel\n5. Into My Arms\n6. The mirror men\n7. Generators\n8. Away\n9. Over and done\n10. Dark Star\n\n\nTracks CD2:\n1. Colour-Ize\n2. Nobody?s wounded\n3. Mindmachine\n4. Brainfic\n5. Vivre\n6. Return\n7. Reincarnation\n8. Wunderbar\n9. Overpaid\n10. Where You are\n11. Love Me to the End\n\n\n\nReview from Gothronic.com:\n\nDeine Lakaien has devoted itself to a monolithic achievement with 20 Years of Electronic Avantgarde. Deine Lakaien have been active for 29 years as progressive darkwave popband but such a tour and recordings together with a philharmonic orchestra has not been done before. Ernst Horn and Veljanov decided in celebration of the 20 year anniversary of the band Deine Lakaien to embark on such an operation together with the Neue Philharmonie orchestra of Frankfurt, which is known for their opera, avantgarde and crossover approach with popular music. The contact was easy to make as Deine Lakaien cello player Tobias is also active in this orchestra. The result is much more than just a combination of classical and popmusic. All songs have been fully reworked and rearranged with the best possible use of the orchestra influence with the various different musicians as well as the electronic framework of Deine Lakaien itself. The electronic aspect and the musical diversity of Deine Lakaien with it?s richness in style influences from darkwave, medieval, new wave pop and classical, is still there judging the DVD images and the adio sound on the double CD, but it gets a new dimension with the orchestra interpretation. Experiments with vocals such as in ?Mindmachine? are well expressed and the new renditions of other classics such as ?Slowly Comes the Night?, ?Into My Arms?, ?Generators?, ?Over and Done??, ?Dark Star?, ?Return?, ?Reincarnation? and ?Overpaid? are impressively performed. You can almost feel the tension and excitement in the audience and the concentration of the musicians with these recordings.\n\nThe tour started in february 2007 in the old operahouse of Frankfurt. More impressive a location hardly seems possible. Further concerts brought the 20 Years of Electronic Avantgarde tour to Hannover, Munchen, Stuttgart, Oberhausen, Berlijn and Leipzig. Thousands of tickets were sold and the tour resulted in a big success. Following the release of the recordings of this tour further concerts will be done in a.o. Dresden, Hamburg, Erlangen and as headliner of the Mera Luna festival.\n\nThe 20 Years of Electronic Avantgarde will be out in various versions. There?s a double audio cd, a double DVD and a 2CD+2DVD with bonus DVD in a special collector?s box available.\n\nThe double cd features the entire concert, available in dolby digital 5.1 and 2.0. The double DVD as well has the concert filmed in Oberhausen with no less than 12 camera?s, and a tour documentary by Marat Burnashev. The bonus DVD has all videoclips from Deine Lakaien and images of previous tours such as a.o. the Live Acoustic tour in 1992, the Forest Enter Exit tour in 1993 and images of the live debut of Deine Lakaien with the Dark Star tour from 1991. 20 Years of Electronic Avantgarde is a nice digital memory of this concert series and also a good replacement for those who could not be there. Such a collection with all the extra material is also meant as a thank you to the many fans of Deine Lakaien. Deine Lakaien is and remains the world?s best darkwave band and this special anniversary release proves it again.\n\n\nEnjoy and keep on seeding as much as you can this special release from a special band.","torrent":{"xt":"urn:btih:17dec769b05f252dbbb5633be62a6907c78b8b45","amp;dn":"Deine+Lakaien+-+20+Years+of+Electronic+Avantgarde%5BFLAC+-+LOSSLES","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"17dec769b05f252dbbb5633be62a6907c78b8b45","infoHashBuffer":{"type":"Buffer","data":[23,222,199,105,176,95,37,45,187,181,99,59,230,42,105,7,199,139,139,69]},"announce":[],"urlList":[]}}