{"title":"Windows Communication Foundation Unleashed","uid":5285823,"size":11650623,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1943053045493d7d43e2b52de234b521f48df527&amp;dn=Windows+Communication+Foundation+Unleashed&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"abhishes","files":1,"time":1263721369,"description":"Windows Communication Foundation (WCF) is a new Microsoft technology for allowing software to communicate. Superseding earlier technologies, such as COM/DCOM, .NET Remoting, ASP.NET Web Services, and the Web Services Enhancements for .NET, WCF provides a single solution that is designed to always be the best way to exchange data among software entities. It also provides the infrastructure for developing the next generation of Web services, with support for the WS-* family of specifications, and a new serialization system for enhanced performance. For information technology professionals, WCF supplies an impressive array of administration tools that enterprises and software vendors can use to reduce the cost of ownership of their solutions without writing a single line of code. Most important, WCF finally delivers on the long-postponed promise of model-driven software development with the new software factory approach, by which one can iteratively design solutions in a modeling language and generate executables from lower-level class libraries.\n\n \n\nWindows Communication Foundation Unleashed is designed to be the best resource for software developers and architects working with WCF. The book guides readers toward a conceptual understanding of all the facilities of WCF and provides step-by-step guides to applying the technology to practical problems.\n\n \n\n    * Introduces you to WCF and then takes you deep inside the technology\n    * Gives you nearly 100 best practices for programming with WCF\n    * Provides detailed coverage on how to version services that you will not find anywhere else\n    * Delves into using WCF together with Windows Workflow Foundation and Windows CardSpace\n    * Provides detailed coverage of the new high-performance data contract serializer for .NET\n    * Walks you through how to do secure, reliable, transacted messaging, and how to understand the options available\n    * Introduces you to federated, claims-based security, and shows you how to incorporate SAML and WS-Trust security token services into your architecture\n    * Provides step-by-step instructions for how to customize every aspect of WCF\n    * Shows you how to add your own behaviors, communication channels, message encoders, and transports\n    * Gives you options for implementing publish/subscribe solutions\n    * Walks you through how to do peer-to-peer communications with WCF \n\n \n\nAs evangelists at Microsoft for WCF, Craig McMurtry, Marc Mercuri, Nigel Watling, and Matt Winkler are uniquely positioned to write this book. They had access to the product as it was being built and to the development team itself. Their work with enterprises and outside software vendors has given them insight into how others see the software, how they want to apply it, and the challenges they face in doing so.","torrent":{"xt":"urn:btih:1943053045493d7d43e2b52de234b521f48df527","amp;dn":"Windows+Communication+Foundation+Unleashed","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1943053045493d7d43e2b52de234b521f48df527","infoHashBuffer":{"type":"Buffer","data":[25,67,5,48,69,73,61,125,67,226,181,45,226,52,181,33,244,141,245,39]},"announce":[],"urlList":[]}}