{"title":"The Energetics Of Healing - Caroline Myss - Part 1 of 2 [1998]","uid":4242117,"size":731136000,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:19484e4e7533da1abb28b26a00d60847be2ad980&amp;dn=The+Energetics+Of+Healing+-+Caroline+Myss+-+Part+1+of+2+%5B1998%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"lil.bro","files":1,"time":1213603031,"description":"The Energetics Of Healing - Caroline Myss - Part 1 of 2 [1998]\n(Sounds True Presents)\n\nVideo: XViD 288 x 224\nAudio: MP3 80 kbps VBR\nSource: VHS\nRuntime: 1:29:25\n\nExplore the Unseen Dimension of Your Body&amp;#039;s Energy Anatomy\n\nBeyond the threshold of your physical anatomy lies another type of anatomy--invisible to the eye, yet critical to your health. Composed of pure energy, this vast network not only determines how your body functions and heals, but also serves as a connection to divine power and life.\n\nOn The Energetics of Healing, join bestselling author and health authority Dr. Caroline Myss for a fascinating guided tour of this hidden dimension of the human body. Using computer graphics created especially for this program, Dr. Myss pulls back the curtain on the body&amp;#039;s physical anatomy to reveal its energy anatomy. Dr. Myss guides you through all seven chakra centers and correlates them with daily practices for learning the physical language of the spirit--and the spiritual language of the body. The Energetics of Healing offers a bold new vision of the human body and the unseen obstacles to healing.\n\nProgram Highlights:\n\n    * Your energy anatomy; what it is and how it works\n    * Intuition: your greatest gift for better health\n    * How your biography becomes your biology\n    * Seven sacred truths essential to your spiritual and physical wellness\n    * An eye-opening tour of the body&amp;#039;s chakra system\n    * Forgiveness: how it can instantly build energy\n    * Vivid computer graphics of the human body&amp;#039;s energy anatomy, and more \n\nCaroline Myss, Ph.D., a pioneer in the field of energy medicine and human consciousness, holds degrees in journalism, theology, and intuition and energy medicine. Over the past decade, her work with Norman Shealy, M.D., a Harvard-trained neurosurgeon and founder of the American Holistic Medical Association, has helped define how stress and emotion contribute to the formation of disease. She is the co-author, with Dr. Shealy, of The Creation of Health (Stillpoint, 1993) and author of Anatomy of the Spirit (Harmony Books, 1996). Her latest book is Why People Don&amp;#039;t Heal and How They Can (Harmony Books, November 1997).","torrent":{"xt":"urn:btih:19484e4e7533da1abb28b26a00d60847be2ad980","amp;dn":"The+Energetics+Of+Healing+-+Caroline+Myss+-+Part+1+of+2+%5B1998%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"19484e4e7533da1abb28b26a00d60847be2ad980","infoHashBuffer":{"type":"Buffer","data":[25,72,78,78,117,51,218,26,187,40,178,106,0,214,8,71,190,42,217,128]},"announce":[],"urlList":[]}}