{"title":"On the Edge - The State and Fate of the World's Tropical Rainfor","uid":12626374,"size":13177367,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:19c279b9d626dc1736a8aae9dd2e784c28b40f25&amp;dn=On+the+Edge+-+The+State+and+Fate+of+the+World%27s+Tropical+Rainfor&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"GoonerTPB","files":1,"time":1445778908,"description":"Publisher: Greystone Books (May 21, 2015)\r\nLanguage: English\r\nISBN-10: 1771641401\r\nISBN-13: 978-1771641401\r\n\r\nIn 1972, The Limits to Growth introduced the idea that world resources are limited. Soon after, people became aware of the threats to the world’s rainforests, the biggest terrestrial repositories of biodiversity and essential regulators of global air and water cycles. Since that time, new research and technological advances have greatly increased our knowledge of how rainforests are being affected by changing patterns of resource use. Increasing concern about climate change has made it more important than ever to understand the state of the world’s tropical forests.\r\n\r\nThis book provides an up-to-date picture of the health of the world’s tropical forests. Claude Martin, an eminent scientist and conservationist, integrates information from remote imaging, ecology, and economics to explain deforestation and forest health throughout the world. He explains how urbanization, an increasingly global economy, and a worldwide demand for biofuels put new pressure on rainforest land. He examines the policies and market forces that have successfully preserved forests in some areas and discusses the economic benefits of protected areas. Using evidence from ice core records and past forest cover patterns, he predicts the most likely effects of climate change","torrent":{"xt":"urn:btih:19c279b9d626dc1736a8aae9dd2e784c28b40f25","amp;dn":"On+the+Edge+-+The+State+and+Fate+of+the+World%27s+Tropical+Rainfor","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"19c279b9d626dc1736a8aae9dd2e784c28b40f25","infoHashBuffer":{"type":"Buffer","data":[25,194,121,185,214,38,220,23,54,168,170,233,221,46,120,76,40,180,15,37]},"announce":[],"urlList":[]}}