{"title":"Shitmaster 31","uid":9474248,"size":664727058,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:1a349e463ca46e004861972572ab57eb2c9c072a&amp;dn=Shitmaster+31&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"xxxlavalxxx","files":4,"time":1389652875,"description":"Part One: A beautiful young female slave (Isabelle Extreme) is led on her hands and knees by her male master. He spanks her ass, and her pussy with a crop. A tube and funnel are inserted and strapped to her mouth. Her hands are bound behind her. The master unzips, places his cock in the funnel, and pisses in it. The slave has no choice by to swallow his piss.\n\nShe is then restrained to a wall. The master teases her pussy with vibrators. Afterward, she is then let down, and bent over. A big brown dildo is inserted into her ass. As the master works the dildo in and out of her asshole, brown shit squeezes out. The master turns the slave around and smears the brown shit from the dildo all over her mouth.\n\nThe master lays her on her back, climbs over her face, squats down over her mouth, and takes a big brown shit right in her mouth! He makes her put the whole turd in her mouth, making her chew on it. She lays down on her back, puts her legs way in the air, and takes a big piss.\n\nNext, master grabs a big glass of milk. She is allowed to drink it down. Of course, when master shoves a shit covered dildo down her throat, the milk all comes right back up again! Master then sprays the slimy mess off of her chest with some of his piss.\n\nPart Two: A hot couple are in the living room having some rough sex. The hot brunette woman is on her knees sucking cock. The long haired male stud places her on the sofa, forces her legs apart, and licks her pussy. He makes her suck his cock some more. He grabs her head a lot, and forces his cock down her throat. He bends her over on the sofa, gets behind her, and fucks her roughly from behind. She climbs up on top of him, and rides his cock. While riding his dick, she starts to shit. He bends her over on the sofa, and shoves his cock up her shitty hole. Then he makes her suck the shit off of his dick. He lays her back, climbs over the top of her, and takes a big shit right on her chest. The shit gets smeared all over, as they continue to fuck.\n\n &lt;a href=&quot;\nhttp://imgdone.com/viewer.php?file=86383323804628312561.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgdone.com/viewer.php?file=86383323804628312561.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://imgdone.com/viewer.php?file=62688336461853890068.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgdone.com/viewer.php?file=62688336461853890068.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:1a349e463ca46e004861972572ab57eb2c9c072a","amp;dn":"Shitmaster+31","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1a349e463ca46e004861972572ab57eb2c9c072a","infoHashBuffer":{"type":"Buffer","data":[26,52,158,70,60,164,110,0,72,97,151,37,114,171,87,235,44,156,7,42]},"announce":[],"urlList":[]}}