{"title":"Sevendust - Enemy (2nafish)","uid":6065345,"size":111063044,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:1a4b8d092d3e4fbce51d7c067a4f4363ad2e202d&amp;dn=Sevendust+-+Enemy+%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":-1,"time":1293329376,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nThis video has no logos or titles.\n\n\nEnemy is the lead single of album Seasons by American heavy metal band Sevendust. The song was also played when New York Yankees center fielder Johnny Damon came up to bat.\n\nThe music video for &quot;Enemy&quot; was directed by Adam Pollina, a former artist for the comic book &quot;X-Force&quot;, and features an appearance by ex-WWE female wrestler Chyna. Also the video which allows Rose to show his vocal skills more prominently than usual, was written about Devildriver frontman Dez Fafara (ex-Coal Chamber).\n\nThe song peaked #10 at Mainstream Rock Charts and peaked #30 at Modern Rock Chart Billboard 200.\n\nIt was the Official theme song for WWE Unforgiven 2003. The song also featured in horror film &quot;Evil Deeds&quot;. Also makes an appearance on trailer for SmackDown! Here Comes The Pain.\n\n&quot;Enemy&quot; was written and largely sung by Morgan Rose, who at the time was married to former Coal Chamber bassist Rayna Foss-Rose. The song, a full-on character assassination, features such lines as, &quot;Look at your face, look at your name/ Funny you're a loser with only yourself to blame,&quot; and &quot;You want to be like me 'cause it's real/ So you steal on your way to fame.&quot;\n\n&quot;That song is about the person in the world that I hate more than Saddam Hussein,&quot; Rose said. &quot;It was good to be able to get that stuff off my chest because I was able to express myself without doing anything stupid that would get me in trouble.&quot;\n\n&quot;Enemy&quot; was originally called &quot;Pez&quot;, a derogatory nickname Rose had for Coal Chamber frontman Dez Fafara. &quot;We called him that because I used to say, 'I want to take this dude's head and pull it back and rip his tongue out of his neck,' &quot; Rose grumbled.\n\nRose said that he has such rancor for Fafara because of the way he allegedly treated Foss-Rose when Coal Chamber were together. &quot;He's a horrible human being and he fucked my wife over real bad,&quot; he said. &quot;But it turned out to be a really good song.&quot;\n\nSeasons is the fourth studio album by American hard rock band Sevendust. The limited edition album comes with a DVD featuring &quot;Black&quot; (Live and Acoustic) and some other special features. Seasons was dedicated to the memory of Reginald Whiterspoon (Lajon Witherspoon's younger brother) and Dave Williams (Drowning Pool's original singer).\n\nThe album's lead single, &quot;Enemy&quot;, had a music video which was shown frequently on Headbangers Ball in late 2003. It features former professional wrestler Chyna in a comical yet violent street brawl against an armless man.\n\nSeasons was, for a time, the band's last album with Clint Lowery as he left the band in 2004. However, in March 2008, he returned to Sevendust.\n\nMorgan Rose thought Seasons too commercial because Sevendust lost creative control with TVT Records thinking that Seasons should be suitable for radio airplay.\n\n&quot;Separate&quot; appeared in MTV2 Headbangers Ball.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:1a4b8d092d3e4fbce51d7c067a4f4363ad2e202d","amp;dn":"Sevendust+-+Enemy+%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1a4b8d092d3e4fbce51d7c067a4f4363ad2e202d","infoHashBuffer":{"type":"Buffer","data":[26,75,141,9,45,62,79,188,229,29,124,6,122,79,67,99,173,46,32,45]},"announce":[],"urlList":[]}}