{"title":"Pixar.Shorts","uid":4625862,"size":4681588736,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:1c90ce42329ad0279c96650161a0e09e899c83ed&amp;dn=Pixar.Shorts&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"crissybunny","files":1,"time":1231206443,"description":"Short Pixar Animation\n\nPixar Short Films Collection - Volume 1 (2004)\n\n\nPixar's unprecedented string of hit animated features was built on the short films in this collection. John Lasseter and Ed Catmull used these cartoons the way Walt Disney used the &quot;Silly Symphonies&quot; during the 1930s: as a training ground for artists and a way to explore the potential of a new medium. Although it's only 90 seconds long, &quot;Luxo, Jr.&quot; (1986) ranks as the &quot;Steamboat Willie&quot; of computer animation: For the first time, audiences believed CG characters could think and feel. (It was also the first CG film to make audiences laugh.) When the artists began work on Toy Story, they had learned so much from the shorts, they were ready to undertake that landmark creation. In the later shorts, the viewer can see the artists continuing to experiment: with a more realistic human figure in &quot;Geri's Game&quot; and with new ways of suggesting atmospheric effects in &quot;Boundin'.&quot; Some of the more recent shorts continue the adventures of the characters from the features. &quot;Jack-Jack Attack&quot; reveals what happened to the hapless baby-sitter while the Incredibles were off fighting Syndrome, while &quot;Mater and the Ghost Light&quot; shows that life goes on for the inhabitants of Radiator Springs. When Sully from Monsters, Inc. tries to adjust his seat in &quot;Mike's New Car,&quot; the animators prolong the moment to wring every drop of humor from the situation--just as an earlier generation of animators milked Wile E. Coyote's antics for all they were worth. The long-unseen films for Sesame Street are an unexpected bonus. A delightful collection of entertaining shorts, and a significant chronicle of the growth of computer animation. (Rated G: suitable for all ages: cartoon violence)\n\n\n Actors: Pixar Short Films\n\n Format: Animated, Color, Dolby, DVD-Video, NTSC\n\n Language: English\n\n Region: NO Region Setting\n\n Aspect Ratio: 1.33:1\n\n Number of discs: 1\n\n Rating: G\n\n Studio: Walt Disney Video\n\n DVD Release Date: November 6, 2007\n\n Run Time: 54 minutes\n\nAudio:\n ENGLISH: Dolby Digital 5.1 [CC]\n ENGLISH: Dolby Digital Stereo [CC]\n SPANISH: Dolby Digital Stereo\n FRENCH: Dolby Digital Stereo \n\nSubtitles:\nEnglish\nSpanish\nFrench\n\n1. &quot;THE ADVENTURES OF ANDRE AND WALLY B.&quot; (1984, Lucasfilm). After blue humanoid Andre is awakened in a forest by a pesky bee, he tries to escape. But the bee (named Wally B.) chases after him, and both characters run off screen. Finally, Wally reappears with a bent stinger. Interesting only for its historical value\n\n2. &quot;LUXO JR.&quot; (1986). When a large desklamp watches a smaller, younger desk lamp play with a ball, he can't quite manage to do it himself.\n\n3. &quot;RED'S DREAM&quot; (1987). Propped up in the corner of a bicycle store, Red the unicycle dreams about a better place.\n\n4. &quot;TIN TOY&quot; (1988). When a wind-up one-man-band toy sees just how destructive a baby can be, he does everything he can to flee -- until the baby gets hurt.\n\n5. &quot;KNICK KNACK&quot; (1989). A snowglobe snowman wants to join a party of other travel souvenirs in a hot party, but his glass dome gets in his way. (This is the well-known version with the less-endowed bathing beauty.)\n\n6. &quot;GERI'S GAME&quot; (1997). A man plays a game of chess against himself, 'becoming' each player by moving to the other side of the chessboard and taking his glasses on and off.\n\n7. &quot;FOR THE BIRDS&quot; (2001). A group of small birds perched together on a telephone wire reject a larger, awkward-looking bird, and pay the price for it.\n\n8. &quot;MIKE'S NEW CAR&quot; (2002). When Mike (from &quot;Monsters Inc.&quot;) shows Sulley his new six-wheel drive car, everything that can go wrong does.\n\n9. &quot;BOUNDIN'&quot; (2003). A shearing leaves a dancing sheep humiliated until a jackalope passes by and demonstrates that it's what's inside that counts.\n\n10. &quot;JACK-JACK ATTACK&quot; (2005). Baby Jack-Jack is thought not to possess the superpowers of his siblings or parents (Mr. and Mrs. Parr of &quot;The Incredibles&quot;) until an outsider is hired to watch him.\n\n11. &quot;ONE MAN BAND&quot; (2006). Two one-man bands vie to win the attention of a young peasant girl.\n\n12. &quot;MATER AND THE GHOSTLIGHT&quot; (2006). A mysterious blue light haunts the &quot;Cars&quot; town of Radiator Springs and its residents.\n\n13. &quot;LIFTED&quot; (2007). A bumbling young alien student tests the patience of his instructor as he attempts to abduct an innocent farmer.\n\nBonus features include a terrific documentary featurette on Pixar and some brief segments the company produced for &quot;Sesame Street.&quot;\n","torrent":{"xt":"urn:btih:1c90ce42329ad0279c96650161a0e09e899c83ed","amp;dn":"Pixar.Shorts","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1c90ce42329ad0279c96650161a0e09e899c83ed","infoHashBuffer":{"type":"Buffer","data":[28,144,206,66,50,154,208,39,156,150,101,1,97,160,224,158,137,156,131,237]},"announce":[],"urlList":[]}}