{"title":"HISTORY OF POP AND ROCK MUSIC - part 346","uid":6941640,"size":432801550,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:1eb650cc1a690ae52b9344aca2a7c57e9a1fe24b&amp;dn=HISTORY+OF+POP+AND+ROCK+MUSIC+-+part+346&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"pupovaczlatko","files":-1,"time":1326063098,"description":"\n\n                    PART  346\n\n\n            THE WHO - I'm a Boy  (1966)\n            THE YARDBIRDS  -  Happenings Ten Years Time Ago  (1966)\n            THE SMOKE  -  My Friend Jack  (1967)\n            THE TROGGS - Night of the long grass (1967)\n\n\n            \n     &quot;I'm a Boy&quot; is a 1966 rock song written by Pete Townshend for his band The Who. The song, like other early recordings by the band, such as &quot;I Can't Explain&quot;, &quot;The Kids Are Alright&quot; and &quot;Happy Jack&quot;, centers around the early power pop genre. The song was originally intended to be a part of a rock opera called 'Quads' which was to be set in the future where parents can choose the sex of their children. The idea was later scrapped, but this song survived and was later released as a single.\n    \n    &quot;Happenings Ten Years Time Ago&quot; was the first single by the British rock band The Yardbirds to feature future Led Zeppelin guitarist Jimmy Page in the band. Page had recently replaced the original bassist for The Yardbirds, Paul Samwell-Smith. &quot;Happenings Ten Years Time Ago&quot; was also the first of three recordings pairing Page with incumbent lead guitarist Jeff Beck. The single reached #30 on Billboard in the U.S. and #43 in the UK charts.This song was covered by Todd Rundgren in 1976 on his album Faithful.\n   \n     The Smoke was an English pop group from York. Their biggest hit was &quot;My Friend Jack&quot; (German Charts: #2, UK charts: #45).   They consisted of Mick Rowley (lead vocals), Mal Luker (lead guitar) , Zeke Lund (bass) and Geoff Gill (drums).  \n\n    &quot;Night Of The Long Grass&quot; is a song by The Troggs, This release entered UK charts on June 1 1967. The total number of weeks this release was in charts 6 and the highest place ever reached was number 17.    ","torrent":{"xt":"urn:btih:1eb650cc1a690ae52b9344aca2a7c57e9a1fe24b","amp;dn":"HISTORY+OF+POP+AND+ROCK+MUSIC+-+part+346","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1eb650cc1a690ae52b9344aca2a7c57e9a1fe24b","infoHashBuffer":{"type":"Buffer","data":[30,182,80,204,26,105,10,229,43,147,68,172,162,167,197,126,154,31,226,75]},"announce":[],"urlList":[]}}