{"title":"Mathematics for Physical Chemistry 3rd ed - Robert G. Mortimer","uid":12068289,"size":3444802,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1f7a5754929805fef8598a7a9e7521212e27f888&amp;dn=Mathematics+for+Physical+Chemistry+3rd+ed+-+Robert+G.+Mortimer&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1435440342,"description":"ISBN 0125083475\n\nMathematics for Physical Chemistry, Third Edition, is the ideal text for students and physical chemists who want to sharpen their mathematics skills. It can help prepare the reader for an undergraduate course, serve as a supplementary text for use during a course, or serve as a reference for graduate students and practicing chemists. The text concentrates on applications instead of theory, and, although the emphasis is on physical chemistry, it can also be useful in general chemistry courses. \n\nThe Third Edition includes new exercises in each chapter that provide practice in a technique immediately after discussion or example and encourage self-study. The first ten chapters are constructed around a sequence of mathematical topics, with a gradual progression into more advanced material. The final chapter discusses mathematical topics needed in the analysis of experimental data. \n\n* Numerous examples and problems interspersed throughout the presentations \n* Each extensive chapter contains a preview, objectives, and summary\n* Includes topics not found in similar books, such as a review of general algebra and an introduction to group theory\n* Provides chemistry specific instruction without the distraction of abstract concepts or theoretical issues in pure mathematics","torrent":{"xt":"urn:btih:1f7a5754929805fef8598a7a9e7521212e27f888","amp;dn":"Mathematics+for+Physical+Chemistry+3rd+ed+-+Robert+G.+Mortimer","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1f7a5754929805fef8598a7a9e7521212e27f888","infoHashBuffer":{"type":"Buffer","data":[31,122,87,84,146,152,5,254,248,89,138,122,158,117,33,33,46,39,248,136]},"announce":[],"urlList":[]}}