{"title":"Crysis 2.Limited Edition.v.1.9.0.0.(Electronic Arts)+DX11.and.Hi","uid":7434438,"size":8569470789,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:1f96a517fe2ca268b0d86ebd1f3617220bab2959&amp;dn=Crysis+2.Limited+Edition.v.1.9.0.0.%28Electronic+Arts%29%2BDX11.and.Hi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":-1,"time":1342031343,"description":"Crysis 2 ÃƒÂ© a sequela de um dos maiores PC first-person shooters ainda criado. Com a guerra futurista, destruiÃƒÂ§ÃƒÂ£o lindo ea chance de chutar o traseiro de alienÃƒÂ­gena no maior palco de todos, New York City, Crysis 2 ÃƒÂ© destinado, no mÃƒÂ­nimo, para igualar o seu antecessor, se nÃƒÂ£o ultrapassÃƒÂ¡-lo. As caracterÃƒÂ­sticas adicionais incluem: inimigos desafiadores ai no single player campanha, o suporte 12-jogador online, nova e melhorada Nanosuit atualizÃƒÂ¡vel 2 tecnologia e mais. O mundo foi devastado por uma sÃƒÂ©rie de desastres climÃƒÂ¡ticos e da sociedade ÃƒÂ© Ãƒ beira do colapso total. Agora, os estrangeiros voltaram, com um total forÃƒÂ§a de invasÃƒÂ£o empenhados em nada menos que a total aniquilaÃƒÂ§ÃƒÂ£o da humanidade, comeÃƒÂ§ando pela tentativa de rasgar o coraÃƒÂ§ÃƒÂ£o da cidade mais emblemÃƒÂ¡tica da Terra.Em Nova York, aterrorizante talo invasores alienÃƒÂ­genas nas ruas e um pesadelo praga derruba habitantes mirÃƒÂ­ade da cidade com epidemia brutal velocidade. Sistemas da cidade estÃƒÂ£o um caos, as ruas e horizonte sÃƒÂ£o esmagou e em chamas ruÃƒÂ­na. Esta ÃƒÂ© a cidade de Nova York como vocÃƒÂª nunca viu antes. Nem aplicaÃƒÂ§ÃƒÂ£o da lei paramilitar, nem o poder de os EUA mÃƒÂ¡quina militar pode estar contra os invasores, e todos os que optam por nÃƒÂ£o fugir sÃƒÂ£o homens mortos andando. SÃƒÂ³ para sobreviver neste turbilhÃƒÂ£o de morte se nÃƒÂ£o se requerem tecnologia alÃƒÂ©m de qualquer coisa qualquer soldado moderno jÃƒÂ¡ viu. No entanto, um homem herdarÃƒÂ¡ o que significa para sobreviver. Um supersoldado, empunhando a tecnologia de melhoramento de combate do futuro, com Nanosuit 2, farÃƒÂ¡ a ÃƒÂºltima posiÃƒÂ§ÃƒÂ£o para salvar a humanidade da destruiÃƒÂ§ÃƒÂ£o na selva urbana que ÃƒÂ© Nova York. CaracterÃƒÂ­sticas New York New York - Crysis definir a referÃƒÂªncia visual para jogos de PC que ainda hoje. Crysis 2 redefine o valor de referÃƒÂªncia em console e PC plataformas, deslocando sua atenÃƒÂ§ÃƒÂ£o para a selva urbana de rico New York City Aliens incrÃƒÂ­veis e AI - AI best-in-class Desafio com grupo ÃƒÂºnico coordenaÃƒÂ§ÃƒÂ£o e grupo de sistemas de comportamento que dÃƒÂ£o respostas realistas para suas aÃƒÂ§ÃƒÂµes Nanosuit 2 - Adapte suas tÃƒÂ¡ticas de combate, personalizando o seu Nanosuit e armas em tempo real com os modos de revistas, destravar uma variedade de habilidades supersoldado Multiplayer - de renome mundial multijogador atirador estÃƒÂºdio Crytek Reino Unido reinventa multiplayer com a intensidade dinÃƒÂ¢mica do Nanosuit 2. Usando a tecnologia Nanosuit o jogador tem maneiras quase ilimitadas para aproximar-se do ambiente de combate dinÃƒÂ¢mico. 1-12 jogadores sÃƒÂ£o suportados on-line. ","torrent":{"xt":"urn:btih:1f96a517fe2ca268b0d86ebd1f3617220bab2959","amp;dn":"Crysis+2.Limited+Edition.v.1.9.0.0.%28Electronic+Arts%29%2BDX11.and.Hi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1f96a517fe2ca268b0d86ebd1f3617220bab2959","infoHashBuffer":{"type":"Buffer","data":[31,150,165,23,254,44,162,104,176,216,110,189,31,54,23,34,11,171,41,89]},"announce":[],"urlList":[]}}