{"title":"Suicide Squad (1990-07) 43-56 (digital) (OkC.O.M.P.U.T.O.-Novus-","uid":10513352,"size":524593160,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:1fbdf01ba63c054b1b196236e6cc348eb6bab1eb&amp;dn=Suicide+Squad+%281990-07%29+43-56+%28digital%29+%28OkC.O.M.P.U.T.O.-Novus-&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"dadrkhomr","files":14,"time":1404876137,"description":"A Novus Release\n\n\n\n\nThis torrent includes the digital version.\n  \n \n\n\n*Note: You can download all or only choose which version you'd prefer by deselecting the one you don't want when you add the torrent to your client software. If you're adding the torrent via magnet link, you can deselect any undesired file in the list of files once the torrent has begun downloading.\n\n========================================================\n\n\n\n\n\n\n\n#43  The Suicide Squad must complete their mission in Europe in order to gain their freedom--and become independent agents. &quot;The Phoenix Gambit&quot; part 4. \n\n#44  One hero falls and another rises in their place. Meanwhile, Captain Boomerang attends his mother's funeral and learns a secret about his past.\n\n#45  The Suicide Squad meets their wits' end fighting with a new group called Hayoth. However, there's no rest for the wicked when their primary objective, Kobra, joins the party. \n\n#46  The Suicide Squad and Hayoth join forces to fight against Kobra, but Amanda Waller has her own set of terms for the team's cooperation\n\n#47  As the battle against Kobra continues, the teams quickly realize their combined powers may not be enough--prompting Raven to take Kobra on single-handedly! \n\n#48  Oracle reflects on how she came to be in the Suicide Squad, flashing back to a pivotal moment from THE KILLING JOKE! \n\n#49  The New Thinker has taken control of Amanda Waller's mind and is now running the Suicide Squad, but his real target is none other than Oracle. \n\n#50  Amanda Waller puts together a special team that includes Suicide Squad founding members Nemesis, Nightshade, Bronze Tiger, and Deadshot for a personal mission to preserve the legacy of Rick Flag. \n\n#51  Deadshot's costume has been missing for months, and when he tracks it down, he finds it in the hands of another. \n\n#52  The unexpected return of an ex-Squad member in the most offbeat tale yet. Prepare for the death and life of Doctor Light! \n\n#53  &quot;The Dragon's Horde&quot; part 1! Amanda and the Squad are hired by the Japanese government to recover the Dragon's Horde, a cache of Soviet weaponry hidden in Cambodia. \n\n#54  The Squad moves into position throughout the Far East, bringing them up against the Red Shadows, the Yakuza, and the Khmer Rouge. &quot;The Dragon's Horde&quot; part 2. \n\n#55  The Yakuza prepares to execute Amanda Waller while Deadshot, Count Vertigo, and Steelwolf go up against the Khmer Rouge. &quot;The Dragon's Horde&quot; part 3. \n\n#56  With the members of the Squad all captured or surrounded, it's up to one person to save the day: the Atom! &quot;The Dragon's Horde&quot; finale. \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nThanks goes to the OkC.O.M.P.U.T.O for this release.\n\n","torrent":{"xt":"urn:btih:1fbdf01ba63c054b1b196236e6cc348eb6bab1eb","amp;dn":"Suicide+Squad+%281990-07%29+43-56+%28digital%29+%28OkC.O.M.P.U.T.O.-Novus-","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1fbdf01ba63c054b1b196236e6cc348eb6bab1eb","infoHashBuffer":{"type":"Buffer","data":[31,189,240,27,166,60,5,75,27,25,98,54,230,204,52,142,182,186,177,235]},"announce":[],"urlList":[]}}