{"title":"Download Accelerator Plus [DAP] v9.5.0.2  Premium","uid":6497990,"size":14930896,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:208715133e820b0492f093ec75df6f425c9232bc&amp;dn=Download+Accelerator+Plus+%5BDAP%5D+v9.5.0.2++Premium&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"DJ_Jet","files":6,"time":1309147389,"description":"DAP Premium: Extreme acceleration, powerful privacy features, and advanced downloading tools. \n\nDownload Accelerator Plus (DAP Premium) accelerates the speed with which you can receive files over the Internet using FTP and HTTP protocols, by simultaneously downloading several file segments from the same or different servers. The application enables you to pause and resume downloads, and to recover from a dropped internet connection. \n\nIn addition, DAP searches for mirror sites and implements the downloads from the best or most responsive mirrors. It is configured by default to automatically integrate into your Internet Explorer, Firefox, Opera or Netscape browser when it is installed, and to self-activate each time a download is performed. \n\nNo further configuration or action is required on your part - simply use your browser to access the desired site, click on the download file, and respond to the self-explanatory DAP dialogs that appear. \n\nDAP's advanced options enable you to tailor the operation of the application to your needs. You can choose to trigger specific responses including messages, queue update, and closing the application and disconnecting after the download completes or is unavailable. \n\nSee what you get with DAP Premium: \n\nPremium Acceleration: Unleash the full power of DAP! Download files with Extreme Acceleration, downloading with up to ten connections at once. DAP Premium provides the fastest possible download speeds. \n\nPremium Privacy Tools: Keep your privacy with DAP Premium. Shred files beyond recovery with DAP's File Shredder and remove download traces with Trace Cleaner for confidential downloading. Lock and hide your files in a Private Folder to keep them protected. \n\nPremium Download Experience: DAP Premium gives you powerful download tools. Use ZIP Preview to view and extract ZIP files as you download; Password Manager stores your download passwords to keep things simple. \n\nPremium Support: With DAP Premium you will receive priority Gold Support so you will always have the help you need. You will also receive one year of SpeedBit Upgrade Coverage so you will always have the most up to date version of DAP. \n\nPremium File Transfer: Use Advanced FTP tools for more powerful FTP downloading. Access two or more FTP sites simultaneously; browse FTP sites and view remote files even without downloading them. \n\nCompatible with: Windows 98 / ME / XP / NT4 / 2000 / Vista and Windos 7. \nMultilingual: English, Spanish, French, Portuges, Italian, Russian, German, etc \nSize: 10 MB","torrent":{"xt":"urn:btih:208715133e820b0492f093ec75df6f425c9232bc","amp;dn":"Download+Accelerator+Plus+%5BDAP%5D+v9.5.0.2++Premium","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"208715133e820b0492f093ec75df6f425c9232bc","infoHashBuffer":{"type":"Buffer","data":[32,135,21,19,62,130,11,4,146,240,147,236,117,223,111,66,92,146,50,188]},"announce":[],"urlList":[]}}