{"title":"Food Inc. [Theora] 720p","uid":5480132,"size":5581075400,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:208998aad058659b524ff4fd71204112f68c9fa5&amp;dn=Food+Inc.+%5BTheora%5D+720p&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"frostbrand","files":-1,"time":1270382048,"description":"Encode:\nAudio: Vorbis stereo 48KHz 192Kbit/s\nVideo: Theora 720p (1280x720)\n\nSubtitles: english/dutch/hungarian/polish/spanish\n\nDescription (copy-edited from wikipedia):\nFood, Inc. is an American documentary film directed by Emmy Award-winning filmmaker Robert Kenner. The film examines corporate farming in the United States, concluding that the meat and vegetables produced by agribusiness have many hidden costs and are unhealthy and environmentally-harmful. The film is narrated by Michael Pollan and Eric Schlosser. The documentary generated extensive controversy in that it was heavily criticized by large American corporations engaged in industrial food production.\n\nThe film's first segment examines the industrial production of meat (chicken, beef, and pork), calling it inhumane and economically and environmentally unsustainable. The second segment looks at the industrial production of grains and vegetables (primarily corn and soy beans), labelling this economically and environmentally unsustainable. The film's third and final segment is about the economic and legal power of the major food companies, such as food libel laws, whose livelihoods are based on supplying cheap but contaminated food, the heavy use of petroleum-based chemicals (largely pesticides and fertilizers), and the promotion of unhealthy food consumption habits by the American public.","torrent":{"xt":"urn:btih:208998aad058659b524ff4fd71204112f68c9fa5","amp;dn":"Food+Inc.+%5BTheora%5D+720p","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"208998aad058659b524ff4fd71204112f68c9fa5","infoHashBuffer":{"type":"Buffer","data":[32,137,152,170,208,88,101,155,82,79,244,253,113,32,65,18,246,140,159,165]},"announce":[],"urlList":[]}}