{"title":"Joshua.2007.iTALiA.LiMiTED.DVDRip.XviD-Rebels[volpebianca]","uid":4956870,"size":1464449024,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:20ebca7d57969ac9a22a05ebe4c707832afb49b3&amp;dn=Joshua.2007.iTALiA.LiMiTED.DVDRip.XviD-Rebels%5Bvolpebianca%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Volpebianca","files":2,"time":1245111586,"description":":::Scheda del film:::\nTitolo originale: Joshua\nNazionalitÃƒÂ : USA\nAnno: 2007  \nGenere: Thriller\nRegia: George Ratliff\nData di uscita: 11 Luglio 2008 (cinema)\nCast: Sam Rockwell, Vera Farmiga, Celia Weston, Dallas Roberts, Linda Larkin, Michael McKean, Nancy Giles, Patrick Henney, Jodie Markell, Kirby Mitchell, Randy Ryan, Alex Draper, Stephanie Roth Haberle\n\n:::Trama:::\n\nIn uno sbalorditivo appartamento dell'Upper East Side a Manhattan, i genitori apparentemente perfetti Brad e Abby Cairn (Sam Rockwell e Vera Farmiga) festeggiano la nascita della loro seconda figlia, Lily. La bambina ÃƒÂ¨ circondata dall'amore, dai giocattoli, da un affezionatissimo zio (Dallas Roberts) e da una premurosa nonna (Celia Weston). E poi c'ÃƒÂ¨ il fratello Joshua di nove anni (Jacob Kogan). Joshua non ÃƒÂ¨ un bambino comune. ÃƒË† eccezionalmente intelligente e spaventosamente precoce. Ha una gentilezza angelica e un atteggiamento disinvolto che smentiscono la giovane etÃƒÂ . E ora appare sempre piÃƒÂ¹ scontento della piega che ha preso la vita, con i genitori visibilmente pazzi di Lily, mentre lui ÃƒÂ¨ in un angolo a suonare quietamente il pianoforte. Man mano che l'atmosfera nell'appartamento dei Cairn si incupisce, la superficie della loro vita laccata inizia a incrinarsi. Lily piange incessantemente e i lavori di ristrutturazione al piano superiore spingono Abby verso quello che potrebbe essere un brutto caso di psicosi post-partum. Stressati fin quasi al limite e non riuscendo piÃƒÂ¹ a dormire, Brad e Abby si trovano invischiati in una spirale crescente di terrore domestico. Ma qual ÃƒÂ¨ la causa del loro tormento? ÃƒË† solo una serie di spaventose coincidenze o i due sono vittime di una mente di inimmaginabile malvagitÃƒÂ ? Non potrebbe essere Joshua che, come l'omonimo biblico, sta facendo crollare la casa intorno ai suoi genitori?\n\n\nQualitÃƒÂ  audio e video Ottima da DVD.","torrent":{"xt":"urn:btih:20ebca7d57969ac9a22a05ebe4c707832afb49b3","amp;dn":"Joshua.2007.iTALiA.LiMiTED.DVDRip.XviD-Rebels%5Bvolpebianca%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"20ebca7d57969ac9a22a05ebe4c707832afb49b3","infoHashBuffer":{"type":"Buffer","data":[32,235,202,125,87,150,154,201,162,42,5,235,228,199,7,131,42,251,73,179]},"announce":[],"urlList":[]}}