{"title":"iOS Hacker's Handbook","uid":7329730,"size":7239087,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:20f8d6c15cb32a75b0cc2b62b0f12a711d548278&amp;dn=iOS+Hacker%27s+Handbook+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"powerofthefive","files":1,"time":1338875199,"description":"iOS is Apple's mobile operating system for the iPhone and iPad. With the introduction of iOS5, many security issues have come to light. This book explains and discusses them all. The award-winning author team, experts in Mac and iOS security, examines the vulnerabilities and the internals of iOS to show how attacks can be mitigated. The book explains how the operating system works, its overall security architecture, and the security risks associated with it, as well as exploits, rootkits, and other payloads developed for it.\n\nBy- Charlie Miller (Author), Dion Blazakis (Author), Dino DaiZovi (Author), Stefan Esser (Author), Vincenzo Iozzo (Author), Ralf-Philipp Weinmann (Author)\n\n-Covers iOS security architecture, vulnerability hunting, exploit writing, and how iOS jailbreaks work\n-Explores iOS enterprise and encryption, code signing and memory protection, sandboxing, iPhone fuzzing, exploitation, ROP payloads, and baseband attacks\n-Also examines kernel debugging and exploitation\n-Companion website includes source code and tools to facilitate your efforts\niOS Hacker's Handbook arms you with the tools needed to identify, understand, and foil iOS attacks.","torrent":{"xt":"urn:btih:20f8d6c15cb32a75b0cc2b62b0f12a711d548278","amp;dn":"iOS+Hacker%27s+Handbook+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"20f8d6c15cb32a75b0cc2b62b0f12a711d548278","infoHashBuffer":{"type":"Buffer","data":[32,248,214,193,92,179,42,117,176,204,43,98,176,241,42,113,29,84,130,120]},"announce":[],"urlList":[]}}