{"title":"Effective Oracle by Design","uid":4726463,"size":55917813,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:212e6f5397a7714fe78929e3058dc534a400cb2b&amp;dn=Effective+Oracle+by+Design&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"VasiaZozulia","files":1,"time":1234784253,"description":"Streamline Application Development with Help from an Oracle Expert\n\nOracle guru Tom Kyte has written the definitive guide to designing and building high-performance, scalable Oracle applications. Providing detailed code examples throughout, Tom teaches proactive and efficient methods to develop and tune Oracle applications that fully exploit the database. You'll learn how to maximize the built-in functionality of the tools you're using in order to achieve the best results possible. From the exclusive publisher of Oracle Press books, this is a must-have resource for all Oracle developers and DBAs.\n\n* Use SQL*Plus, TKPROF, STATSPACK, JDeveloper, and other tools\n* Take advantage of Oracle's scalable architectural implementations\n* Handle administration with SPFILES, Oracle Managed Files, and Automatic Segment Space Management\n* Use archivelog mode, RMAN, and Data Guard for bulletproof backup and recovery\n* Improve statement processing by using bind variables and reducing parsing\n* Make full use of the Cost Based Optimizer (CBO)\n* Choose data structures that result in effectively designed schemas\n* Write efficient SQL statements and high-performance PL/SQL code\n* Learn invaluable techniques from an Oracle insider ","torrent":{"xt":"urn:btih:212e6f5397a7714fe78929e3058dc534a400cb2b","amp;dn":"Effective+Oracle+by+Design","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"212e6f5397a7714fe78929e3058dc534a400cb2b","infoHashBuffer":{"type":"Buffer","data":[33,46,111,83,151,167,113,79,231,137,41,227,5,141,197,52,164,0,203,43]},"announce":[],"urlList":[]}}