{"title":"First Aid for the USMLE Step I","uid":5781698,"size":45987500,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2154062f924f7383e29857d949d1202a77947220&amp;dn=First+Aid+for+the+USMLE+Step+I&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Raryn","files":2,"time":1282435828,"description":"First Aid for the USMLE Step I 2010\n\nThis is not a scan of a physical copy, it is a real ebook with the DRM stripped off. Fully searchable copy with perfect text recognition.\n\nProduct Description\n The 20th edition of the world-s #1 selling medical review book!   Trust two decades of experience for the most effective USMLE Step 1 preparation possible   1100+ must-know facts and mnemonics organized by organ system and general principles  Hundreds of high-yield clinical images you need to know before the exam - including 24 pages of full-color photos  Rapid review section for last minute cramming  Ratings of 300+ top review products based on the authors- annual survey of US medical students  Updated test-taking advice from students who aced the 2009 exam Strategies that maximize your study time and deliver real results  INSIDER ADVICE FOR STUDENTS  FROM STUDENTS.\n\nAbout the Author\nTao Le, MD, MHS is Assistant Clinical Professor of Medicine and Pediatrics and Chief of the Division of Allergy and Immunology in the Department of Medicine at the University of Louisville.\nVikas Bhushan, MD is a practicing diagnostic radiologist based in Los Angeles, California.\nNeil Vasan is in the Medical Scientist Training Program at Yale University in New Haven, CT.","torrent":{"xt":"urn:btih:2154062f924f7383e29857d949d1202a77947220","amp;dn":"First+Aid+for+the+USMLE+Step+I","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2154062f924f7383e29857d949d1202a77947220","infoHashBuffer":{"type":"Buffer","data":[33,84,6,47,146,79,115,131,226,152,87,217,73,209,32,42,119,148,114,32]},"announce":[],"urlList":[]}}