{"title":"Understanding Cement , Nick Winter of WHD Microanalysis","uid":12530882,"size":6997442,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:217d57bebf14464c879fd87bc05b8e99b1d11595&amp;dn=Understanding+Cement+%2C+Nick+Winter+of+WHD+Microanalysis&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"heliiaruy","files":1,"time":1444256984,"description":"Pdf file\r\npublished: 2009 (ebook)\r\n\r\n  From the author's website:::::\r\n\r\n  Gives the essentials of how cement is made and what happens when you use it in concrete or mortar.\r\n\r\n    Shows you how to look at cementitious systems and understand how they work, eg: why adding slag to a mix may be beneficial, or what happens when you change the water-cement ratio.\r\n\r\n    Provides a structured system - a &quot;mental map&quot; if you like - into which you can &quot;plug&quot; all your cement knowledge, including what you know already, what you learn from this book and what you learn in the future.\r\n\r\n    Once you really &quot;get&quot; this structured system, you can predict how vital factors such as strength or resistance to deleterious processes are likely to alter with changes to the mix.\r\n\r\n    Unlike a normal textbook that just throws a lot of facts at you that you then have to remember, the structured system that this book encourages you to develop helps you retain your knowledge, because it all fits together.\r\n\r\n    Based on my 26 years' experience of providing cement-related consulting to clients in the various parts of the construction industry, this book contains what almost all of them need to know (and most of them do - now!). No fluff, no academic irrelevancies, just the facts.\r\n\r\n    Written in an informal style that is easy to read. This is really important if normal &quot;heavy duty&quot; textbooks just send you to sleep, or (as is the case for perhaps a third of those who have already purchased it) if English is not your first language.\r\n                            :::::::::::::::::\r\n\r\n h e l     i  i   aru          y y u               r       a i i     l e         h","torrent":{"xt":"urn:btih:217d57bebf14464c879fd87bc05b8e99b1d11595","amp;dn":"Understanding+Cement+%2C+Nick+Winter+of+WHD+Microanalysis","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"217d57bebf14464c879fd87bc05b8e99b1d11595","infoHashBuffer":{"type":"Buffer","data":[33,125,87,190,191,20,70,76,135,159,216,123,192,91,142,153,177,209,21,149]},"announce":[],"urlList":[]}}