{"title":"The Ultimate Quotable Einstein","uid":6696898,"size":1337710,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:21c5b598e674cea9ed84af5cdf7086fd04499272&amp;dn=The+Ultimate+Quotable+Einstein&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"neil1966hardy","files":2,"time":1316818111,"description":"Here is the definitive new edition of the hugely popular collection of Einstein quotations that has sold tens of thousands of copies worldwide and been translated into twenty-five languages. The Ultimate Quotable Einstein features 400 additional quotes, bringing the total to roughly 1,600 in all. This ultimate edition includes new sections--&quot;On and to Children,&quot; &quot;On Race and Prejudice,&quot; and &quot;Einstein's Verses: A Small Selection&quot;--as well as a chronology of Einstein's life and accomplishments, Freeman Dyson's authoritative foreword, and new commentary by Alice Calaprice. In The Ultimate Quotable Einstein, readers will also find quotes by others about Einstein along with quotes attributed to him. Every quotation in this informative and entertaining collection is fully documented, and Calaprice has carefully selected new photographs and cartoons to introduce each section.Features 400 additional quotations Contains roughly 1,600 quotations in all Includes new sections on children, race and prejudice, and Einstein's poetry Provides new commentary Beautifully illustrated The most comprehensive collection of Einstein quotes ever published\n\nPrinceton University Press\n2011\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:21c5b598e674cea9ed84af5cdf7086fd04499272","amp;dn":"The+Ultimate+Quotable+Einstein","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"21c5b598e674cea9ed84af5cdf7086fd04499272","infoHashBuffer":{"type":"Buffer","data":[33,197,181,152,230,116,206,169,237,132,175,92,223,112,134,253,4,73,146,114]},"announce":[],"urlList":[]}}