{"title":"AFRICA - Sierra Leone - Musiques Traditionelles","uid":4428230,"size":72225532,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:2256305bc341e5fcc3db00d6541d231e8d7ae8c8&amp;dn=AFRICA+-+Sierra+Leone+-+Musiques+Traditionelles&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"starinar","files":12,"time":1223145897,"description":"CLICK ON starinar TO GET MORE TRIBAL AND INDIGENOUS MUSIC. \nBE A MEMBER OF A GLOBAL SeeDeRS TRIBE. MoRE CoMING SooN. ENJoY! \n\n\nSierra Leone - Musiques Traditionelles \n\n1. Chant de louange avec petit luth et choeur de voix a bouche fermÃƒÆ’Ã‚Â©e \n2. Chant de louanges avec guitare et voix (Femme) \n3. Solo de flute foula \n4. Tambours temnÃƒÆ’Ã‚Â© (SociÃƒÆ’Ã‚Â©tÃƒÆ’Ã‚Â© insourou) \n5. Chanteur de louanges avec harpe en calebasse \n6. Filles mandingo, hymne chrÃƒÆ’Ã‚Â©tien \n7. Xylophones karanko \n8. Tambours limba \n9. Femmes mendÃƒÆ’Ã‚Â©, (SociÃƒÆ’Ã‚Â©tÃƒÆ’Ã‚Â© boundou) \n\nRecorded 1976/77 \n\n\nThe traditions of the Fula griots and the Mende, Themne, Limba and \nKaranko drums, compose the present musical panorama. \n\n\nThe first track is 10 minutes of a man singing, occasionally joined by \nanother male singer, over a drone of repeated chords on an instrument \nthat sounds much like a ukelele. The second track consists of a woman \nsinging a somewhat more interesting line over an equally repetitious \naccompaniment played by what the notes identify as three guitars; but \nwhose most notable characteristic for European trained ears is their \nnon-Western standard tuning and tone color--rather restricted in upper \novertones (dull) by our standards. The third track is a nine minute solo \non a three holed flute; the construction of the piece results from the \nimmediate repetition several times in succession of very small \nfragments--4, 5, or 6 note fragments. Track 4 is a village chant/dance, \nwith drums, rattles and cowbells in a style that may well be familiar \nto anyone who has had a slight exposure to 'traditional African village music'. \nTrack 5 is rather similar in nature, but with lutes, and not the best \nrecording quality. Track 6 is a Christian Hymn sung by two schoolgirls. \nTrack 7 is a xylophone and chant track; track 8 more chanting with drums \nand cowbells, very repetitious; track 8 is women singing with a rattle. \nThere is a nice variety of instruments and styles; but not one track stands \nout as particularly fascinating. The collection demonstrates how different \nAfrican and European music and aesthetics are; jazz, blues, and the like \nnotwithstanding. \n\nQuality: 192Kbps","torrent":{"xt":"urn:btih:2256305bc341e5fcc3db00d6541d231e8d7ae8c8","amp;dn":"AFRICA+-+Sierra+Leone+-+Musiques+Traditionelles","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2256305bc341e5fcc3db00d6541d231e8d7ae8c8","infoHashBuffer":{"type":"Buffer","data":[34,86,48,91,195,65,229,252,195,219,0,214,84,29,35,30,141,122,232,200]},"announce":[],"urlList":[]}}