{"title":"Chemical Oceanography and the Marine Carbon Cycle","uid":14522056,"size":26057781,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:22727d70f26e1af41678175e457afe7e52d2d8c4&amp;dn=Chemical+Oceanography+and+the+Marine+Carbon+Cycle&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1462399290,"description":"Chemical Oceanography and the Marine Carbon Cycle - S. R. Emerson and J. I. Hedges (CUP, 2008).pdf\r\n\r\nISBN 978-0-521-83313-4\r\n\r\nThe principles of chemical oceanography provide insight into the processes regulating the marine carbon cycle. The text offers a background in chemical oceanography and a description of how chemical elements in seawater and ocean sediments are used as tracers of physical, biological, chemical and geological processes in the ocean. The first seven chapters present basic topics of thermodynamics, isotope systematics and carbonate chemistry, and explain the influence of life on ocean chemistry and how it has evolved in the recent (glacial-interglacial) past. This is followed by topics essential to understanding the carbon cycle, including organic geochemistry, air-sea gas exchange, diffusion and reaction kinetics, the marine and atmosphere carbon cycle and diagenesis in marine sediments. Figures are available to download from www.cambridge.org/9780521833134. Ideal as a textbook for upper-level undergraduates and graduates in oceanography, environmental chemistry, geochemistry and earth science and a valuable reference for researchers in oceanography","torrent":{"xt":"urn:btih:22727d70f26e1af41678175e457afe7e52d2d8c4","amp;dn":"Chemical+Oceanography+and+the+Marine+Carbon+Cycle","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"22727d70f26e1af41678175e457afe7e52d2d8c4","infoHashBuffer":{"type":"Buffer","data":[34,114,125,112,242,110,26,244,22,120,23,94,69,122,254,126,82,210,216,196]},"announce":[],"urlList":[]}}