{"title":"Dark.Souls.II.XBOX360-iMARS","uid":9715391,"size":6847283803,"categoryP":"games","categoryS":"xbox360","magnet":"?xt=urn:btih:229a9d131f61ca088f06a28519c027f09a4d4419&amp;dn=Dark.Souls.II.XBOX360-iMARS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"razalgul1979","files":-1,"time":1394152277,"description":"Face the challenge once again in this sequel to the hardcore action RPG. Dark Souls II features a new hero, a new storyline, and an unfamiliar world for players to survive in while delivering its signature brand of unrelenting punishment that players hunger for. Epic battles with gruesome enemies and blood-thirsty bosses await adventurers as they traverse through a devastated world filled with death and despair; only those who are strong willed or cunning can survive this journey to achieve great glory. Players seeking to share their experience will discover a revamped server-based multiplayer mode that puts a distinct Dark Souls II twist on the concept of playing with others.\n\nRelease Date: March 11, 2014\nT for Teen: Blood and Gore, Mild Language, Partial Nudity, Violence\nGenre: Action\nPublisher: Bandai Namco Games\nDeveloper: FromSoftware\n\n*Dare yourself to engage against intense gameplay in a vast world powered by a new engine.\n\n*Immerse yourself into mind-bending environments filled with twisted monsters and deadly bosses.\n\n*A wide range of threats will prey on human senses and phobias--auditory hallucinations, vertigo, acrophobia, etc.\n\n*More intricate customization options provide weapons and armor tailoring to player style.\n\n*An updated multiplayer system enables improved online interaction to bring forward cooperative and competitive play.\n\n*Dark Souls II features fluid motion-capture animations, an upgraded combat system, a vastly expanded suite of characters, deeper customization options, new weapons, new armor abilities, and a balanced player progression system.\n\nGame Details:\n\nTitle.............:    Dark Souls II\nRetail Date.......:    11/03/14                             \nPlatform..........:    XBOX360                                     \nRegion............:    RF\nGenre.............:    Role-Playing","torrent":{"xt":"urn:btih:229a9d131f61ca088f06a28519c027f09a4d4419","amp;dn":"Dark.Souls.II.XBOX360-iMARS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"229a9d131f61ca088f06a28519c027f09a4d4419","infoHashBuffer":{"type":"Buffer","data":[34,154,157,19,31,97,202,8,143,6,162,133,25,192,39,240,154,77,68,25]},"announce":[],"urlList":[]}}