{"title":"Habib Koite &amp; Bamada. 'Afriki'","uid":4100804,"size":44477460,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:229e1908bb6744b11a95bf3d62f4232cea351f9b&amp;dn=Habib+Koite+%26+Bamada.+%5C%27Afriki%5C%27&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"nimbulus","files":11,"time":1206567669,"description":"Track List\n1. Namania   \n2. N&amp;#039;tesse  \n3. Africa  \n4. Fimani  \n5. N&amp;#039;ba  \n6. Mali Ba    \n7. Barra    \n8. N&amp;#039;Teri    \n9. Nta Dima \n10. Massake  \n11. Titati\n\n  Album Description\nAfrica&amp;#039;s Musical Ambassador releases first studio album in six years. \nAfter a six-year absence from the recording studio, Malian guitarist Habib Koite and his band Bamada return with a stunning new album, &amp;#039;Afriki&amp;#039;. With more than 250,000 albums sold around the globe, an appearance on the popular television show Late Night with David Letterman, a duet with Bonnie Raitt on her 2002 album Silver Lining and nearly a thousand concerts on some of the world&amp;#039;s most prestigious stages under his belt, Habib Koite is one of Africa&amp;#039;s most beloved and popular musicians. Afriki features an appealing set of songs that reflect Habib&amp;#039;s unique and innovative approach to the diverse styles of Malian music. \nFew African artists have received the sales and media exposure of Habib Koite. Called &quot;Mali&amp;#039;s biggest pop star&quot; by Rolling Stone (in an infamous article in which Bonnie Raitt compared Habib to Jimi Hendrix and Stevie Ray Vaughn), Habib has also received raves from widely-read publications such as People, Entertainment Weekly and the New York Times. Just this June, Habib graced a 2-page photo spread in the pages of Vanity Fair magazine. While sales of African music CDs generally struggle to break the 10,000-unit mark, Habib has defied expectations by selling more than 100,000 copies of his last two studio albums, putting him in the upper echelons of world music artist sales. \n&amp;#039;Afriki&amp;#039; emphasizes a tight acoustic sound, showcasing some little-heard traditional instruments such as polyphonic hunter&amp;#039;s horns, alongside balafÃƒÂ³n (wooden xylophone), n&amp;#039;goni (a Malian lute) and Habib&amp;#039;s iconic voice and guitar. &quot;I want to open a small window to the new generation,&quot; explains Habib regarding his use of Malian folk instruments, &quot;to help them hear our old traditions even if it is in new music.&quot; \n\n","torrent":{"xt":"urn:btih:229e1908bb6744b11a95bf3d62f4232cea351f9b","amp;dn":"Habib+Koite+%26+Bamada.+%5C%27Afriki%5C%27","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"229e1908bb6744b11a95bf3d62f4232cea351f9b","infoHashBuffer":{"type":"Buffer","data":[34,158,25,8,187,103,68,177,26,149,191,61,98,244,35,44,234,53,31,155]},"announce":[],"urlList":[]}}