{"title":"Databook of Green Solvents - Anna &amp; ‎George Wypych","uid":14417858,"size":3659062,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:248a5e19e0815fd1b20dfc4b4e8b5ea86459842b&amp;dn=Databook+of+Green+Solvents+-+Anna+%26amp%3B+%26lrm%3BGeorge+Wypych&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1461509643,"description":"Databook of Green Solvents - Anna &amp; ‎George Wypych (ChemTec, 2014).pdf\r\n\r\nISBN 978-1-895198-82-9\r\n\r\nSolvents have a major role to play in the environmental and sustainability agenda, and many currently used solvents have to be replaced, either because of regulations or because of increasing demands for safer solvents and produce them in safer way. Some solvents previously advertised as green solvents have to be replaced according to the present regulations, and these are costly and risky operations.\r\n\r\nThis book not only gives data on carefully selected, commercially available, green solvents but it also gives expert advice on how to assess and qualify green solvents. Physical properties are included, as are health and safety considerations (such as carcinogenicity, reproduction/developmental toxicity, flammability) and first aid guidance. Emphasis is given in particular to cost-saving and more efficient replacements for more toxic solvents.\r\n\r\nDetailed information is also given for usage considerations, including outstanding properties, potential substitutes, features and benefits for each solvent and for which products the solvent is recommended.\r\n\r\nMore than 300 green solvents included, from biodegradable and biorenewable solvents to siloxanes and perfluorocarbons.\r\nPractical information for use in the lab and the field, including recommended processing methods, recommended dosages, and potential substitutes\r\nProvides critical health, safety, and environmental data, to help production chemists and engineers in selecting the correct solvent","torrent":{"xt":"urn:btih:248a5e19e0815fd1b20dfc4b4e8b5ea86459842b","amp;dn":"Databook+of+Green+Solvents+-+Anna+%26amp%3B+%26lrm%3BGeorge+Wypych","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"248a5e19e0815fd1b20dfc4b4e8b5ea86459842b","infoHashBuffer":{"type":"Buffer","data":[36,138,94,25,224,129,95,209,178,13,252,75,78,139,94,168,100,89,132,43]},"announce":[],"urlList":[]}}