{"title":"Terror in a Texas Town 1958 DvdRip Mp4 Lee1001","uid":10368451,"size":656883354,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:24d74afad39fac4cbab3b427221d02344e1dbfff&amp;dn=Terror+in+a+Texas+Town+1958+DvdRip+Mp4+Lee1001&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"xultfoad","files":2,"time":1402896178,"description":"Terror in a Texas Town 1958 DvdRip Mp4 Lee1001\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0052287/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0052287/&lt;/a&gt; &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Terror_in_a_Texas_Tow&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Terror_in_a_Texas_Tow&lt;/a&gt;\nThis near-legendary western stars Sterling Hayden as George Hanson, the son of a Swedish seaman-turned-farmer. When he runs afoul of town boss Ed McNeil, Hanson's father is gunned down by McNeil's henchman Johnny Crale. Knowing full well that he can expect no help from the town's corrupt sheriff, Hanson takes matters in his own hands. Tension mounts steadily until the unforgettable climactic showdown, wherein Hanson arms himself with a harpoon! Extremely well written by Ben L. Perry, Terror in a Texas Town was the last directorial effort of cult favourite Joseph H. Lewis.\n\nCult offering from director Lewis that makes the most of its spare and uncompromising style and delivers one of the most exciting westerns of the period. It may not have the sets, extras or even the guns (whaling harpoons, yes), but this tale of corruption and revenge with Hayden as the harpoon-wielding hero who takes the law into his own hands is tightly scripted by Perry.\n\nI don't know that there is a better way to start a film, western or not, than Joseph E. Lewis' Terror in a Texas Town (the director's last feature production). The noble music informs us of an impending conflict and we see a tall blonde man (soon recognized as Sterling Hayden) marching down the center of an old west main street. Behind him an interested mob follows at a safe distance. Wait - the blonde man is caring something on his shoulder - a rifle? - no - too large. Strange - it looks like... a whaling harpoon?! His unseen nemesis is now facing him - his back to us... taunting, and his gun and holster are easily accessible on his hip. \n\nThis low budget masterpiece achieves cult status with morally pigeon-holed, one dimensional characters and enough western conventions to approach a caricature parody... but it easily ranks as the greatest B-western of all time. The sparse exteriors were a function of the budgetary constraints but fit perfectly for the rigid and sparse stylistic composition. A typical western tale of corruption and revenge - one could only imagine how a more extensive and polished financial production would have ill-fit the atmospheric script by Dalton Trumbo (not Ben Perry) and B-master Lewis' uncompromising style that approaches an Ophuls-like exaggeration. One of the genre's best hidden gems.\n\nVIDEO\nSize.... 626mb\nDuration.... 01:17:38\nCodec.... avc1\nFrame Width..... 640\nFrame Height.... 352\nData Rate.... 1005kbps\nFrame Rate.... 25F/S\nAUDIO\nBit Rate.... 118kbps\n2 Channel Stereo\nAudio Sample Rate.... 48 KHz\nBits Per Sample 16 Bit/Sample","torrent":{"xt":"urn:btih:24d74afad39fac4cbab3b427221d02344e1dbfff","amp;dn":"Terror+in+a+Texas+Town+1958+DvdRip+Mp4+Lee1001","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"24d74afad39fac4cbab3b427221d02344e1dbfff","infoHashBuffer":{"type":"Buffer","data":[36,215,74,250,211,159,172,76,186,179,180,39,34,29,2,52,78,29,191,255]},"announce":[],"urlList":[]}}