{"title":"SPY GAME 2001 DVD Rip XVID by vladtepes3176.avi","uid":5300935,"size":734341120,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:255db2a0fd68c2798b3dcdb07eaacc983804515f&amp;dn=SPY+GAME+2001+DVD+Rip+XVID+by+vladtepes3176.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"vladtepes3176","files":-1,"time":1264219643,"description":"This is an Excellent DVD rip to XVID at 700MB of SPY GAME 2001. (I follow a guide to rip like AXXO (PAKG) when I rip and convert (PAKG)) I am proud of the rip and invite any comments. \n\nPreviously I had downloaded the other popular torrent of this same film:http://thepiratebay.se/torrent/4546083/Spy_Game_Collector_s_Edition_2001_DvDrip[Eng]-greenbud1969 I thought it was a great copy. But I saw the DVD a few weeks later in the store and bought it and decided to rip it (like AXXO) at 700MB. \n\nAt this time in history when great torrents sites are being shut down, and people's great work like AXXO  are being being targeted I feel it is very important to have more than one popular source for upload. That's why I riped this great film!\n\nI have a fast Fiber connection and am seeding all the time, so PLEASE download and SEED so this can spread!\n\nSpy Game is by far one of Tony Scott's great works. He's done some shit recently but this film is genius. \n\nENJOY and PLEASE SEED\nTHANKS \nby vladtepes3170\n\nDirected by Tony Scott Staring: Bard Pitt and Robert Redford\n\nPLOT:CIA operative Nathan Muir (Redford) is on the brink of retirement when he finds out that his protege Tom Bishop (Pitt) has been arrested in China for espionage. No stranger to the machinations of the CIA's top echelon, Muir hones all his skills and irreverent manner in order to find a way to free Bishop. As he embarks on his mission to free Bishop, Muir recalls how he recruited and trained the young rookie, at that time a sergeant in Vietnam, their turbulent times together as operatives and the woman who threatened their friendship\n\nGreat story that's never really been done like this. A wild look into the world of being a spy.\n\nSEED and help this spread like chlamydia\n\nI have ripped several films now and will start taking requests as I have a lot of time on my hand for the next few month. I will post other DVD possibility's soon\n\nTnks \n\nPlease Seed","torrent":{"xt":"urn:btih:255db2a0fd68c2798b3dcdb07eaacc983804515f","amp;dn":"SPY+GAME+2001+DVD+Rip+XVID+by+vladtepes3176.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"255db2a0fd68c2798b3dcdb07eaacc983804515f","infoHashBuffer":{"type":"Buffer","data":[37,93,178,160,253,104,194,121,139,61,205,176,126,170,204,152,56,4,81,95]},"announce":[],"urlList":[]}}