{"title":"Believing Bible Study - Dr. Edward F. Hills","uid":11773631,"size":1327527,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:28f0bdb688674fb3c8ffa459fcce1a7f04e5492c&amp;dn=Believing+Bible+Study+-+Dr.+Edward+F.+Hills&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"starxteel","files":1,"time":1427178941,"description":"God reveals himself in the world which He has created and also in the Holy scriptures which He has preserved down through the ages in the usage of His church. The purpose of this book is to promote the Christian world-view, which acknowledges and receives this divine revelation, and to oppose the neutral world-view, which ignores God and regards the world and the Bible as mere existing things.\n\nThis book has for the most part been used to defend the legitimacy of having a Bible based on God's promise to preserve His word(s). Also this book is a secondary to his even more popular book &quot;The King James Version Defended&quot;.\n\n\nAbout the author:\nEdward Freer Hills (1912-1981) was born and raised in Oak Park, Illinois. After graduating from high school he attended Yale University where he excelled in the Latin classics and was a Phi Beta Kappa graduating summa cum laude in 1938. From Yale he entered Westminster Seminary in Philadelphia where he studied under the famous J. Grescham Machen and other well known scholars.\n\nUnder the tutelage of Dr. N. B. Stonehouse, he was introduced to the new Greek New Testament of Westcott and Hort, Greek rival of the old Textus Receptus. Hills became exceedingly troubled concerning the significant differences between the two Greek texts. Had not God inspired His Word? Had not God promised to preserve it?&quot; How could this newly edited 19th century text displace the one used for centuries by the Church?\n\nIn this same class, however, he also learned that among scholars in England there had been one loud, dissenting voice to this newly praised text, John William Burgon, an Oxford scholar who had opposed Westcott and Hort in the revision committee. Unfamiliar with this name, Hills wondered, &quot;Who was this Burgon and what was his vociferous objection? He determined to study this issue himself.\n\nAfter he obtained the Th.B. Degree from Westminster, he studied at Columbia Seminary in Atlanta, Georgia where he earned the Th.M. From there he studied at the University of Chicago for two years and transferred to Harvard University where he earned his Th.D. in New Testament text criticism. His years of intense research have resulted in two significant books: The King James Version Defended and Believing Bible Study. Edward F. Hills has been called the Father of the 20th century renewal of the Textus Receptus.\n\nAs to the relationship of the King James Bible to the Received Text, Hills wrote &quot;the King James Version ought to be regarded not merely as a translation of the Textus Receptus but also as an independent variety of the Textus Receptus.&quot; Indeed, the perfect one","torrent":{"xt":"urn:btih:28f0bdb688674fb3c8ffa459fcce1a7f04e5492c","amp;dn":"Believing+Bible+Study+-+Dr.+Edward+F.+Hills","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"28f0bdb688674fb3c8ffa459fcce1a7f04e5492c","infoHashBuffer":{"type":"Buffer","data":[40,240,189,182,136,103,79,179,200,255,164,89,252,206,26,127,4,229,73,44]},"announce":[],"urlList":[]}}