{"title":"Pop (2009) (The Priest) DvdRip Avi Xvid HQ","uid":7228103,"size":1669838258,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:295e12978f0ca863fbbe17ec6cf614c5d526b2ac&amp;dn=Pop+%282009%29+%28The+Priest%29+DvdRip+Avi+Xvid+HQ&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"TECHiO","files":-1,"time":1335742705,"description":"Set in Russia and based on the true story happened during WWII. Father Alexander (Makovetsky) is making every effort to maintain peaceful life for his church during the Nazi occupation. His mission is to survive through the deadly war and save the civilians. But he is only a human...\n\n\n&quot;The Priest&quot; is another great movie by Vladimir Khotinenko, the maker of &quot;Ostrov&quot;: &quot;The Island&quot;. Strong emotions, living culture, and this excellent piece of work can describe the facts that this movie was based on. A movie that everyone must see.\n\nThe file uploaded is the avi version of the -so far- uploaded ISO, ripped with High Quality settings. Brought to you by TECHiO.\nBitrate (kbps): 1609 v / 192 a / 1801 total.\nResolution: 720x404.\n\n\nReview (IMDB):\nIts a real creation of Art! Film impressed me a lot. I'm an actor and in 90% of films I see how good or bad was made editors work, I think about how bad or good was play of actors etc... When I watched this film I forget that picture on a screen is &quot;just a play&quot; - everything was More Real than ANY 3-d or &quot;23-d&quot;... In some moments I cry... I don't remember when I cry because of film... &quot;Pop&quot; is the one of the greatest films I ever seen...I can't believe that I communicated with the person which played Father Alexander... It's some magic when some (even a little bit, but familiar) person turns Role into Real Person! I know that Makovetsky is an actor but at this film he is more Real Priest than some Priests in Churches... Makovetsky is one of the Greatest actors today and may be here is the best his role... Soon I will watch this film again because it touches my heart... - by Dmitriy Zheleznyak","torrent":{"xt":"urn:btih:295e12978f0ca863fbbe17ec6cf614c5d526b2ac","amp;dn":"Pop+%282009%29+%28The+Priest%29+DvdRip+Avi+Xvid+HQ","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"295e12978f0ca863fbbe17ec6cf614c5d526b2ac","infoHashBuffer":{"type":"Buffer","data":[41,94,18,151,143,12,168,99,251,190,23,236,108,246,20,197,213,38,178,172]},"announce":[],"urlList":[]}}