{"title":"Microsoft Office 2007 (FULL EDITION)","uid":4241864,"size":522681146,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:29de8b1441434056f0f684253546aaa1cfcef327&amp;dn=Microsoft+Office+2007+%28FULL+EDITION%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"MemiBH","files":1,"time":1213584206,"description":"Microsoft Office 2007\n\nMicrosoft Office 2007 (officially called 2007 Microsoft Office system) is the most recent version for Windows of the Microsoft Office system, Microsoft&amp;#039;s productivity suite. Formerly known as Office 12 in the initial stages of its beta cycle, it was released to volume license customers on November 30, 2006[1] and made available to retail customers on January 30, 2007. These are, respectively, the same dates Windows Vista was released to volume licensing and retail customers. Office 2007 contains a number of new features, the most notable of which is the entirely new graphical user interface called the Fluent User Interface[2] (initially referred to as the Ribbon UI), replacing the menus and toolbars that have been the cornerstone of Office since its inception, by a tabbed toolbar, known as the Ribbon. Office 2007 requires Windows XP with Service Pack 2 or 3, Windows Server 2003 with Service Pack 1 or higher, or Windows Vista.[3]\n\nOffice 2007 also includes new applications and server-side tools. Chief among these is Groove, a collaboration and communication suite for smaller businesses, which was originally developed by Groove Networks before being acquired by Microsoft in 2005. Also included is Office SharePoint Server 2007, a major revision to the server platform for Office applications, which supports &quot;Excel Services&quot;, a client-server architecture for supporting Excel workbooks that are shared in real time between multiple machines, and are also viewable and editable through a web page.\n\nMicrosoft FrontPage has been removed from the Office suite entirely. It has been replaced by Microsoft Office SharePoint Designer, which is aimed towards development of SharePoint portals. Its designer-oriented counterpart Microsoft Expression Web is targeted for general web development. However, neither application is included in any of the Office suites. Also, since speech recognition and handwriting recognition are now part of Windows Vista, speech and ink components have been removed from Office 2007.[4][5] Handwriting and speech recognition work with Office 2007 only on Windows Vista or Windows XP Tablet PC Edition.","torrent":{"xt":"urn:btih:29de8b1441434056f0f684253546aaa1cfcef327","amp;dn":"Microsoft+Office+2007+%28FULL+EDITION%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"29de8b1441434056f0f684253546aaa1cfcef327","infoHashBuffer":{"type":"Buffer","data":[41,222,139,20,65,67,64,86,240,246,132,37,53,70,170,161,207,206,243,39]},"announce":[],"urlList":[]}}