{"title":"Railworks 4 Southern Pacific GP20","uid":8983751,"size":65099624,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:2a14ec711be24a82db82d96bf4ae07452cd42dff&amp;dn=Railworks+4+Southern+Pacific+GP20&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"tpb_4_ever","files":-1,"time":1380621980,"description":"The second generation EMD GP20 ushered in a new era of turbocharged locomotives on American railroads, and now this 2,000hp heavy freight hauler is available for Train Simulator in Southern Pacific livery. \n\nThe EMD GP20 for Train Simulator, developed by Reppo, is available in Southern Pacific livery and features a highly detailed cab interior with operating switches, advanced and standard driving controls, realistic engine start up procedure, accurately modelled simulation, engine overheating and working unit selector. \n\nThe locomotive is also Quick Drive compatible, giving you the freedom to drive the EMD GP20 on any Quick Drive enabled route for Train Simulator. Also included are scenarios specifically for the Donner Pass route (available separately and required to play these scenarios).\n\n\n\nPlease support the developers and buy some of their content if you can afford it.\n\n\nWe will soon be releasing the full TS2014 Steam Edition which includes an additional seven mile 'Sheerness Branch' line in Kent (London-Faversham High Speed) and two extra locos (Class 466 and SD70M) \n\nJoin our facebook page.\n\nFor questions, help and invitations to RWC message us on facebook.\n\n\nIf you would like to contribute, please read the Readme.pdf.\n\n\nA Team tpb_4_ever upload.","torrent":{"xt":"urn:btih:2a14ec711be24a82db82d96bf4ae07452cd42dff","amp;dn":"Railworks+4+Southern+Pacific+GP20","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2a14ec711be24a82db82d96bf4ae07452cd42dff","infoHashBuffer":{"type":"Buffer","data":[42,20,236,113,27,226,74,130,219,130,217,107,244,174,7,69,44,212,45,255]},"announce":[],"urlList":[]}}