{"title":"1000 Best Wine Secrets {BBS}","uid":6703558,"size":1263624,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2a92b73c2ea681c4d9fd719869c4abb78ac509a4&amp;dn=1000+Best+Wine+Secrets+%7BBBS%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bigbluesea","files":-1,"time":1317071641,"description":"The founder of Wine Tribune, Hammond offers a massive number of breezy oeneophile tips in a compact package. She begins simply, covering basics such as reading labels, food pairings and the logistics of ordering wine in a restaurant. The bulk of the book is devoted to regional styles, and there it really excels. Not only does Hammond cover France, Italy and Spain, she also offers insight into wines from Argentina, the Mediterranean and Switzerland, as well as the intricate classification of &quot;growths&quot; in Bordeaux and the Italian &quot;Supertuscans,&quot; in an easy-to-follow manner. Regional varietals are discussed in detail and recommendations are offered for wines from particular purveyors, often taking budget into account. The format lends itself to reading in small doses, and the overall result is an insightful guide to the world of wine that keeps in mind the novice as well as the experienced wine drinker.\nCopyright Ã‚Â© Reed Business Information, a division of Reed Elsevier Inc. All rights reserved.\nReview\n&quot;...a massive number of breezy oeneophile tips .... an insightful guide to the world of wine ....&quot;\n\n-\n--Publishers Weekly Annex\n\n&quot;This book rocks. The only way to make it better, is if it were to come bundled with the memory to retain all of the wonderful secrets....&quot; --vinokeeno.com\n\n&quot;... fast becoming my favorite little wine book!&quot; --thecrusa.com\n\n&quot;... well worth reading.... I'm sure I will refer back to it time and again.&quot; --Boston Wine Buzz\n\n&quot;... a great gift for someone who wants to casually learn more about wine....read a tip or two each evening and be on your way to swirling and sniffing with the pros.&quot; --drinkthegoodstuff.com\nSee all Editorial Reviews\nProduct Details\n\n    * Paperback: 432 pages\n    * Publisher: Sourcebooks, Inc.; 1 edition (October 1, 2006)\n    * Language: English\n    * ISBN-10: 1402208081\n    * ISBN-13: 978-1402208089","torrent":{"xt":"urn:btih:2a92b73c2ea681c4d9fd719869c4abb78ac509a4","amp;dn":"1000+Best+Wine+Secrets+%7BBBS%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2a92b73c2ea681c4d9fd719869c4abb78ac509a4","infoHashBuffer":{"type":"Buffer","data":[42,146,183,60,46,166,129,196,217,253,113,152,105,196,171,183,138,197,9,164]},"announce":[],"urlList":[]}}