{"title":"VA - A State of Vocal Trance Volume 2","uid":7520711,"size":414055881,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:2a9bcf0e1beba16b6b0c75de9ea0ee1c79dccd6e&amp;dn=VA+-+A+State+of+Vocal+Trance+Volume+2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2infinityGT","files":-1,"time":1344620460,"description":"VA\nA State of Vocal Trance Volume 2\n\nTracklist:\n001. Turn and Natali Kryzhanovski - Broken Dreams (Original Mix)\n002. Dash Berlin feat. Sarah Howells - Go It Alone (Club Mix)\n003. EDX and Nadia Ali - This Is Your Life (Original Club Mix)\n004. Lange and Gareth Emery - This Is All Out (Heatbeat vs. Andy Moor Remix - Lange Mash Up)\n005. Maor Levi - Wont Say No\n006. Rake feat. Natalie Griffiths - Expectation (Original Mix)\n007. Ronski Speed, Stoneface and Terminal - I Didn`t Know I Was Looking For Love (Club Mix)\n008. Store N Forward - Listen To Life (Cressida Remix)\n009. Ellie Lawson - A Hundred Ways (Hazem Beltagui Remix)\n010. Cosmic Gate and JSomething - Over The Rainbow (Jquintel, Jeziel Quintela and Manufactured Superstars Remix)\n011. Fast Distance and Dimension feat. Cami - Promise You (Original Mix)\n012. Fred Numf - Directions (Robert Holland and Iris Dee Jay Remix)\n013. Dennis Sheperd - I Die\n014. Snatt and Vix feat. Neev Kennedy - At The End Of The Day\n015. Headstrong feat. Shelley Harland - Here In The Dark (Aurosonic Progressive Mix)\n016. Roger Shah and Sian Kosheen - Shine (Pedro Del Mar Remix)\n017. Sebastian Brandt - Mana (Original Mix)\n018. Susana and Max Graham - Down To Nothing (Original Mix)\n019. Federation - Innocent Desire (Nick Sentience Remix)\n020. Matt Darey feat. Leah - Hold Your Breath (KhoMha Remix)\n021. Michael Angelo and Jenry R - Disconnected (Myon Shane 54 Vocal Mix)\n022. John OCallaghan and Kathryn Gallagher - Mess Of A Machine (Sean Tyas Remix)\n023. Tritonal feat. Cristina Soto - Everafter (Mike Shiver Remix)\n024. Emma Hewitt - Miss You Paradise (Shogun Remix)\n025. Fredda L. and Fisher - Love, You Call It (Beat Service Remix)\n\nTracks are NOT in the order shown here. They are simply arranged by Artist Name.\n\nYou can also check out Volume 1 here: http://thepiratebay.se/torrent/7427773/VA_-_A_State_of_Vocal_Trance_Volume_1","torrent":{"xt":"urn:btih:2a9bcf0e1beba16b6b0c75de9ea0ee1c79dccd6e","amp;dn":"VA+-+A+State+of+Vocal+Trance+Volume+2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2a9bcf0e1beba16b6b0c75de9ea0ee1c79dccd6e","infoHashBuffer":{"type":"Buffer","data":[42,155,207,14,27,235,161,107,107,12,117,222,158,160,238,28,121,220,205,110]},"announce":[],"urlList":[]}}