{"title":"E-boek: &quot;Controle&quot; - Ivo Senden (NL, 2009)","uid":6414017,"size":3078776,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2ab2b16f996e7f18bb070392a96196cbc7f2c537&amp;dn=E-boek%3A+%5C%22Controle%5C%22+-+Ivo+Senden+%28NL%2C+2009%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Clitch77","files":5,"time":1306101936,"description":"Dutch e-book / Nederlandstalig\n\nTitel: Controle\nAuteur: Ivo Senden\nUitgave: 2009\nGenre: Science fiction/thriller\nFormaat: Epub, LRF en Mobi\n\nSynopsis:\n\nNederland, 2034.\n\n25 jaar na dato heeft de wereld weinig geleerd van de laatste economische crisis. De olieprijs is naar ongekende hoogte gestegen, de rijken der aarde zijn nog even corrupt en de stijgende honger naar energie is niet te stillen met de beperkte opbrengst van alternatieve energiebronnen.\n\nIn deze wereld leeft hoofdpersoon Christa Winkler, een jonge, onervaren journaliste die haar droom van een avontuurlijke, passievolle toekomst heeft zien verschrompelen tot een inspiratieloze sleur in haar liefdesleven en in haar werk.\nWanneer ze met tegenzin verslag doet van protestacties tegen bedrijven die zich bezighouden met dierproeven, valt haar de opmerkelijke houding op van BioTec, een firma die in tegenstelling tot zijn concurrenten, geen enkele moeite doet om niet negatief in het nieuws te geraken. Het bedrijf sluit zich hermetisch af van de buitenwereld.\nChrista besluit een jonge werknemer van het bedrijf te volgen en hem onder een valse naam te verleiden, in de hoop meer te weten te komen over het geheimzinnige bedrijf.\nAl snel raakt ze verstrikt in een web van schokkende experimenten, die gefinancierd worden door grote en machtige partijen met belangen die verstrekkende gevolgen hebben voor de hele wereld.\n\nControle, geschreven door de Nederlandse auteur Ivo Senden, is een spannende en beklemmende science fiction thriller, die gemakkelijk wegleest en dankzij diverse plotwisselingen tot op de laatste pagina blijft boeien!","torrent":{"xt":"urn:btih:2ab2b16f996e7f18bb070392a96196cbc7f2c537","amp;dn":"E-boek%3A+%5C%22Controle%5C%22+-+Ivo+Senden+%28NL%2C+2009%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2ab2b16f996e7f18bb070392a96196cbc7f2c537","infoHashBuffer":{"type":"Buffer","data":[42,178,177,111,153,110,127,24,187,7,3,146,169,97,150,203,199,242,197,55]},"announce":[],"urlList":[]}}