{"title":"Jerry Sadowitz Collection Update 1","uid":13623235,"size":8116906890,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:2aeed4111ce9d25bb39e6c0e26388209b9fd78c6&amp;dn=Jerry+Sadowitz+Collection+Update+1&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"caralho_voador","files":44,"time":1455986855,"description":"This torrent is a collection of everything I have by comedian/magician/psychopath Jerry Sadowitz.\r\n\r\nThis torrent is predominantly an expansion of this torrent: -\r\n \nhttps://thepiratebay.se/torrent/6925350/Jerry_Sadowitz_Collection\r\n\r\nFirstly, thank you to the uploader of this torrent. You did a great job and I am simply adding to your work/efforts. This was an excellent torrent and there was a significant crossover between the files on this torrent and my own personal collection. However, some files I had were not on the torrent and I also had files that were better quality recordings, so I have made some additions/replacements.\r\n\r\nI have also renamed files and put them into directories based on the media type and show/series. Additionally, I have taken the liberty of correcting some episode numbers of the TV shows were I had reason to believe them to be wrong. Of course, I might be incorrect with some of them but the most important thing is that none the content of the original torrent has been lost, it has only had the quality improved and/or been renamed and/or added to.\r\n\r\n--------------------------------\r\n\r\nTHE DETAILS....\r\n\r\nMP3 FILES - all are from the original torrent, with some tag info put into them. Album art added to Gobshite.\r\n\r\nVIDEO FILES\r\n\r\nThe Jerry Atrick Show\r\n\tSeries 1\r\n\t\tSE01 EP01 added (did not exist in the original torrent)\r\n\t\t'The Jerry Atrick Show - Unknown Episode' renamed to SE01 EP02.\r\n\t\t'The Jerry Atrick Show - Episode 2' renamed to 'SE01 EP03' (I *think* this is correct)\r\n\t\tSE01 EP04 added (did not exist in the original torrent)*\r\n\t\r\n\t\t* - parts of this are missing due to the DVD I originally had them stored on suffering from &quot;disk rot&quot;. I'm sure I have a back up of this stored somewhere and I might upload it if I find it.\r\n\t\r\nThe Pall Bearer's Revue\r\n\tNo changes\r\n\t\r\nThe People of New York vs Jerry Sadowitz\r\n\tNo changes\r\n\t\r\nThe People vs Jerry Sadowitz\r\n\tSeries 1\r\n\t\t'Series 1 (6 of 8 episodes) - Episode 1' renamed to 'SE01 EP01'.\r\n\t\t'Series 1 (6 of 8 episodes) - Episode 2' renamed to 'SE01 EP02' and replaced with significantly better quality version.\r\n\t\t'Series 1 (6 of 8 episodes) - Episode 3' renamed to 'SE01 EP03' and replaced with significantly better quality version.\r\n\t\t'Series 1 (6 of 8 episodes) - Episode 4' renamed to 'SE01 EP04 (complete episode)'. I have also added in my own copy of this as 'SE01 EP04 (not complete, better quality)' which is significantly better quality but is missing the first couple minutes.\r\n\t\t'SE01 EP05' added (did not exist in the original torrent).\r\n\t\t'Series 1 (6 of 8 episodes) - Episode 5' renamed to 'SE01 EP06' and replaced with significantly better quality version. From the order of my old recordings I believe this to be episode 6, not 5.\r\n\t\t'SE01 EP07' added (did not exist in the original torrent).\r\n\t\t'Series 1 (6 of 8 episodes) - Episode 6' renamed to 'SE01 EP08' and replaced with significantly better quality version. There was 8 episodes in the series, Sadowitz himself says at the beginning it's the last show of that series so it should be listed as EP08.\r\n\t\t\r\n\t\tSo that's now 8 out of 8 episode from Series 1 in the archives! Hurrah!\r\n\t\t\r\n\tSeries 2\r\n\t\tIn the original torrent, there were 5 of 8 episodes. However, I think it has the starting point of the episodes wrong - it says they are episodes 1 to 5 whereas I think they are actually episodes 4 to 8. I am adding in another 3 shows here which are studio shows which I believe all being to Series 2 and are the first 3 shows of the series before they went out on location with Dave Courtney as the bouncer. In the first 3 shows in this series, Sadowitz had Eric Bristow and Malcolm Hardee as the bouncer. However, there was also another show that had Mark E Smith from the Fall as the bouncer which I dont have and have only seen stills from so I maybe wrong.\r\n\t\t\r\n\t\tSE02 EP01 added (did not exist in the original torrent).\r\n\t\tSE02 EP02 added (did not exist in the original torrent).\r\n\t\tSE02 EP03 added (did not exist in the original torrent).\r\n\t\tAll other episodes renamed appropriately.\r\n\t\t\r\nThe People vs The Edinburgh Fringe\r\n\tDid not exist in the original torrent, has been added in. This was only a 10 minute long episode and, as far as I know, there were no other episodes.\r\n\t\t\r\nThe Total Abuse Show\r\n\tNo changes\r\n\t\t\r\nI have also added in a couple newspaper/magazine clippings I had.\r\n\r\n--------------------------------\r\n\r\nOne for the hardcore fans, I do hope you enjoy it!","torrent":{"xt":"urn:btih:2aeed4111ce9d25bb39e6c0e26388209b9fd78c6","amp;dn":"Jerry+Sadowitz+Collection+Update+1","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2aeed4111ce9d25bb39e6c0e26388209b9fd78c6","infoHashBuffer":{"type":"Buffer","data":[42,238,212,17,28,233,210,91,179,158,108,14,38,56,130,9,185,253,120,198]},"announce":[],"urlList":[]}}