{"title":"A More Perfect Union - America Becomes a Nation","uid":8960452,"size":894829654,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:2af67147737a123fd21b85e6140b2c0d8f0d9321&amp;dn=A+More+Perfect+Union+-+America+Becomes+a+Nation&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"rambam1776","files":-1,"time":1380096099,"description":"A More Perfect Union - America Becomes a Nation\n\nFormat                                   : Matroska\nFormat version                           : Version 2\nFile size                                : 853 MiB\nDuration                                 : 1h 51mn\nOverall bit rate                         : 1 067 Kbps\nWidth                                    : 706 pixels\nHeight                                   : 480 pixels\nDisplay aspect ratio                     : 4:3\nFrame rate mode                          : Variable\nColor space                              : YUV\nChroma subsampling                       : 4:2:0\nBit depth                                : 8 bits\nScan type                                : Progressive\nWriting library                          : x264 core 120\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0300212/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0300212/&lt;/a&gt;\n &lt;a href=&quot;\nhttp://image.bayimg.com/a8f65d8164eb57e5e0b5fffa3d55b6a71e688111.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://image.bayimg.com/a8f65d8164eb57e5e0b5fffa3d55b6a71e688111.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/A_More_Perfect_Union_(film)&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/A_More_Perfect_Union_(film)&lt;/a&gt;\n\nA More Perfect Union: America Becomes a Nation is a 1989 American feature film dramatizing the events of the Constitutional Convention. It was officially recognized by the Commission on the Bicentennial of the United States Constitution as &quot;of exceptional merit&quot;.\n\nThe film depicts events surrounding creation of the United States Constitution, focusing mainly on James Madison, the person who wrote most of that document.\n\nThe period immediately following the American Revolutionary War was marked by intense political unrest, owing to huge debts, the interruption of trade and business, shortages of labor, and personal turmoils, all created by the War. It soon became painfully evident that the Articles of Confederation were insufficient to address the country's needs. A movement was soon afoot to upgrade or replace the Articles, and Madison was foremost in the movement. However, he needed the support of George Washington; he needed to show that a new government would be sufficient to address such challenges as Shays' Rebellion and the growing trade problems between the independent States.\n\nMadison was strongly opposed by those who feared a strong central government, people known either as States Rights Advocates or as Anti-Federalists, such as Roger Sherman and John Dickinson. Madison was in favor of a bicameral congress, but envisioned both houses being elected according to proportional representation. In this he was strongly opposed by the States Rights Advocates, and he eventually accepted the compromises necessary to address their concerns. The film highlights the basis for these compromises.\n\nThe movie was filmed on location at Independence Hall in Philadelphia, Williamsburg, Virginia and other historical sites. The film is shot almost entirely from the viewpoint of James Madison, with the script being based primarily on his writings. These include the copious minutes he took during the Constitutional Convention, which were published as Notes of Debates in the Federal Convention of 1787.\n","torrent":{"xt":"urn:btih:2af67147737a123fd21b85e6140b2c0d8f0d9321","amp;dn":"A+More+Perfect+Union+-+America+Becomes+a+Nation","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2af67147737a123fd21b85e6140b2c0d8f0d9321","infoHashBuffer":{"type":"Buffer","data":[42,246,113,71,115,122,18,63,210,27,133,230,20,11,44,13,143,13,147,33]},"announce":[],"urlList":[]}}