{"title":"British Cinema in the 1950's An Art in Peacetime(pdf){Zzzzz}","uid":11524799,"size":4977339,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2b0484d361937fd1e0ce838f0df7179d8cde2eab&amp;dn=British+Cinema+in+the+1950%27s+An+Art+in+Peacetime%28pdf%29%7BZzzzz%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"zombie_rox","files":1,"time":1416519527,"description":"This book offers a startling re-evaluation of what has until now been seen as the most critically lackluster period of the British cinema. Twenty writers contribute essays that rediscover and reassess the productions of the Festival of Britain decade, during which the vitality of wartime film-making flowed into new forms. Topics covered include genres such as the B-film, the war film, the woman's picture, the theatrical adaptation and comedy; also social issues such as censorship and the screen representation of childhood.\n\nPublisher: Manchester University Press (June 28, 2003)\nLanguage: English\nISBN-10: 0719064899\nISBN-13: 978-0719064890\n\nMost Helpful Customer Reviews\n\nA Primer for Newbies\nBy Kevin Killian HALL OF FAME on January 3, 2005\nThe editors and authors have opened my eyes to many British films of the 1950s that sound perfectly fascinating and which I have never seen. Corin Redgrave delivers a paper on his father's film work which makes one yearn to see more of Michael Redgrave's films. There's a splendid article on B-movie production in the 1950s that focusses in on &quot;Tympean Films,&quot; and shows that B-movies can sometimes embody more of social reality than the A pictures because they do so more or less by accident. Robert Giddings reads the Dirk Bogarde version of A TALE OF TWO CITIES in light of the Cold War, and Dirk figures heavily in Alison Platt's piquant essay, &quot;Boys, Ballet, and Begonias: The SPANISH GARDENER and its analogues.&quot; Sarah Kasen gives a straightforward account of the place of film in the Festival of Britain, and Tony Aldgate shows the places in which the gay-themed SERIOUS CHARGE had trouble making it to the screen with all its bits intact. One stupid note spoils the whole: The timeline appended to the volume shows that the only event in UK literature worth recording in 1955 was the publication of F.R. Leavis' &quot;DH LAWRENCE, NOVELIST.&quot; i don't think so! This bizarre anomaly is explained by the fact that one of the editors (Ian Mackillop) is the world's #1 Leavis expert and it is he who is charged with the uphill task of resuscitating Leavis' thoroughly torpid reputation","torrent":{"xt":"urn:btih:2b0484d361937fd1e0ce838f0df7179d8cde2eab","amp;dn":"British+Cinema+in+the+1950%27s+An+Art+in+Peacetime%28pdf%29%7BZzzzz%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2b0484d361937fd1e0ce838f0df7179d8cde2eab","infoHashBuffer":{"type":"Buffer","data":[43,4,132,211,97,147,127,209,224,206,131,143,13,247,23,157,140,222,46,171]},"announce":[],"urlList":[]}}