{"title":"Howard B. Means - C. S. A. (Confederate State of America) Unb","uid":4834499,"size":181282016,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:2b630549dc13d5b6fb5e00e6fa6d362a6e3a49cc&amp;dn=Howard+B.+Means+-+C.+S.+A.+%28Confederate+State+of+America%29+Unb&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"RamJamSam","files":9,"time":1239265971,"description":"Howard B. Means - C. S. A. (Confederate State of America) Unb\nRead by:  Richard Gilliland \nRuntime:  6 Hours and 16 Minutes\n \n\n\nWHAT IF THE SOUTH HAD WON THE CIVIL WAR? From the ashes of a divided nation came the Confederate States of America-the capitol is Richmond, and the races are equal but very, very separate. For President Spencer Jefferson Lee-the great-great-grandson of both Jefferson Davis and Robert E. Lee-it's politics as usual. On one side, the lily-white Senate wants quid pro quo; on the other, the all black House has an agenda of its own. But whatever their differences, the powers-that-be agree on one thing: Utter separations between the races is the key to peace and prosperity. To love someone of the opposite race is to court disaster; to act on that love is to become officially nonexistent. But what Spencer Lee and his black friend, Vice President Nathan Winston, are about to learn is that love is beyond the law. Underneath the facade of civil order there is dissent in the form of DRAGO, a protest group made up of &quot;losers&quot; of this &quot;ideal&quot; society-cross-racial loves children, social and environmental idealists led by a mysterious mocha-skinned woman known only as Cara. When two bodies are found with their fingers removed so that their identities can be put on short-term loan, the stage is set for the most fast-paced, intriguing novel of the year. \n\n\n\nGooD SeeDinG!\n\n","torrent":{"xt":"urn:btih:2b630549dc13d5b6fb5e00e6fa6d362a6e3a49cc","amp;dn":"Howard+B.+Means+-+C.+S.+A.+%28Confederate+State+of+America%29+Unb","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2b630549dc13d5b6fb5e00e6fa6d362a6e3a49cc","infoHashBuffer":{"type":"Buffer","data":[43,99,5,73,220,19,213,182,251,94,0,230,250,109,54,42,110,58,73,204]},"announce":[],"urlList":[]}}