{"title":"Emily Jane White - Victorian America [2009][EAC,log,cue. FLAC]","uid":8467136,"size":299830207,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:2c544fd503ead75456c7ed16e0105a108d5eb954&amp;dn=Emily+Jane+White+-+Victorian+America+%5B2009%5D%5BEAC%2Clog%2Ccue.+FLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dickspic","files":15,"time":1368385541,"description":"Artist: Emily Jane White\nRelease: Victorian America\nReleased: 2009\nLabel: Talitres Records\nCatalog#: Tal 050\nFormat: FLAC / Lossless / Log (100%) / Cue\n[color=blue]Country: USA\nStyle: Folk\n\n\n\n\n01. Never Dead\n02. Stairs\n03. Victorian America\n04. Baby\n05. Frozen Heart\n06. The Country Life\n07. Liza\n08. The Ravens\n09. Red Serpent\n10. Red Dress\n11. A Shot Rang Out\n12. Ghost of a Horse\n\nEmily Jane White's singing voice, wispy and sweet but undercut with an alluring world-weary weight, lends itself to brow-furrowing introspection and rustic tales of woe. And there are more than a few songs like this on her second album, Victorian America. She doesn't go out of her way to invoke a comparison to Cat Power, but during certain moments it's difficult to not notice the flattering (albeit striking) resemblance. If dour tracks like &quot;Never Dead&quot; and &quot;The Baby&quot; don't outright mimic Chan Marshall's indomitable style, they're at least more than a little beholden to her.\nTo White's credit, though, she doesn't let these impressions linger-- even at their most bathetic, her songs are buoyed with helpings of strings, pedal steel, and other instrumental touches that play their part without overstating their presence. The title track, a string-swept ballad that makes references to Hurricane Katrina, is a perfect example. Instead of overselling the drama, White maintains a certain distance from the emotion the song conveys, singing the lyrics in a stately and precise fashion. The musical accompaniment ably mimics this elegant pose, turning the song into something much more affecting. In comparison, an elegiac tear-soaked ballad like &quot;The Ravens&quot; opts to fully immerse itself in the tragedy of its broken-hearted subjects. &quot;And so I walk the line,&quot; White sings, &quot;to the beating of this never-ending lie,&quot; detailing in painstaking poetic fashion a love that was destined to die.\nAn album full of these sorts of lilting sorrows would be just fine (if a little samey), but thankfully there's more to Victorian America than that. The wry and humorous &quot;The Country Life&quot;, with White striking the carefree pose of a been-there done-that woman who's still not done living her life, is a pleasant departure from the album's overall weightiness. The same goes for &quot;Liza&quot;, a track whose talk of warnings and death is belied by a spry gait (and a pretty sly &quot;Be My Baby&quot; nod). And even when White bites off more than she can chew (as on the pseudo-song-suite &quot;Stairs&quot;) or tries on poses that don't quite fit (like the heavy electrified stomp of &quot;Red Dress&quot;), the adventurous spirit of such detours more than makes up for their shortcomings. It's heartening to see an artist as young as Emily Jane White recognize and exploit her strengths; it's even more heartening to see her try something apart from those strengths, failure be damned.","torrent":{"xt":"urn:btih:2c544fd503ead75456c7ed16e0105a108d5eb954","amp;dn":"Emily+Jane+White+-+Victorian+America+%5B2009%5D%5BEAC%2Clog%2Ccue.+FLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2c544fd503ead75456c7ed16e0105a108d5eb954","infoHashBuffer":{"type":"Buffer","data":[44,84,79,213,3,234,215,84,86,199,237,22,224,16,90,16,141,94,185,84]},"announce":[],"urlList":[]}}