{"title":"BBC Later with Jools Holland S48E02 1080i HDTV h264-NX","uid":14548931,"size":2947476220,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:2ef07c00e89cee0872a2ad32c3bec6b130bfc791&amp;dn=BBC+Later+with+Jools+Holland+S48E02+1080i+HDTV+h264-NX&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"BasilBrush","files":1,"time":1462624016,"description":"BBC Later with Jools Holland S48E02 1080i HDTV h264-NX\r\n\r\nBroadcast date: 29th April 2016\r\n\r\nJoining Jools on the second show is US jazz singer-songwriter Gregory Porter, who, following his debut on the show back in 2011, has gone on to achieve critical and commercial success with his Liquid Spirit LP going top ten in the UK. He returns to the show to perform tracks from his follow-up Take Me to the Alley. Back in September 2015 in a recording studio in London, Mumford and Sons joined up with acclaimed Senegalese musician Baaba Maal and London/Malawi duo The Very Best to record together for a South African release. They followed it up earlier in 2016 with six shows together across South Africa and they reunite in Maidstone to perform on the show.\r\n\r\nMaking her UK TV debut is Nantes-born Héloïse Letissier, AKA Christine and the Queens. Moving to London after finishing her studies in 2010, Letissier found herself drawn to the performing arts underworld of Soho, where she met the drag queens of Madame JoJo's who inadvertently helped birth her musical project. She is known for her energetic and visually arresting live shows which see her interact with four male dancers and a shadowy three-piece band. She - and they - will be showing off her dance-art-pop sound and style on the show. From Sunderland and making their Later... debut are Field Music, who are essentially brothers David and Peter Brewis. Over their 11-year history, they have released six albums and were nominated for the Mercury Prize in 2012. They will be playing a couple of tracks from their most recent LP Commontime, which saw them crack the UK Top 40 for the first time. Making his UK TV debut is Philadelphia's Son Little, the son of a preacher who has sung with The Roots, and whose take on R 'n' B and blues manages to be both contemporary and imbued with the past.\r\n\r\nFinally, British folk singer and traditional music specialist Sam Lee, nominated for singer of the year at the Radio 2 Folk Awards, will be performing an acapella piece with three of his '&amp; Friends' ensemble from their current album 'Fade In Time'.\r\n\r\nTechnical Spec\r\nVideo Codec: h264 CABAC   \r\nVideo Bitrate: 5651Kbps\r\nVideo Resolution: 1920x1080\r\nVideo Aspect Ratio: 16:9\r\nFrames Rate: 50i/MBAFF\r\nAudio Codec: AC3\r\nAudio Bitrate: 384Kbps CBR 48KHz\r\nAudio Channels: 6\r\nRun-Time: 62 mins\r\nNumber Of Parts: 1\r\nPart Size: 2.74 GB\r\nSource: HDTV\r\nSubtitles: Merged","torrent":{"xt":"urn:btih:2ef07c00e89cee0872a2ad32c3bec6b130bfc791","amp;dn":"BBC+Later+with+Jools+Holland+S48E02+1080i+HDTV+h264-NX","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2ef07c00e89cee0872a2ad32c3bec6b130bfc791","infoHashBuffer":{"type":"Buffer","data":[46,240,124,0,232,156,238,8,114,162,173,50,195,190,198,177,48,191,199,145]},"announce":[],"urlList":[]}}