{"title":"Los Del Rio - Macarena  (2nafish)","uid":5676742,"size":137267204,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:2f1cd803d8284ef3bbe06f2df2b1232fecd4ce46&amp;dn=Los+Del+Rio+-+Macarena++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"2nafish","files":-1,"time":1278567981,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;Macarena&quot; is a Spanish song by Los del RÃƒÆ’Ã‚Â­o about a woman of the same name. It was popular between 1995 and 1996, and continues to have a cult following.\n\nThe &quot;Bayside Boys Mix&quot; became the most well known version of the song, as it had English lyrics, sung by an uncredited artist, Carla Vanessa. These are often mistaken for the original female vocals, sung by Alaska.\n\nThe song became the second longest running #1 and best selling debut single of all time in the U.S. It was ranked the &quot;#1 Greatest One-Hit Wonder of all Time&quot; by VH1 in 2002.\n\nThe song uses a type of clave. The song ranks at #5 on Billboard's All Time Top 100. It also ranks at #1 on Billboard's All Time Latin Songs.\n\nAs a result of their lounge act, Los del RÃƒÆ’Ã‚Â­o were invited to tour South America in March 1992 and, while visiting Venezuela, they were invited to a private party held by the Venezuelan empresario (of Cuban descent) Gustavo Cisneros. Many prominent Venezuelans were in attendance that night, including former president Carlos AndrÃƒÆ’Ã‚Â©s PÃƒÆ’Ã‚Â©rez.\n\nCisneros had arranged for a local flamenco teacher, Diana Patricia CubillÃƒÆ’Ã‚Â¡n Herrera, to do a small performance for the guests, and Los Del Rio were pleasantly surprised by CubillÃƒÆ’Ã‚Â¡n's dance skills. Spontaneously, Romero recited the song's chorus-to-be on the spot, as an accolade to CubillÃƒÆ’Ã‚Â¡n, but naming her &quot;Ma'dalena&quot; (Magdalena): &quot;Dale a tu cuerpo alegrÃƒÆ’Ã‚Â­a, Ma'dalena, que tu cuerpo e' pa' darle alegrÃƒÆ’Ã‚Â­a y cosa' gÃƒÆ’Ã‚Â¼ena'&quot; (&quot;Give your body some joy, Magdalene, 'cause your body is for giving joy and good things too&quot;). In Andalusian culture labeling a woman &quot;Magdalena&quot; is to give her a faint association with Mary Magdalene's reportedly seedy past, and more accurately describes her as being sassy or sensuous.\n\nRomero saw potential in the improvised rhyme and, back at their hotel, the duo came up with the basic structure of the song. Since &quot;Magdalena&quot; was also the title of another song by Spanish singer Emmanuel quite popular at the time, Romero suggested that they use &quot;Macarena&quot; instead which, besides being part of the name of one of his daughters, is a popular name in Andalusia, given its association with the Virgin of the Macarena, the incarnation of the Virgin Mary that is a patroness of Seville's barrio La Macarena. The Virgin-Magdalene dichotomy probably explains the rest of the lyrics: a song about a young woman, the girlfriend of a recent recruit to the Spanish Army named Victorino (whose name may be inspired from a kind of bull with long horns, evoking the cornudo, or male victim of his partner's infidelity, a mental image common in Spanish and Latin American culture), who celebrates his being drafted by hooking up with two of his male friends. Macarena has a weakness for males in uniform, spending summers at Marbella, and dreams of shopping at El Corte InglÃƒÆ’Ã‚Â©s (the major Spanish department store chain), moving to New York City and getting a new boyfriend.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:2f1cd803d8284ef3bbe06f2df2b1232fecd4ce46","amp;dn":"Los+Del+Rio+-+Macarena++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2f1cd803d8284ef3bbe06f2df2b1232fecd4ce46","infoHashBuffer":{"type":"Buffer","data":[47,28,216,3,216,40,78,243,187,224,111,45,242,177,35,47,236,212,206,70]},"announce":[],"urlList":[]}}