{"title":"Still Life 2 GOG","uid":8771272,"size":10370764011,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:2f30061f3c72e991d3a97151ac531e75ec23d6e8&amp;dn=Still+Life+2+GOG&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"AN0NYMOUS142857","files":53,"time":1375462464,"description":"    genre    adventure / action / detective-mystery\n    download size    9.5 GB\n    release date    March 30, 2009\n    compatible with    Windows (XP, Vista, 7, 8)\n    languages    English, Spanish, German, Italian, French\n    developer / publisher    GameCO Studios / Anuman Interactive\n    game modes    single-player\n\n    Bonus content included:\n    manual\n    soundtrack\n    avatars\n    artworks\n\nWhat's cool about it:\n\n    Experience the story from both the victim's and the detective's perspective, each with its own gameplay style: investigation and survival.\n    Gripping story with many plot twists and a thrilling atmosphere that will keep you hooked for hours.\n    Well-designed investigations with impressive attention to detail will test your skill as a homicide detective.\n\nOverview:\n\nWho is hiding behind Mr. X? Still Life 2 reveals the long-awaited ending of Still Life and spells a new investigation for Agent Victoria McPherson.\n\nIn Fall 2008, Victoria is sent to Maine where Ellen Dunnigan's body has just been found. The modus operandi and the video sent to the police and press leave no doubt as to the killer's identity: the East Coast Torturer has struck again! No clues are picked up during the autopsy, as the serial killer painstakingly washed the body. Once again, the killer has not committed any errors.\n\nStill Life 2 remains true to the spirit of its first installment and continues to allow you to play and manage two characters bound by the same fate. This time, the aim is to control two heroines, see the game from two different viewpoints, and essentially experience two different types gameplay. Depending on whether you are playing as Paloma Hernandez--the victim--or Victoria McPherson--the investigator--you alternate between survival and investigation.\n\nAge requirements: ESRB Rating: MATURE with Blood and Gore, Partial Nudity, Strong Language, Violence. PEGI Rating: 18+ with Violence.\n\nMinimum system requirements: Windows XP or Windows Vista, 1.8 GHz Processor, 512MB RAM (1 GB recommended), 3D graphics card compatible with DirectX 9, 4GB HDD, Mouse, Keyboard.\n\nInstall and Play.","torrent":{"xt":"urn:btih:2f30061f3c72e991d3a97151ac531e75ec23d6e8","amp;dn":"Still+Life+2+GOG","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2f30061f3c72e991d3a97151ac531e75ec23d6e8","infoHashBuffer":{"type":"Buffer","data":[47,48,6,31,60,114,233,145,211,169,113,81,172,83,30,117,236,35,214,232]},"announce":[],"urlList":[]}}