{"title":"BangBus - Shannon XXX 480p 05.01.2002","uid":11264198,"size":796951667,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:2f740b43855aea8445b110e0577d2ae5bbd5f406&amp;dn=BangBus+-+Shannon+XXX+480p+05.01.2002+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"christian2353","files":1,"time":1414003613,"description":"Screenshots\n &lt;a href=&quot;\nhttp://bayimg.com/gACNfAAGD&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/gACNfAAGD&lt;/a&gt;\n\n\n\n\nwell look what we found Ugly and I are some of the most addicted *censored*s there are about trailor park bitches we eat drink and fuck trailor trash. theres nothing like it they talk kinda funny usually do to the fact that education is of a low quality and also do to them usually missing teeth but when we found Shannon she came with a full set. and a rack of tits to boot and I have to say she wasn't to smart but really what tralior park girl is.. anyway, Ugs and I had brought a dude I met at a party now this guy was so wierd that not taking him with us would have been a crime his name was Rashied a guy white as snow thinking he was black muslum because of the way he was raised by his stepdad. Anyway When we picked up Shannon It appeared that she had heard of us from her friend Sandra who if you guys remembered got slammed by Ramone a few weeks earlier but apparently Sandra didnt have a really bad time because Shannon seemed ok with getting into the van with us who knows chicks are wierd. So Shannon seemed pretty cool with us and everything going to plan until she started making comments on Rashied skin color and man was he sensetive about that *censored*he started to freek out until I calmly explained to Shannon that black is not a color but a state of mind which she seemed to understand even though god knows how many times her mother had dropped the poor girl on her head during wild redneck drinking binges later running the last guy out bed that was slamming her mom.. so the shoot I believe went really well this bitch could suck some cock and I'm not going to tell to much except for the fact that theres anal and this movie went so well that Ugly never jacks off to the movies but two nights ago I caught him with the camera attached to the wide screen that all your money has bought him in full stereo jerkin his *censored*to this last movie.... so listen if Ugly is jerkin to one of the films that means its pretty fuckin good..... god bless and power to the people love ya all Sanchez","torrent":{"xt":"urn:btih:2f740b43855aea8445b110e0577d2ae5bbd5f406","amp;dn":"BangBus+-+Shannon+XXX+480p+05.01.2002+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2f740b43855aea8445b110e0577d2ae5bbd5f406","infoHashBuffer":{"type":"Buffer","data":[47,116,11,67,133,90,234,132,69,177,16,224,87,125,42,229,187,213,244,6]},"announce":[],"urlList":[]}}