{"title":"Walking on Eggs {BBS}","uid":7387073,"size":10491262,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3146b4441cec5f670388c8ddc236d9afad450eed&amp;dn=Walking+on+Eggs+%7BBBS%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"bigbluesea","files":-1,"time":1340663658,"description":"&quot;Walking on Eggs&quot; is the riveting inside story behind one of the most significant paleontological discoveries in history. In November 1997, Luis M. Chiappe and Lowell Dingus led an elite team of paleontologists and geologists into the rugged and desolate badlands of Argentina. Unsure of what they would find, Chiappe and Dingus knew that this region had produced many spectacular specimens of dinosaurs and fossil birds over the last century. Nothing could have prepared them, however, for the headline-grabbing discovery they were about to make: a massive dinosaur nesting ground covering more than a square mile and littered with tens of thousands of large, unhatched dinosaur eggs. Containing the first fossils of embryonic dinosaur skin ever found, the eggs gave rise to a host of mysteries. What species laid the eggs, and when? How were they preserved? And most intriguingly, what ancient catastrophe -- deeply rooted more than 70 million years in the past -- prevented them from hatching?\n\nIn clear, comprehensible language, Chiappe and Dingus frame their scientific investigations within the context of a gripping detective story, illustrating how they used paleontological and geological evidence to establish the identity and age of the eggs, as well as how they established the cause of death. Chiappe and Dingus also recount a return trip to the badlands in 1999 in which they set out to learn more about dinosaur social and reproductive behavior. Their investigations once again unearthed a key piece of the historic puzzle: the bones of a twenty-foot predatory, carnivorous dinosaur.\n\nAs they decipher the evidence -- divining origins, discovering identities, and pinpointing possiblecauses of extinction -- Chiappe and Dingus interweave their field adventures with chapters illuminating the crucial precedents behind their groundbreaking work. Complementing the text are beautiful hand-drawn reproductions of what the dinosaurs and their landscape might have looked like, created by an artist who joined the expedition team in Patagonia. Infused with passion and an infectious sense of awe, &quot;Walking on Eggs&quot; illustrates the ups and downs of the scientific process and invites dinosaur lovers of all ages to experience the exhilarating sense of discovery.\n\n\n\nHardcover: 224 pages\nPublisher: Scribner (June 19, 2001)\nLanguage: English\nISBN-10: 0743212118","torrent":{"xt":"urn:btih:3146b4441cec5f670388c8ddc236d9afad450eed","amp;dn":"Walking+on+Eggs+%7BBBS%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3146b4441cec5f670388c8ddc236d9afad450eed","infoHashBuffer":{"type":"Buffer","data":[49,70,180,68,28,236,95,103,3,136,200,221,194,54,217,175,173,69,14,237]},"announce":[],"urlList":[]}}