{"title":"Democracy Now - 07 nov 2011","uid":6801091,"size":453582109,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:346bdf9b98dd66a8762ed8243f8fc869099b61d1&amp;dn=Democracy+Now+-+07+nov+2011&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":1,"time":1320685480,"description":"An alternative daily newschannel. One hour with news as you do not see it elsewhere.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n\nHeadlines for Nov 07, 2011\n\n-  Greek Prime Minister Seals Deal to Step Down Amid Formation of National Unity Government\n-  Israel Warns Attack on Iran Is Increasingly Likely\n-  Israel Intercepts Gaza-Bound Aid Flotilla, Dozens Detained Including Democracy Now! Correspondent\n-  Occupy Wall Street Movement Enters Eighth Week With Continued Arrests Around the Country\n-  Second Iraq War Veteran, Occupy Supporter Seriously Injured by Police in Oakland\n-  U.S. DEA Deploying Commando Squads Throughout Central America, Caribbean\n-  Scores of Pro-Democracy Activists Killed in Syria Despite Peace Plan\n-  Colombian Military Kills Rebel FARC Commander Alfonso Cano\n-  Nicaraguan President Daniel Ortega Poised For Re-Election\n-  Former Military General Accused of Torture, Genocide Wins Guatemala Presidential Election\n-  10,000 Protesters Surround White House Calling on Obama to Reject Keystone XL Tar Sands Oil Pipeline\n\n\nSpecial reports\n\n- Israel Intercepts Gaza-Bound Flotilla; Dozens Remain Detained Including Democracy Now! Correspondent\n\nIsraeli forces intercepted two Gaza-bound boats in international waters on Friday to prevent the boats from breaking the naval blockade of Gaza. The Canadian and Irish boats made up the &quot;Freedom Waves to Gaza&quot; flotilla. Israel detained the 27 activists on board, as well as all of the journalists - including Democracy Now! correspondent Jihan Hafiz. According to flotilla organizers, 21 people remain in Israeli custody, including Hafiz. The flotilla marked the latest failed attempt by international activists to challenge the Israeli naval blockade of Gaza. We speak to journalist Lina Atallah who was on the Canadian boat named &quot;Tahrir&quot; in the flotilla and was deported to Egypt yesterday. She is the managing editor of Al-Masry Al-Youm English Edition, an independent news website. The Israeli navy &quot;cornered our boats from all sides. We were all equally put at gunpoint. Even before they boarded our boat, everyone was put at gunpoint from Israeli ships,&quot; Atallah says. &quot;Although we were clearly showing that we were journalists, Jihan Hafiz, for example, who is a Democracy Now! journalist, had her press card out and clear, but she was one of the first people asked to lean on her knees and to raise her hands.&quot; Atallah said some passengers were tasered.\n\n\n- U.S. Drone Kills 16-Year-Old Pakistani Boy Days After He Attends Anti-Drone Organizing Meeting\n\nA group of Pakistanis met in Islamabad late last month to discuss the impact of U.S. drone strikes in their communities. One of the attendees was a 16-year-old boy named Tariq Aziz who had volunteered to learn photography to begin documenting drone strikes near his home. Within 72 hours of the meeting Aziz was killed in a U.S. drone strike. His 12-year-old cousin was also killed in the Oct. 31 attack. &quot;People were aware of the threat to them, yet they volunteered. Tariq in particular because he, at his age in that remote community, was familiar with computers, was excited about the idea of being able to document the civilian casualties,&quot; says reporter Pratap Chatterjee, who met Aziz days before he was killed. As part of a larger investigation on the CIA-led U.S. covert drone war, Chatterjee and the Bureau of Investigative Journalism reports that drone strikes in Pakistan have killed at least 392 civilians, including 175 children. &quot;I question as to whether the CIA is really attempting to identify people before they kill them,&quot; he says. &quot;It would have been so easy for the CIA, the ISI to come question these kids, to have taken them aside, even put them in jail or interrogate them ... but instead, they chose to kill them.&quot;\n\n\n- Egypt's Military Widens Crackdown As Prominent Blogger Alaa Abdel Fattah Remains Imprisoned\n\nThe mother of prominent Egyptian political activist and blogger Alaa Abdel Fattah began a hunger strike yesterday protesting her son's detention by the country's military council. Abdel Fattah was arrested last week after being accused of instigating clashes between military forces and Coptic Christians nearly a month ago at the state television building, Maspeero. At least 28 people were killed in the incident. As calls among activists grow for limiting U.S. military assistance to Egypt, Secretary of State Hilary Clinton said that the United States is not in favour of imposing any conditions on American aid. Democracy Now! correspondent Anjali Kamat is in Cairo and filed this report. Special thanks to Jacquie Soohen of Big Noise Films and Mosireen for footage.\n\n\n- 10,000 Surround White House to Protest Keystone XL Tar Sands Oil Pipeline\n\nMore than 10,000 protesters surrounded the White House on Sunday calling on President Obama to reject the proposed Keystone XL tar sands oil pipeline from Canada to the Gulf Coast. The protest came exactly a year before the 2012 election and the pipeline is shaping up to be a major political issue. Last week, President Obama said for the first time he will make the final decision on whether to approve the controversial 1,700-mile pipeline proposed by TransCanada, which would transport oil from the Alberta tar sands fields to refineries in Texas. Up until now, Obama said the final decision rested with the State Department. &quot;[Sunday protest] really underlines this has become not only the biggest environmental flash point in many years, but maybe the issue in recent times in the Obama administration when he has been most directly confronted by people in the street,&quot; said leading environmentalist Bill McKibben, a key organizer in the protest.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n","torrent":{"xt":"urn:btih:346bdf9b98dd66a8762ed8243f8fc869099b61d1","amp;dn":"Democracy+Now+-+07+nov+2011","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"346bdf9b98dd66a8762ed8243f8fc869099b61d1","infoHashBuffer":{"type":"Buffer","data":[52,107,223,155,152,221,102,168,118,46,216,36,63,143,200,105,9,155,97,209]},"announce":[],"urlList":[]}}