{"title":"El_Barco_[Temp.2][Cap.09]by Factoria Pirata..avi","uid":6794945,"size":783736824,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:347798d99cc5753e0f24fe4923120207569af0d7&amp;dn=El_Barco_%5BTemp.2%5D%5BCap.09%5Dby+Factoria+Pirata..avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"IBM00","files":1,"time":1320367526,"description":"Ramiro ve atÃƒÂ³nito como Palomares, despuÃƒÂ©s de rezar sus oraciones, coge impulso y se lanza al mar. RÃƒÂ¡pidamente, comienzan con las maniobras necesarias para acudir en su rescate pero el joven sacerdote no sale a flote, la corriente del barco se lo ha tragado. Gamboa y Ramiro por fin divisan algo: el cuerpo inerte de Palomares, flotando a la deriva. Ã‚Â¿Ha querido suicidarse Palomares? Ã‚Â¿Ha perdido definitivamente la fe? Ã‚Â¿ConseguirÃƒÂ¡ sobrevivir?\n \nTodos los aparatos electrÃƒÂ³nicos del barco se han puesto a funcionar de repente, en plena noche y sin motivo aparente. Es como si hubiesen chocado contra una torre de alta tensiÃƒÂ³n y bastantes mandos electrÃƒÂ³nicos se han estropeado con los cambios de voltaje, dejÃƒÂ¡ndoles en una situaciÃƒÂ³n bastante precaria: no hay luz, radio, radar, no tienen el control del timÃƒÂ³n. Lo peor de todo es que son conscientes de que esto es algo mÃƒÂ¡s que una mera subida de tensiÃƒÂ³n.\n \nBurbuja y Piti ven a un pato paseando por el barco. Mientras que Piti visualiza un delicioso manjar al horno, Burbuja ve mÃƒÂ¡s allÃƒÂ¡: es raro que un pato haya llegado hasta ellos, sÃƒÂ³lo, sin su bandada. Tras estudiar algunos libros de aves, Burbuja averigua que se trata de un ÃƒÂ¡nade real de vuelo corto, una especie que no hace migraciones ni vive en agua salada. Ã‚Â¿De dÃƒÂ³nde procede el pato?\n \nValeria cita a Ulises en secreto mediante una nota que ella misma ha escrito. A causa del apagÃƒÂ³n, han cerrado todos los baÃƒÂ±os del barco menos uno, lejos de su camarote. A ella le da miedo ir hasta allÃƒÂ­ de noche pero no quiere decÃƒÂ­rselo a Ainhoa y su padre para que no piensen que es una cobarde. Ulises se convertirÃƒÂ¡ en su aliado secreto, aunque esto pueda provocarÃƒÂ¡ al polizÃƒÂ³n mÃƒÂ¡s de un malentendido.\n","torrent":{"xt":"urn:btih:347798d99cc5753e0f24fe4923120207569af0d7","amp;dn":"El_Barco_%5BTemp.2%5D%5BCap.09%5Dby+Factoria+Pirata..avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"347798d99cc5753e0f24fe4923120207569af0d7","infoHashBuffer":{"type":"Buffer","data":[52,119,152,217,156,197,117,62,15,36,254,73,35,18,2,7,86,154,240,215]},"announce":[],"urlList":[]}}