{"title":"Mrs.Doubtfire (1993)DVD5 (NL subs)NLtoppers","uid":10758085,"size":4681092228,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:34cd23b49d609978fb37ca8a3e944d12af7c1c41&amp;dn=Mrs.Doubtfire+%281993%29DVD5+%28NL+subs%29NLtoppers&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Yakomo","files":-1,"time":1407950824,"description":"Mrs.Doubtfire (1993)DVD5 (NL subs)NLtoppers\n\n\nVerenigde Staten\nKomedie / Drama\n125 minuten\ngeregisseerd door Chris Columbus\nmet Robin Williams, Sally Field en Pierce Brosnan\n\nDaniel (Robin Williams) is samen met zijn vrouw Miranda Hillard (Sally Field) een gelukkig stel met drie kinderen. Op een dag krijgen ze ruzie en besluiten ze te scheiden. De kinderen worden aan Miranda toegewezen omdat Daniel in een nieuw huis komt en hij alles eerst op orde moet hebben. Hij mag ze 1 keer in de week op zaterdag zien. Hij vindt dit echter te weinig. Miranda heeft het te druk met haar werk en zoekt een oppas. Daniel verkleedt zich als oud vrouwtje en wordt zo de oppas van zijn eigen kinderen. Dan begint er een reeks komische gebeurtenissen.\n*******************************************\nDaniel Hillard is an eccentric actor who specializes in dubbing voices for cartoon characters. Daniel is a kind man and a loving father to his three kids Lydia, Chris, and Natalie, but Daniel's wife Miranda sees him as a poor disciplinarian, and a bad role model. After Daniel throws an elaborate and disastrous birthday party for Chris, Miranda reaches the end of her limited patience, and files for a divorce. Daniel is heartbroken when Miranda is given custody of the kids and he's only allowed to visit them once a week. Determined to stay in contact with his kids, Daniel discovers that Miranda is looking for a housekeeper, and with help from his brother Frank, a makeup artist, Daniel gets the job, disguised as Mrs. Iphegenia Doubtfire, a Scottish nanny. Daniel pulls off the ruse so well that neither Miranda nor his children recognize him, and in the process, he learns some parenting tips. Daniel also has to deal with Miranda's new boyfriend, a jerk named Stu Dunmeyer.\n\nFormaat : DVD5 \nAudio: Engels \nSubs: NL subs (via menu of je AB) \nCover: niet aanwezig\n &lt;a href=&quot;\nhttp://www.moviemeter.nl/film/1062&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.moviemeter.nl/film/1062&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0107614/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0107614/&lt;/a&gt;\n\n\nHeeft u deze film gezien en wilt u ergens een recensie achterlaten?\nga dan eens naar http://www.pheunix.nl\n\nNLtopper Yakomo\t","torrent":{"xt":"urn:btih:34cd23b49d609978fb37ca8a3e944d12af7c1c41","amp;dn":"Mrs.Doubtfire+%281993%29DVD5+%28NL+subs%29NLtoppers","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"34cd23b49d609978fb37ca8a3e944d12af7c1c41","infoHashBuffer":{"type":"Buffer","data":[52,205,35,180,157,96,153,120,251,55,202,138,62,148,77,18,175,124,28,65]},"announce":[],"urlList":[]}}