{"title":"Park - 3 Albums (2001-2006) [FLAC]","uid":8283588,"size":899435327,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:35ff97c2d94a454ea14f81b9d429200a3731ca9c&amp;dn=Park+-+3+Albums+%282001-2006%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"politux","files":-1,"time":1363893810,"description":"\n  Park - 3 Albums (2001-2006) [FLAC]\n\n  2001 - No Signal\n  2003 - It Won't Snow Where You're Going\n  2006 - Building a Better ____.\n\n  Indie rock outfit Park can trace their roots to Springfield, IL, sometime in the '90s. However, lineup changes plagued the band, and by early 2006, Park was on their fourth incarnation of members. Boasting thoughtful lyrics over elements of post-hardcore, emo, and pop, the band was at times loosely described as a sonic cross between Alkaline Trio and Midtown. The band recorded the Random and Scattered EP in 1999, although by the record's 2000 release on Middle America Records, Park had broken up and re-formed with a different lineup. Original members vocalist/guitarist and primary songwriter Ladd Mitchell and guitarist Justin Valenti recruited drummer Miles Logan and bassist Tim Costello to complete the band. The EP ultimately brought Park to the attention of California's Lobster Records (the early home of Yellowcard) and they were subsequently signed.\n \n  Their label debut, No Signal, was produced by Cameron Webb (Lit, Social Distortion) and issued in October 2001. The band toured extensively behind the record over the next year, crossing the United States three times over. Returning to Illinois to start writing their next effort, Park struggled to find a new permanent bassist (Alex Haycraft ultimately got the gig) before eventually heading back to California in May 2003 to begin recording again with Webb. It Won't Snow Where You're Going appeared that November to positive critical and fan response, and once again, relentless touring commenced during 2004. Originally dubbed Building a Better Pirate, their highly anticipated third full-length was released in July 2006 with the more open-ended title Building a Better _____. It included a song (&quot;Mississippi Burning&quot;) written about the October 2005 murder of Olamide Adeyooye, girlfriend of the Junior Varsity's Andy Wildrick. Valenti exited the group following the album's completion to go to medical school, and ex-Too Beautiful to Die guitarist Aaron Bickle signed on in his place. True to form, the band hit the road hard in support in the months after. However, in early February 2007, Mitchell quit the band for personal reasons, thus ending Park's run; the guys played their last show that May before packing it in.","torrent":{"xt":"urn:btih:35ff97c2d94a454ea14f81b9d429200a3731ca9c","amp;dn":"Park+-+3+Albums+%282001-2006%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"35ff97c2d94a454ea14f81b9d429200a3731ca9c","infoHashBuffer":{"type":"Buffer","data":[53,255,151,194,217,74,69,78,161,79,129,185,212,41,32,10,55,49,202,156]},"announce":[],"urlList":[]}}