{"title":"The Casual Collection v1.1 (128 games)","uid":8634308,"size":23861857491,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:360d8b4079a5e6990effe40c1cea96e98d21ccdf&amp;dn=The+Casual+Collection+v1.1+%28128+games%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"IsraelHighlander","files":268,"time":1372709715,"description":"The Casual Collection is my mission to create a collection of all the precracked casual games for windows.\nAfter many months of work, using a combination of the AutoIt scripting language, the Smart Install Maker setup program &amp; batch files, I have been able to create powerful installers &amp; uninstallers. Also, I have created a simple program with menus to automate the whole install/uninstall process. This program is located at the root of the folder &amp; when opened, will display for installation only the games you've downloaded. You don't have to use it, but I recommend it.\nEach game is comprised of a small installer file &amp; a data file (located at the &quot;Data&quot; folder). You don't have to download the whole torrent if you want a specific game: just download the two files.\n\nEach newer version of the collection will have all of the games from the previous version plus more... Ultimately, I hope I will succeed in adding all of the casual games out there... I have limited upload, so this process has to be done gradually. I will upload the next version once a month unless I'm the only seeder. Those of you who downloaded a previous version, will only have to do a &quot;Force Check&quot; in your torrent software. However, I will replace specific games with better versions when needed, so you will have to re-download them. Note: all the files in v1.0 have been changed in v1.1 (no point of doing a &quot;Force Check&quot;).\n\nI accept requests for games to be included in the next version, as long as there is a trial version of them in a big casual games site (Big Fish, iWin, Alawar, Iplay, etc.). I download the trial version, remove the protection &amp; create the installer.\n\nThe &quot;Redist&quot; folder contains various packages, which must be installed in order for all the games to work properly, the present ones &amp; the ones in the future.\n&quot;Microsoft .NET Framework 3.5&quot; is not needed to be opened if you use Windows 7.\n&quot;Microsoft DirectX Runtime 9.0c&quot; must also be installed in Windows 7, although the operating system comes built-in with DirectX 11.","torrent":{"xt":"urn:btih:360d8b4079a5e6990effe40c1cea96e98d21ccdf","amp;dn":"The+Casual+Collection+v1.1+%28128+games%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"360d8b4079a5e6990effe40c1cea96e98d21ccdf","infoHashBuffer":{"type":"Buffer","data":[54,13,139,64,121,165,230,153,14,255,228,12,28,234,150,233,141,33,204,223]},"announce":[],"urlList":[]}}