{"title":"John Shuttleworth's Lounge Music 1/5","uid":10546111,"size":31726728,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:362dae1e664b45dd49d3e1194060490b35da6f46&amp;dn=John+Shuttleworth%27s+Lounge+Music+1%2F5&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"shardlow","files":1,"time":1405291599,"description":"Since the mid-1980s, aspiring singer/songwriter, John Shuttleworth has been posting audio cassettes of his &quot;finest songs to date&quot; to pop stars throughout the land, in the hope that someone would record his material. But all to no avail.\n\nHowever, the BBC has very kindly given John a series and asked him to invite pop starts to bring their music to his Sheffield home. So it is that Chas and Dave, Heaven 17, Toyah Wilcox and Lee John find themselves in John's lounge having tea with wife Mary, being flirted with by Mary's friend Joan and hassled by John's agent Ken Worthington, as they try and perform not only one their greatest hits but more importantly, one of John's.\n\nIn the first show John welcomes Chas Hodges from Chas and Dave into the lounge. But where's Dave? Has he heard that Mary won't allow jellied eels in the house or didn't he want to come?\n\nWhatever the reason, Chas will have to perform on his own using John's trusty keyboard although, as he's been influenced by Jerry Lee Lewis, John warns him that he won't tolerate any feet on the keyboard. \nWritten and Performed by Graham Fellows. Episode 1 of 5","torrent":{"xt":"urn:btih:362dae1e664b45dd49d3e1194060490b35da6f46","amp;dn":"John+Shuttleworth%27s+Lounge+Music+1%2F5","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"362dae1e664b45dd49d3e1194060490b35da6f46","infoHashBuffer":{"type":"Buffer","data":[54,45,174,30,102,75,69,221,73,211,225,25,64,96,73,11,53,218,111,70]},"announce":[],"urlList":[]}}