{"title":"The Anthony Cumia Show 2015-03-25 MP4 MP3 combo","uid":11777474,"size":278442027,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:38bf161ed6f75a98eda7663dafb4c98d60a1e316&amp;dn=The+Anthony+Cumia+Show+2015-03-25+MP4+MP3+combo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"mothergoose58","files":2,"time":1427383319,"description":"*** CAUTION: 100% UNCENSORED CONTENT!!! ***\n\n-NOT FOR VIEWING BY CHILDREN OR THE FAINT OF HEART-\n\nFresh off his &quot;separation&quot; from SiriusXM, Anthony Cumia, formerly of The Opie and Anthony Show launches his live, uncensored HD video webcast at AnthonyCumia.com Monday-Thursday 4pm-6pm EST. Current events, politics, news and anything can and will be discussed with celebrity guests and comedians stopping by as well. This show is not for those who are inclined to be &quot;politically correct&quot; and will contain boundary-pushing language and topics. Proceed with caution...\n\nEpisode 134 - &quot;She's Bald!&quot; TACS begins with news that Army Sgt. Bowe Bergdahl will be charged with desertion and misbehavior toward the enemy, Ant breaks down the movie &quot;Unbroken&quot;, we learn that the Japanese navy now has the biggest warship since World War 2, briefly look at a few Iranian cars, and the charming callers have at it. We get an update on TACS app, new studio, and a teaser of upcoming events, learn about the &quot;Opie and Anthony brand&quot; and how SiriusXM is allowed to use it, see a tough guy video, a video from REAL racist cops in Ft. Lauderdale, and hear the new entries for the &quot;Most Offensive Song&quot; contest. Ant then plays a Jeopardy clip with bald Michelle Obama, talks about the dangers of being on the phone while driving and cameras being put into teens cars, hear a sweet ditty about our favorite needy twat Jenny Hutt, and Anthony reiterates he doesn't want kids before playing a video of a man finding out he's going to be a dad. We see a video of an insane new roller coaster at Carowinds, talk about the (broken) black box being found from the Germanwings crash and theories of how the plane crashed, find out an 18-year-old Mariel Hemingway rebuffed Woody Allen's advances, get &quot;breaking news&quot; via a post Opie put on his Facebook which triggers an &quot;Ant rant&quot;, he calms down with kitty clips, we watch a nudie bath scene with Mariel Hemingway, and end Wednesday with an article about Samsung's bendable phone that will be out next year.\n\n\nIncludes an MP4 video file and an MP3 audio file; download both or only what you need and please seed!\n\nNew ups at: http://thepiratebay.se/user/mothergoose58/\n\nSubscribe at AnthonyCumia.com!!!","torrent":{"xt":"urn:btih:38bf161ed6f75a98eda7663dafb4c98d60a1e316","amp;dn":"The+Anthony+Cumia+Show+2015-03-25+MP4+MP3+combo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"38bf161ed6f75a98eda7663dafb4c98d60a1e316","infoHashBuffer":{"type":"Buffer","data":[56,191,22,30,214,247,90,152,237,167,102,61,175,180,201,141,96,161,227,22]},"announce":[],"urlList":[]}}