{"title":"Smarty Uninstaller 4.5.0 [EN/MULTI] - Uploaded by MonstersBugle","uid":15258052,"size":17329271,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:38f38575e2c3aeabda98c8768041b91bc1c27d09&amp;dn=Smarty+Uninstaller+4.5.0+%5BEN%2FMULTI%5D+-+Uploaded+by+MonstersBugle&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"MonBug","files":7,"time":1468151211,"description":"Smarty Uninstaller 4.5.0 [EN/MULTI] - Uploaded by MonstersBugle\r\n\r\nSoftware Version: 4.5.0\r\nOfficial website: link\r\nLanguage: Russian, English, etc.\r\n\r\nTreatment: Complete\r\nType of medicine: the replacement of files\r\n\r\nSystem requirements:\r\nMicrosoft Windows XP SP3, Vista, 7, 8, 10 (32-bit &amp; 64-bit)\r\n\r\nDescription:\r\nSmarty Uninstaller - powerful, but at the same time very easy to use program that allows you to completely remove the selected application from the system. It works even with software that has corrupted uninstallers. Deletes all entries from the registry and the computer's hard disk. The program can show the appropriate application icons and additional information about each installed program. Smarty Analyzer module thoroughly scan your computer and remove the files left over from the already remote programs.\r\n\r\nAdditional Information:\r\n• Completely removes applications from your PC (all files, shortcuts and registry entries)\r\n• Easy to use and modern user interface allows to comfortably work with Smarty Uninstaller!\r\n• Very fast and reliable. A more convenient solution than regular Windows Add / Remove.\r\n• Smart Protection feature. This feature protects critical system components. You can not delete system files accidentally or in any other form.\r\n• Uninstall applications using drag and drop and context menu! Just drag and drop the application icon on Smarty Uninstaller icon on the desktop. Or choose appropriate command in context menu (right mouse click).\r\n• Creating queue requests for analysis or disposal (can select more than one application at the same time)\r\n• Smarty Analyzer will deeply scan your computer for traces left by selected application.\r\n• Group uninstall application with broken Uninstaller! Complete removal.\r\n• Automatically detects invalid installations and give ways to solve them\r\n• Detailed information about the application (name, version, size, mounting location, etc.)\r\n• Create and Print detailed reports about installed applications. (HTML markup)\r\n• Smarty Analyzer will deeply scan your computer for traces left by selected application.\r\n• Backing up the system directly from Smarty Uninstaller.\r\n• Useful tips and detailed Help provide you with all the information necessary to work with him.\r\n• Fast search feature allows to quickly find application you need.\r\n\r\nThe procedure for treatment:\r\nReplace the files from the folder Crack in a folder with the installed program\r\n\r\nScreenshots: \nhttp://extraimago.com/image/atgG \nhttp://extraimago.com/image/atgX \nhttp://extraimago.com/image/atgg","torrent":{"xt":"urn:btih:38f38575e2c3aeabda98c8768041b91bc1c27d09","amp;dn":"Smarty+Uninstaller+4.5.0+%5BEN%2FMULTI%5D+-+Uploaded+by+MonstersBugle","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"38f38575e2c3aeabda98c8768041b91bc1c27d09","infoHashBuffer":{"type":"Buffer","data":[56,243,133,117,226,195,174,171,218,152,200,118,128,65,185,27,193,194,125,9]},"announce":[],"urlList":[]}}