{"title":"Charlier - 36 Etudes for Trumpet (New - Sample wFonts).pdf","uid":4437952,"size":145096,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:391aa9aea026df755d01edc6de945a623923c5c7&amp;dn=Charlier+-+36+Etudes+for+Trumpet+%28New+-+Sample+wFonts%29.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"michaelingeorgia","files":1,"time":1223661087,"description":"This PDF file features the first two of Charlier&amp;#039;s famous ADVANCED ETUDES FOR TRUMPET. \n\n\nThis edition is part of an ongoing project to completely re-typeset this indispensable work for the modern age. In addition to razor-sharp printing (using Coda Music&amp;#039;s FINALE, the industry standard for musical typesetting), it is also designed for printing on standard 8.5 x 11 pages (the original printing is a larger non-standard size which easily became ragged and torn when carried around).  The emphasis is on an extremely high degree of legibility, using multiple pages when necessary. \n\nThis is NOT a re-edit. All of the original edition&amp;#039;s markings (slurs, ties, breath marks, text notations, etc), are all faithfully reproduced (the exception being a somewhat reduced number of &quot;courtesy&quot; accidentals, which in no way affects the final performance). Again, the goal of this project is to create a printed version for a modern age, but not to re-edit the content of the music itself.\n\nI am putting these two completed etudes out in order to get feedback on the project, so as to hear what other trumpet players feel works or doesn&amp;#039;t work. So, if you&amp;#039;d like to see the complete edition, please leave your comments. My goal is to re-typeset one etude per day over the next month, followed by a couple of days of final proofing.\n\nEnjoy!\n","torrent":{"xt":"urn:btih:391aa9aea026df755d01edc6de945a623923c5c7","amp;dn":"Charlier+-+36+Etudes+for+Trumpet+%28New+-+Sample+wFonts%29.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"391aa9aea026df755d01edc6de945a623923c5c7","infoHashBuffer":{"type":"Buffer","data":[57,26,169,174,160,38,223,117,93,1,237,198,222,148,90,98,57,35,197,199]},"announce":[],"urlList":[]}}