{"title":"There's Corpses Everywhere Another Lio Collection ","uid":10226629,"size":188216767,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:3a0cd1ee0e2a6c39d60e4954fbcbd887b7568c79&amp;dn=There%27s+Corpses+Everywhere+Another+Lio+Collection+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"LeonardTSpock","files":-1,"time":1401091986,"description":"Happiness is a squishy cephalopod... I love Lio, and I don't believe in guilty pleasures, so I love Lio openly and honestly. Lio makes me laugh. As you may have guessed from my uploads, my sense of humor is a bit thin, or at the very least, dark. And still, Lio makes me laugh. And Lio makes me smile. It makes me laugh and smile in the the same way that The Far Side or Calvin and Hobbes made me laugh and smile, only its darker and more twisted than either of those examples. For me, there can never be too many Lio books, so I'm quite happy to have a few more to upload...\n\n-------------------------------------------------------------------------------\n\nThere's Corpses Everywhere - Yet Another Lio Collection\n\nMark Tatulli\n\nAndrews McMeel Publishing, 2010, 128 pages\n\nEmmy award-winning animator and producer Mark Tatulli's comic strip Lio is dark, twisted, visually stunning and totally irresistible. Lio is a curios scientist, a comic-book fan, defender of the defenseless and creator of an army of robot zombie bunnies, all without saying a word.\n\nThrough the age-old style of pantomime strips, Tatulli's Lio offers a decidedly new and edgy twist to the wordless comic format. That's right--Lio is so crafty it doesn't need word balloons, dialogue boxes, or copious captions. Employing a unique drawing style influenced by cartooning greats Gahan Wilson, Charles Addams, and 19th-century satirist A. J. Volck, Tatulli's cartoon creation is completely nonsyllabic but dramatic nonetheless, and was awarded as 2009's Best Newspaper Comic Strip by the National Cartoonists Society.\n\nThe result of Tatulli's creativity is a mind-bending, comical, and astute journey into the darkly detailed world of spiky-haired Lio, a curious young scientist and comic book fan whose daydreams embark from the dark chasm where wit and sarcasm collide.\n\nDefender of the defenseless and the inventor of a legion of zombie bunnies, Lio is joined in his day-to-day exploits by his exasperated and sleep-deprived father, a pet snake named Frank, a squid named Ishmael, and various imaginary robots and creepy, crawly monsters. Within this humorously macabre framework of sarcasm, parody, and high jinx, sidesplitting laughter abounds--all without so much as a word. ","torrent":{"xt":"urn:btih:3a0cd1ee0e2a6c39d60e4954fbcbd887b7568c79","amp;dn":"There%27s+Corpses+Everywhere+Another+Lio+Collection+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3a0cd1ee0e2a6c39d60e4954fbcbd887b7568c79","infoHashBuffer":{"type":"Buffer","data":[58,12,209,238,14,42,108,57,214,14,73,84,251,203,216,135,183,86,140,121]},"announce":[],"urlList":[]}}