{"title":"Submerged - RELOADED","uid":12201666,"size":1283233035,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:3b8d3a5ae5c06da27ce20c2fba47d396e9031b45&amp;dn=Submerged+-+RELOADED&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"OvoJeKraj","files":3,"time":1438846200,"description":"1. Burn or mount the image.\n2. Install the game.\n3. Copy over the cracked content from the /Crack directory on the image to\nyour game install directory.\n4. Play the game.\n\nSubmerged is a third-person combat-free game in which you explore a\nmysterious flooded city and discover the beauty of desolation in vast\noutdoor environments. You take on the role of Miku, a young girl who has\nbrought her wounded brother to the city in their small fishing boat.\nNavigate the flooded city streets by boat, scale the drowned buildings, and\nuse your telescope to scour the city for the supplies needed to save your\ndying sibling. As you explore the city at your own pace, you encounter the\nhabitat that flourishes in this colorful place and discover hidden objects\nthat piece together the story of a broken world and a broken family.Game\nFeatures- Vast outdoor environments with a rich, colorful and vibrant\nhabitat present the player with a beautiful place to linger during the day\nor night, and encounter the mysterious remnants that watch you from the\nrooftops.- A serene and relaxing game experience; take your time to enjoy\nthe sunrise and beautiful vistas, listen to the sound of the ocean, or\nobserve the playfulness of the creatures that inhabit this place. There is\nonly one pace in this game and that's your own.- Discover the hidden\nobjects that piece together the story of redemption, sacrifice and\ndetermination, and learn more about how the city came to be this way.-\nCruise through the city streets in your small powered fishing boat, using\nyour telescope to identify which of the various buildings contain supplies\nand mark them on your map.- Discover the best path to the objects you\nspotted from afar. Dock your boat at tall buildings and landmarks and climb\nthe vines, ladders, ledges and pipes as increasingly difficult navigation\npuzzles.- Developed by an independent studio based in Australia, consisting\nof AAA veterans who have previously worked on the BioShock series, with\nmusic from BAFTA award winning composer Jeff van Dyck","torrent":{"xt":"urn:btih:3b8d3a5ae5c06da27ce20c2fba47d396e9031b45","amp;dn":"Submerged+-+RELOADED","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3b8d3a5ae5c06da27ce20c2fba47d396e9031b45","infoHashBuffer":{"type":"Buffer","data":[59,141,58,90,229,192,109,162,124,226,12,47,186,71,211,150,233,3,27,69]},"announce":[],"urlList":[]}}