{"title":"The Verdict (1982) 720p DivX HD (2.55GB) moviesbyrizzo ","uid":6616510,"size":2738637190,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:3c099d4713d14c36de741a7e16d81f9b7a346db5&amp;dn=The+Verdict+%281982%29+720p+DivX+HD+%282.55GB%29+moviesbyrizzo+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"moviesbyrizzo","files":-1,"time":1313815563,"description":" &lt;a href=&quot;http://www.imdb.com/name/nm0912001/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.imdb.com/name/nm0912001/&lt;/a&gt;\n\n1280 x 696 at 2600k video bitrate, 256k audio 23.976fps 2:07:24 runtime\n\nEnglish subtitles template included as are Russian subtitles \n\n- converted from an 8.34GB 720p HDTV ENG-RUS torrent source - \nSpaceba for the superfast torrent download (14mbps average combined torrent\ndownload speed) - although that's a huge filesize for many I would thing - \nwho I hope will be happier to spread the joy with our 2.55GB version for more\nto share! That speed would go a longer way here too!\n\nIf I could point to one still outstanding issue with the management of the\nmovie industry it would be the sheer arrogance in holding back formats from\nmovie constituents that they are insane to be doing. Bloody well so insanely\narbitrary and high handed an approach as to render them neanderthal in the \nbusiness of making decisions on community cultural property - as I submit\nthese great productions from the past have in fact been - based on merit that\nhas since &quot;gone with the wind&quot; over to some &quot;equal rights activist&quot; that is\nmainly space-robotic-techno video game based in silly and neurotic exotic\ninclinations on what are now matters of taste as they see them still.\nSuch people should lose their right to govern in this industry.\n\nNote: As I write this note, we do not have movies such as &quot;The Remains of\nthe Day&quot; &quot;Tootsie&quot; &quot;Victor Victoria 1982&quot; &quot; Tin Men - Danny Devito&quot;  \n&quot;White Mischief - Greta Scacchi&quot; &quot;Inherit the wind&quot; &quot;The Last days of Disco&quot;\n&quot;The House of Games&quot; and many more movies are being held back from being\nmade available in the standard formats of today (bluray 720p 1080p etc)\nfor no other reason than there is no accountability for rip off and Scrooge\nlike approaches to marketing and stewardship decisions here on making\nthe available quality available - to benefit all concerned. What\nhave they to legitimately lose or be scared of in doing so? Thank goodness\nfor HDTV and the torrent facility we have instead - just as well the movie\nindustry do without the revenues as long as we can get the product - if they\nare too inane to care about doing the right thing for those that want that disc\n- even from the video rental store at a couple of dollars a pop. It certainly \njustifies a reasonably sized torrent in the interim and forever more - amen!\nTorrents are a legitimate way to meet these sorts of balancing needs in a fair\nsociety I say! \n\nMichael Rizzo Chessman - moviesbyrizzo\n\nThis is a great movie from the master screen-playwright - Pullitzer\nprize Laureate Mr. David Mamet and co-starring his lovely wife along\nthe way, Ms. Lindsay Crouse as the caring and principled Nurse Ms. Kaitlin\nCostello. The late Mr. Paul Newman turns in a masterful and brilliant \nperformance - one of the best ever in movie making history. Mamet also\ngave us &quot;House of Games&quot; which starred Lindsay Crouse in similar fashion\nwith lovely beauty that is in her spirit.\n\nThe wicked Doctor Towler et al deserved to receive the stiffest sanctions\nfor their cruel misdeeds in the movie plot and life generally that have this\nmindset and this movie does the right thing to expose this genre for what is\na complete absence of an idea of integrity in how they treat others in their\nspace of control. Its not what they do as much as the obvious venomous attitude\nthat is the problem I suggest. Enjoy the show - I cant believe how much\nnicer a 720p is even on my wide screen computer display compared to standard\n480p etc. Get yourself a nice bluray/DivX HD disc player if you haven't as yet -\nits worth the hundred I assure you, and I hope the old DVD formats will disappear\naltogether given the huge difference in quality that truly is worth paying for\nonce more!\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n","torrent":{"xt":"urn:btih:3c099d4713d14c36de741a7e16d81f9b7a346db5","amp;dn":"The+Verdict+%281982%29+720p+DivX+HD+%282.55GB%29+moviesbyrizzo+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3c099d4713d14c36de741a7e16d81f9b7a346db5","infoHashBuffer":{"type":"Buffer","data":[60,9,157,71,19,209,76,54,222,116,26,126,22,216,31,155,122,52,109,181]},"announce":[],"urlList":[]}}