{"title":"Abducted - How People Come To Believe They Were Kidnapped By Ali","uid":8785352,"size":644468,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3cf2dfba23c1481955e39caf280113a257c818cf&amp;dn=Abducted+-+How+People+Come+To+Believe+They+Were+Kidnapped+By+Ali&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"GoonerTPB","files":1,"time":1375819332,"description":"Abducted: How People Come to Believe They Were Kidnapped by Aliens\n\nSusan A. Clancy\nPublisher:   Harvard University Press\nNumber Of Pages:   192\nPDF\nPublication Date:   2007-04-30\nISBN-10 / ASIN:   067402401X\n\nThey are tiny. They are tall. They are gray. They are green. They survey our world with enormous glowing eyes. To conduct their shocking experiments, they creep in at night to carry humans off to their spaceships. Yet there is no evidence that they exist at all. So how could anyone believe he or she was abducted by aliens? Or want to believe it?\n\nTo answer these questions, psychologist Susan Clancy interviewed and evaluated &quot;abductees&quot;--old and young, male and female, religious and agnostic. She listened closely to their stories--how they struggled to explain something strange in their remembered experience, how abduction seemed plausible, and how, having suspected abduction, they began to recollect it, aided by suggestion and hypnosis.\n\nClancy argues that abductees are sane and intelligent people who have unwittingly created vivid false memories from a toxic mix of nightmares, culturally available texts (abduction reports began only after stories of extraterrestrials appeared in films and on TV), and a powerful drive for meaning that science is unable to satisfy. For them, otherworldly terror can become a transforming, even inspiring experience. &quot;Being abducted,&quot; writes Clancy, &quot;may be a baptism in the new religion of this millennium.&quot; This book is not only a subtle exploration of the workings of memory, but a sensitive inquiry into the nature of belief.","torrent":{"xt":"urn:btih:3cf2dfba23c1481955e39caf280113a257c818cf","amp;dn":"Abducted+-+How+People+Come+To+Believe+They+Were+Kidnapped+By+Ali","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3cf2dfba23c1481955e39caf280113a257c818cf","infoHashBuffer":{"type":"Buffer","data":[60,242,223,186,35,193,72,25,85,227,156,175,40,1,19,162,87,200,24,207]},"announce":[],"urlList":[]}}