{"title":"The Darwin Effect - Jerry Bergman","uid":11772870,"size":2247750,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3cf701f8089f1f2417f2386f9ba3a797797421f8&amp;dn=The+Darwin+Effect+-+Jerry+Bergman&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"starxteel","files":1,"time":1427145486,"description":"Dr. Miklos (Michael) Nyiszli, an imprisoned doctor in the Auschwitz camp, wrote that Nazi doctors hoped studying twins would solve the problem of faster reproduction of superior races. Nazis hoped to have each German mother bear as many twins as possible. What Darwin influenced went far beyond the Nazi death camps:\n\nShocking political, social, and scientific legacies of Darwin and his family\nDisturbing disclosure of how over 45 million Christians were killed in the 20th century because of their faith\nRevealing and layman-friendly presentation.\n\nThis book is the result of 30 years of research and study carefully documenting the common destructive threads that tie some of history?s most murderous dictators, uncaring capitalists, and aggressive social activists to the flawed concepts of Charles Darwin in an effort to change the world - and how they succeeded. The extermination of races considered ?lower? than others, the profound lack of empathy for less-advanced cultures, the corrupted atheistic justifications for taking the lives of millions - all done to advance the agendas of social Darwinism at work in the world today. More than mere theoretical discussions, we have seen the horrifying evidence of the practical results when applying these destructive and misleading concepts to society in the last 100 years!\n\nAbout the author:\nDr. Jerry Bergman has taught biology, genetics, chemistry, biochemistry, anthropology, geology, and microbiology at the college level for over 30 years. He has 9 degrees, including 7 graduate degrees, and has authored over 800 publications. He is the author of The Dark Side of Charles Darwin and the co-author of In Six Days and Persuaded by the Evidence","torrent":{"xt":"urn:btih:3cf701f8089f1f2417f2386f9ba3a797797421f8","amp;dn":"The+Darwin+Effect+-+Jerry+Bergman","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3cf701f8089f1f2417f2386f9ba3a797797421f8","infoHashBuffer":{"type":"Buffer","data":[60,247,1,248,8,159,31,36,23,242,56,111,155,163,167,151,121,116,33,248]},"announce":[],"urlList":[]}}