{"title":"Feast Days of the Lord","uid":8500163,"size":908175061,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:3e636c1897df36834c979f8876dea5e562d5ca95&amp;dn=Feast+Days+of+the+Lord&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ba1923","files":-1,"time":1369276218,"description":"There are 7 Feast Days or appointed times of the Lord. These are the Lords &quot;Holy Days&quot; for all believers. They are not just for the Jews. Whether Christian or Jew- we are all accountable for recognizing the appointed days. Observing and celebrating the appointed days should be an important part of all of our lives.\n\nThis study is not meant to convert Jews to Christianity nor Christians to Judaism. It is meant to help bring people to &quot;Truth&quot;. In Jewish tradition there are 2 Messiahs- Mashiach Ben Yosef and Mashiach Ben David. One is the suffering servant and the other the conquering King.In Christianity the Messiah has already came as the suffering servant to pay for everyone's sins and will come again as the conquering King.\n\nChristians have been accusing Jews of missing the time of the Lord's visitation for thousands of years. The Jews have been celebrating the &quot;Feast Days&quot; for over 3,500 years. When the Shofar blasts on Yom Teruah, most Jews understand what that means. Most Christians,however, don't understand the significance. Most Churches do not recognize the &quot;Feast Days&quot; because they think they are only for the Jews. Satan works by deception. If he can fool people from knowing and watching the appointed Days, he knows those days will come upon them as a thief in the night.\n\n\n","torrent":{"xt":"urn:btih:3e636c1897df36834c979f8876dea5e562d5ca95","amp;dn":"Feast+Days+of+the+Lord","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3e636c1897df36834c979f8876dea5e562d5ca95","infoHashBuffer":{"type":"Buffer","data":[62,99,108,24,151,223,54,131,76,151,159,136,118,222,165,229,98,213,202,149]},"announce":[],"urlList":[]}}