{"title":"3ds Max 2012 Bible nodvd","uid":7705029,"size":307754368,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3e724e4e64bcbf25adf7f6c21699f1a760f8a395&amp;dn=3ds+Max+2012+Bible+nodvd&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"no1453","files":-1,"time":1349664652,"description":"3ds Max 2012 Bible is one of the most popular 3ds Max how-tos on the market. If you're a beginner just itching to create something right away, the Quick Start project in Part 1 is for you. If you're an experienced user checking out 3ds Max 2012's latest and greatest features, you'll love the fact that the 3ds Max 2012 Bible continues to be the most comprehensive reference on this highly complex application.Find out what's new, what's tried and true, and how creative you can get using the tips, tricks, and techniques in this must-have guide. Don't miss the 16-page color insert with examples from cutting-edge 3D artists, as well as the DVD packed with all kinds of extras.\n\nLoaded with expert advice, timesaving tips, and more than 150 step-by-step tutorials\nHighlights the work of some of today's most cutting-edge 3D artists in a 16-page color insert\n\nThe book for all things 3ds Max\n\nWhether you're a beginner in search of 3D basics or a veteran animator seeking timesaving tips, the new edition of this perennial favorite is the perfect 3ds Max book for you. Packed with the very latest features, professional techniques, and over 150 step-by-step tutorials, it will help you quickly build your skills. Find out what's new, what's tried and true, and how creative you can get with this must-have guide.\n\n\n**********************************************************\n\nuploader note:  pdf file was converted from epub file.\n","torrent":{"xt":"urn:btih:3e724e4e64bcbf25adf7f6c21699f1a760f8a395","amp;dn":"3ds+Max+2012+Bible+nodvd","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3e724e4e64bcbf25adf7f6c21699f1a760f8a395","infoHashBuffer":{"type":"Buffer","data":[62,114,78,78,100,188,191,37,173,247,246,194,22,153,241,167,96,248,163,149]},"announce":[],"urlList":[]}}