{"title":"Tottemo Pheromone [English] (18+)","uid":4095941,"size":1460044855,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:3f04dd2f44d5e0bbb0ee92d7e0068212a6ed2d23&amp;dn=Tottemo+Pheromone+%5BEnglish%5D+%2818%2B%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"SmoothRKJ","files":5,"time":1206316275,"description":"I uploaded this because there isn't any more releases of this game on the web.\n\nSo, Enjoy!\n\n******************************CONTENT DISCLAIMER*******************************\nTottemo Pheromone is an adult bishoujo game, meaning it contains sex. Therefore\nit is intended solely for people over the age of 18.  If you are of age and\nstill find such material objectionable, then you probably have no interest in\nplaying this game or reading this FAQ.\n*******************************************************************************\n\nG-Collections offers a wide selection of bishoujo games!\nVisit their website : www.g-collections.com\n\n-=-=--=-=-====----===-=-=-=-=--=-==-=-=-=-=-=-=-=-=-=-=-=-=-=-===-=-=-=-=-==-==\n                                i. INTRODUCTION\n=--=-=-==-=-=---===---===-=-=-=-=-=-==-=-=-=-=-=-=-=-=-==-=-=-=-==-=====-=-=-=-\n\nTakuya Sakuragi's life is going well; he's moving to the big city to attend\nuniversity.  Not being able to afford a place of his own, Takuya has arranged\nto move in with his cousin, Takashi, and his wife, Silk.  In return, he's\nhelping out at Takashi's cake shop, where he meets some beautiful women,\nemployees and customers alike.  All these girls seem to have huge crushes on\nTakashi, which works out well for Takuya since he resembles his cousin.  Before\nTakuya can even consider making a move, though, something extraordinary occurs.\n\nThe first night in the Sakuragi apartment, a beautiful girl materializes out\nof thin air.  Her name is also Silk, and she's been cursed to jump between\nworlds for all of eternity.  But she has a plan, a way to reach her homeland.\nIf she can collect different types of magic, she can cast a spell to break\nthe curse.  Unfortunately for her, the most plentiful source of this magic is\nyoung girls, and in order to get it, one must have sex with them!\n\nThis is where Takuya comes in.  Obviously, Silk can't gather the magic alone,\nso she enlists Takuya as her servant.  Casting a spell on Takuya that greatly\nenhances his natural attractiveness, Silk sends him out to collect the magic\nshe needs.  You, the player, must guide Takuya through this ordeal.  Will you\nchoose to help Silk, but take advantage of the girls in the process? Or will\nyou respect the girls, but turn your back on Silk?  Not every choice in this\ngame is an easy one.  Face Takuya's dilemma, and hopefully you will find the\nhappy ending you desire.  Good luck!\n\nOne hell of a bishoujo game! The best I've ever played!\n\nBTW, the introduction &amp; content disclaimer come from Ben Woodhouse's walkthrough, which is included in this release.\n\nEDIT: Date: 14 December 2008 | Reason: Corrected spelling and grammar, plus any occasional &quot;///&quot; which may appear in texts.","torrent":{"xt":"urn:btih:3f04dd2f44d5e0bbb0ee92d7e0068212a6ed2d23","amp;dn":"Tottemo+Pheromone+%5BEnglish%5D+%2818%2B%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3f04dd2f44d5e0bbb0ee92d7e0068212a6ed2d23","infoHashBuffer":{"type":"Buffer","data":[63,4,221,47,68,213,224,187,176,238,146,215,224,6,130,18,166,237,45,35]},"announce":[],"urlList":[]}}