{"title":"Kate Bush - The Sensual World (1989) [EAC-LAME 320kbps]","uid":4641727,"size":110367398,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:3f616cd6c50a792e875fb25409d20cf0df830699&amp;dn=Kate+Bush+-+The+Sensual+World+%281989%29+%5BEAC-LAME+320kbps%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"h_benotto","files":11,"time":1231739088,"description":"An enchanting songstress, Kate Bush reflects the most heavenly views of love on the aptly titled The Sensual World. On the follow-up to Hounds of Love, Bush is unafraid to be a temptress, vocally and lyrically. She's a romantic, frolicking over lust and love, but also a lover of life and its spirituality. The album's title track exudes the most sensually abrasive side of Bush, but she is also one to remain emotionally intact with her heart and head. The majority of The Sensual World beams with a carefree spirit of strength and independence. &quot;Love and Anger,&quot; which features blistering riffs by Bush's mentor and cohort David Gilmour, thrives on self-analysis -- how typically cathartic of Bush. Michael Nyman's delicate string arrangements allow the melodic &quot;Reaching Out&quot; to simply arrive, freely floating with Bush's lush vocalic declaration -- &quot;reaching out for the star/reaching out for the star that explodes&quot; -- for she's always searching for a common peace, a commonality to make comfort. What makes this artist so intriguing is her look toward the future -- she appears to look beyond what's present and find a peculiar celestial atmosphere in which human beings do exist. She's conscious of technology on &quot;Deeper Understanding&quot; and of a greater life on the glam rock experimental &quot;Rocket's Tail (For Rocket),&quot; yet she's still intrinsic to the reality of an individual's heart. &quot;Between a Man and a Woman&quot; depicts pressure and heartbreak, but it's the beauty of &quot;This Woman's Work&quot; that makes The Sensual World the outstanding piece of work that it is. She possesses maternal warmth that's surely inviting, and it's something that's made her one of the most prolific female singer/songwriters to emerge during the 1980s. She's never belonged to a core scene. Bush's intelligence, both as an artist and as a woman, undoubtedly casts her in a league of her own.","torrent":{"xt":"urn:btih:3f616cd6c50a792e875fb25409d20cf0df830699","amp;dn":"Kate+Bush+-+The+Sensual+World+%281989%29+%5BEAC-LAME+320kbps%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3f616cd6c50a792e875fb25409d20cf0df830699","infoHashBuffer":{"type":"Buffer","data":[63,97,108,214,197,10,121,46,135,95,178,84,9,210,12,240,223,131,6,153]},"announce":[],"urlList":[]}}