{"title":"Lord Fowl - Endless Dynamite   mp3 Vbr (2009)","uid":11102402,"size":74145687,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:3fc29ad930cbf4bbb19b0eb24af71943ecd37b24&amp;dn=Lord+Fowl+-+Endless+Dynamite+++mp3+Vbr+%282009%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"analogkid6103","files":12,"time":1411686799,"description":" Back in 2006, longtime New Haven, CT mainstays, Vechel Jaynes and Donny Freeman had a conversation over drinks. They wanted to play music like the stuff they heard when they were younger. As kids they were enthralled by the arena acts of the 70's (Cheap Trick, Queen, Kiss) and heavier underground acts such as Angelwitch and Motorhead, but also identified with the politics and ferocity of bands like The Clash and Black Flag. Adding the sounds of Motown and psychedelic protest they heard whilst in the womb, a decision was made.\n\nThey found a like-minded band mate in Mike Pellegrino, who was looking to depart from the sounds he made with Spring Heeled Jack, still a wildly popular band from the early 90's. Vechel had grown weary of the uber- violent CT hardcore scene which he had played a vital role in (having played in 100 Demons and Jasta 14, a band that at one time included Hatebreed singer Jamey Jasta).\n\nLord Fowl was immediately thrust into the &quot;stoner&quot; category, but upon watching their live show, it's hard to group them with some of the apathetic &quot;hipster&quot; bands they have shared a stage with. Lord Fowl jumps around. They perform. They are heavy but actually sing melodic vocal lines. And perhaps most importantly they care. They have retained a sense of outrage at the unjust world around them, an attitude that is common among people  who grew up in the Reagan years.\n\nAfter recording their debut &quot;Endless Dynamite&quot;, Vechel switched over to guitar and long time friend and sound engineer John Conine was hired to take over bass duties.  On September 23rd, the release date of Endless Dynamite, Vechel will be heading out on a US tour as lead guitarist for Talib Kweli but will undoubtedly return to tour venues  nationwide and beyond with Lord Fowl.                                                                               Lord Fowl - Endless Dynamite (2009)                                                                         01 - Cheetah\n02 - Eye of the Sun\n03 - Coming Down Easy\n04 - Bird of Good Omen\n05 - Red Planet\n06 - The Torturer\n07 - Animal\n08 - Lids\n09 - Rocky [Thin Lizzy cover]\n10 - Terminus Est\n11 - Stonedown                                                              \nLineup:\n\nQuote:\nDon Freeman - Drums\nVechel Jaynes - Bass, Vocals\nMike Pellegrino - Guitar, Vocals","torrent":{"xt":"urn:btih:3fc29ad930cbf4bbb19b0eb24af71943ecd37b24","amp;dn":"Lord+Fowl+-+Endless+Dynamite+++mp3+Vbr+%282009%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3fc29ad930cbf4bbb19b0eb24af71943ecd37b24","infoHashBuffer":{"type":"Buffer","data":[63,194,154,217,48,203,244,187,177,155,14,178,74,247,25,67,236,211,123,36]},"announce":[],"urlList":[]}}