{"title":"Wagner - Gotterdammerung (Keilberth Bayreuth 1955) [ape cue]","uid":4689863,"size":1432427223,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:40c510a030cf4a2dea70ff8e6163e697a84a7fa9&amp;dn=Wagner+-+Gotterdammerung+%28Keilberth+Bayreuth+1955%29+%5Bape+cue%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"sou_argo_toran","files":25,"time":1233353958,"description":"Por fin llegÃƒÂ³ El ocaso de los dioses y ya tenemos completo, reluciente, cincuenta y un aÃƒÂ±os despuÃƒÂ©s, el esperado primer Anillo en estÃƒÂ©reo. Se han cumplido las expectativas, ahora ya sabemos que las dos ÃƒÂºltimas jornadas fueron lo mejor de un ciclo globalmente sobresaliente y resisten cualquier comparaciÃƒÂ³n posible. Lo que anticipÃƒÂ© que podrÃƒÂ­a suceder, ya podemos decirlo: dada la calidad artÃƒÂ­stica del conjunto, en estas condiciones tÃƒÂ©cnicas podemos considerarlo sin muchas dudas la versiÃƒÂ³n de referencia. Cierto que en algunos pasajes echamos de menos la profundidad de &quot;Kna&quot;, que cala mÃƒÂ¡s hondo en la mÃƒÂºsica y en el mensaje. No obstante, conviene recordar que en las tres tetralogÃƒÂ­as que conocemos por ÃƒÂ©l no todas las jornadas estuvieron al mismo nivel (el &quot;ideal&quot; serÃƒÂ­a una combinaciÃƒÂ³n de funciones de los tres aÃƒÂ±os), Aldenhoff --Siegfried en la segunda jornada de 1957-- es en todo inferior a Windgassen, los &quot;fijos&quot; estuvieron mejor si cabe en 1955 y --esto es definitivo-- el buen sonido monoaural no puede compararse con el atmosfÃƒÂ©rico estÃƒÂ©reo de Decca/Testament, al que me he referido extensamente en las anteriores reseÃƒÂ±as (ver nÃƒÂºmeros 147, 149 y 153 de este boletÃƒÂ­n). El sonido, de gran calidad en todas las entregas, me ha parecido superior en esta ÃƒÂºltima jornada, sin las ocasionales fluctuaciones de intensidad entre canales y con menor presencia del siseo de la cinta magnÃƒÂ©tica. Hay algÃƒÂºn leve error de editing, apreciable con auriculares y escucha atenta, por ejemplo en la Trauermusik (CD 4, pista 14, 3:02 y 5:02), de poca importancia. Si hay justicia en el mundo del disco --en el otro ya sabemos que no la hay--, este Anillo deberÃƒÂ­a arrasar en el apartado de grabaciones histÃƒÂ³ricas en los Midem Classical Awards (1).\nEn 1955 Keilberth le tenÃƒÂ­a cogida la medida a la peculiar acÃƒÂºstica del Festspielhaus de Bayreuth y a su orquesta, de la que obtuvo unos niveles de precisiÃƒÂ³n en la ejecuciÃƒÂ³n verdaderamente asombrosos en obra tan compleja y extenuante. En el Preludio y en la escena de las Nornas se echa en falta la sensaciÃƒÂ³n de que asistimos al principio del fin de un orden, el sentido de lo inevitable del destino, un destino cuyo motivo hace ya su apariciÃƒÂ³n en 1:13 del Preludio. La creciente inquietud de las Nornas ante el enmaraÃƒÂ±ado devenir de los acontecimientos no termina de encontrar eco en el foso, aunque el oyente sucumbe ante el bello sonido orquestal y la impecable labor de la cuerda --extraordinarios chelos en el amanecer, admirablemente captados por los micrÃƒÂ³fonos de Decca--. Esos veinte minutos son todo lo que necesita Keilberth para centrarse y empezar a mandar. Desde que comienza el dÃƒÂºo Zu neue Taten la\nrepresentaciÃƒÂ³n rozÃƒÂ³ la perfecciÃƒÂ³n. Keilberth es un eficaz narrador que huye de personalismos, de excesos, y despliega los entresijos de la partitura con maestrÃƒÂ­a e infalible sentido del drama (Ã‚Â¿quÃƒÂ© le pasarÃƒÂ­a en La Valquiria?). Se hace difÃƒÂ­cil destacar ejemplos aislados, pero causan una impresiÃƒÂ³n imborrable la vela de Hagen, con unos magnÃƒÂ­ficos metales (CD 2, pista 4), el Preludio del segundo acto y el motivo de la espada, molto crescendo, irrumpiendo en la soberbia Trauermusik (CD 4, pista 14, 2:30)\nEl reparto habitual se supera a sÃƒÂ­ mismo. El caso de Windgassen es digno de estudio. Ã‚Â¿QuÃƒÂ© importa que la voz no sea la idÃƒÂ³nea para la parte de Sigfrido cuando se posee todo lo demÃƒÂ¡s en abundancia? Cada nuevo ejemplo de su quehacer en los gloriosos aÃƒÂ±os 50 es una lecciÃƒÂ³n de inteligencia, musicalidad, sensibilidad, resistencia y canto expresivo apoyado en una sÃƒÂ³lida tÃƒÂ©cnica vocal. En la gran escena del juramento del segundo acto (CD 3, pista 12) pone a prueba los reflejos de Keilberth y la orquesta, que han de perseguirle a marchas forzadas o parar a esperarle. Cosas del directo. La recientemente fallecida Varnay es, como siempre, una BrÃƒÂ¼nnhilde inconmensurable: matizada, precisa, luminosa en el agudo, regulando, controlando su generoso caudal, haciendo inmaculadamente adornos que requieren una laringe ÃƒÂ¡gil, no siempre compatible con semejante volumen. En opiniÃƒÂ³n del firmante, el torvo, viscoso, perverso Hagen de Greindl no ha tenido igual. EsplÃƒÂ©ndida la pareja de guibichungos, la sentida, dulce, desvalida Gutrune de la holandesa GrÃƒÂ© Brouwenstijn, y el gran Hermann Uhde, el mejor Gunther, inseguro, noble y dÃƒÂ©bil a un tiempo, papel menor que parece escrito para su voz y que ÃƒÂ©l dignifica y eleva. La escena de Waltraute, con una convincente Maria von Ilosvay --el ÃƒÂºnico pero que cabe ponerle es el pobre La4 con que se cierra su intervenciÃƒÂ³n, que apenas sirve para ganar una apuesta-- queda para el recuerdo. El trÃƒÂ­o de ondinas estÃƒÂ¡ mÃƒÂ¡s fino que en El Oro del Rin y convierte la otras veces aburrida primera escena del tercer acto en una delicia. No pasa desapercibida la breve intervenciÃƒÂ³n de Neidlinger, Alberich incomparable. Por ÃƒÂºltimo, con este sonido, escuchar a los imponentes pitzianer, viriles y disciplinados, es una fiesta para los oÃƒÂ­dos.\nPor alguna razÃƒÂ³n no aclarada (inexplicablemente Testament no lo menciona en la notas), la segunda escena del tercer acto pertenece al otro ciclo de 1955, tambiÃƒÂ©n grabado por Decca, con el Gunther de Hotter --y la BrÃƒÂ¼nnhilde de MÃƒÂ¶dl, que no interviene en esta escena--, claramente reconocible en la frase &quot;Du mischtest matt und bleich dein Blutt allein darin&quot; (CD 4, pista 9, 0:17). En la tercera escena, Gunther es nuevamente Uhde. Ã‚Â¿EstarÃƒÂ­a tocado Windgassen en la narraciÃƒÂ³n de Siegfried y en sus ÃƒÂºltimas palabras antes de morir, de modo que ha habido que recurrir a tomas del segundo ciclo? Ã‚Â¿Se harÃƒÂ­a Decca un lÃƒÂ­o con las cintas originales? Ã‚Â¿Se lo ha hecho Testament? Espero que, como era su intenciÃƒÂ³n, Testament acabe publicando al menos el Ocaso del segundo ciclo y aproveche la ocasiÃƒÂ³n para explicarnos lo sucedido.\nMedio siglo despuÃƒÂ©s de estas memorables funciones, el loable empeÃƒÂ±o de Testament rinde tardÃƒÂ­o homenaje a Joseph Keilberth, el especialista, el director sabio adorado por los cantantes, el segundÃƒÂ³n, siempre a la sombra de &quot;Kna&quot; y Clemens Krauss. Los resultados que estos discos evidencian sÃƒÂ³lo estÃƒÂ¡n al alcance de unos pocos. Testament nos ha hecho un regalo impagable a los wagnerianos. No me cansarÃƒÂ© de repetir que la conjunciÃƒÂ³n, en los aÃƒÂ±os 50, de la direcciÃƒÂ³n de escena renovadora de Wieland Wagner, que hizo ÃƒÂ©poca, directores de orquesta comprometidos con Wagner y el Festival de Bayreuth, una orquesta y un coro de mÃƒÂºsicos entusiastas y entregados y el mejor grupo de cantantes-actores jamÃƒÂ¡s reunido dio como resultado el mejor Wagner --tomado en conjunto-- del que tenemos constancia discogrÃƒÂ¡fica. Y poder disfrutarlo en estas condiciones tÃƒÂ©cnicas era poco menos que un sueÃƒÂ±o impensable. Desde entonces, una variante no letal de la maldiciÃƒÂ³n del anillo parece haber golpeado a los intÃƒÂ©rpretes wagnerianos. Una vez mÃƒÂ¡s, la escucha de registros como ÃƒÂ©ste y la comparaciÃƒÂ³n con la evoluciÃƒÂ³n posterior hace que, como Hagen, nos preguntemos: &quot;Ã‚Â¿QuiÃƒÂ©n heredarÃƒÂ¡ el poder de los eternos?&quot;","torrent":{"xt":"urn:btih:40c510a030cf4a2dea70ff8e6163e697a84a7fa9","amp;dn":"Wagner+-+Gotterdammerung+%28Keilberth+Bayreuth+1955%29+%5Bape+cue%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"40c510a030cf4a2dea70ff8e6163e697a84a7fa9","infoHashBuffer":{"type":"Buffer","data":[64,197,16,160,48,207,74,45,234,112,255,142,97,99,230,151,168,74,127,169]},"announce":[],"urlList":[]}}