{"title":"Claire Lynch - Out in the Country [2000][EAC,log,cue. FLAC]","uid":8925890,"size":198342813,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:41443bed11ad5628887da22c6fc60edd842be8e9&amp;dn=Claire+Lynch+-+Out+in+the+Country+%5B2000%5D%5BEAC%2Clog%2Ccue.+FLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dickspic","files":13,"time":1379365676,"description":"Artist: Claire Lynch\nRelease: Out in the Country\nReleased: 2000\nLabel: Copper Creek\nCatalog#: CCCD-0184\nFormat: FLAC / Lossless / Log (100%) / Cue\n[color=blue]Country: USA\nStyle: Country\n\n1 I Can't Get You Off Of My Mind\n2 I'll Never Grow Tired Of You\n3 Somebody Loves You Honey\n4 He Rode All The Way To Texas\n5 ivin' In The Name Of Love\n6 Breakin' It\n7 Heart Made Of Stone\n8 Old By And By\n9 Listen To A Country Song\n10 Once In A Lifetime\n11 Feelings Of Love\n\nIn the early '80s, bluegrass singer Claire Lynch was invited to make a country album, resulting in Out in the Country. Issued by a small label, the album has been out of print for some time. Now Lynch's fans and country music fans are in for a pleasant surprise; thanks to Copper Creek, this wonderful album is once again available. While Lynch wasn't completely satisfied with the production of the album, nor with all of the song choices, it is doubtful that listeners will have any such qualms. The album kicks off with &quot;I Can't Get You Off of My Mind,&quot; a nice piece of Western swing with some great steel guitar work by Mike Auldridge. The mostly acoustic &quot;I'll Never Grow Tired of You&quot; is a lovely waltz that gives Lynch's emotive vocals a chance to stretch out. On a number of songs she is joined on vocals by John Starling and Kostas, adding depth and diversity to the music. Lynch's liner notes give the impression that the project was sort of thrown together; maybe so, but the results work. There are also excellent versions of &quot;He Rode All the Way to Texas&quot; and Loggins &amp; Messina's &quot;Listen to a Country Song.&quot; At 33 minutes, the album may seem a little short, but one has to take into consideration that this album was originally released in 1982, before CDs made the 74-minute album compulsory. Out in the Country is excellent country music, but unfortunately the kind that is seldom played on radio stations. For Lynch fans, and for those tired of waiting for real country music on the local radio station, this album shouldn't be missed.","torrent":{"xt":"urn:btih:41443bed11ad5628887da22c6fc60edd842be8e9","amp;dn":"Claire+Lynch+-+Out+in+the+Country+%5B2000%5D%5BEAC%2Clog%2Ccue.+FLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"41443bed11ad5628887da22c6fc60edd842be8e9","infoHashBuffer":{"type":"Buffer","data":[65,68,59,237,17,173,86,40,136,125,162,44,111,198,14,221,132,43,232,233]},"announce":[],"urlList":[]}}