{"title":"Johnny Winter-Live Bootleg Series, Vol. 1(2007)[EAC-FLAC][TWR121","uid":4845246,"size":428862059,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:41a32b82d9b304f857fdda93a590a1a70893363e&amp;dn=Johnny+Winter-Live+Bootleg+Series%2C+Vol.+1%282007%29%5BEAC-FLAC%5D%5BTWR121&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"thewall68","files":24,"time":1239654605,"description":"Releaser: thewall\n\nExtractor: EAC 0.99 prebeta 4  \nRead Mode: Secure with NO C2, accurate stream, disable cache.\nCodec: Flac 1.2.1;  Level 8  \nSource: Original CD \nArtwork:  Full Scans 300dp \n\n\nProduct Description\n\nJohnny Winter has been flattening audiences since he blew out of Texas like a white tornado in 1968. At the tail end of the blues revival when British blues rockers were co-opting America's only indigenous art form, Johnny staked his claim to the title of reigning blues guitar hero with blinding chops as hot as a jalapeno and authentic blues feel as deep, wide and muddy as the Rio Grande.\n\nJohnny's studio releases are an unparalleled record of the evolution of a blues master who has never stopped growing and perfecting his unique artistic vision of the music as a living, breathing entity meant to be expressed with spontaneity and unbounded enthusiasm in concert. To the everlasting gratitude of his fans, he has recorded a tremendous number of his shows, amassing an archive of forty plus years of musical treasures. They are now being carefully and painstakingly mastered and will be released over the next several years as the Live Bootleg Series on Friday Music.\n\nVolume One covers a collection of Johnny's vintage performances featuring bassist Jon Paris and drummer Bobby T, his power trio at the time playing with fiery abandon and thundering drive. From his signature hair-raising scream of A LITTLE ROCK AND ROLL! that introduces Johnny B. Goode to his stomping bonus track cover of Bobby Womack's R&amp;B classic It's All Over Now, this musical journey is one of blues and rock, heart and soul. If there is any doubt that he is the premier interpreter of the Rolling Stones, one need only to listen to his cataclysmic version of Jumpin' Jack Flash, to dispel any rumors. It's no wonder Keith and Mick gladly handed him their Silver Train to cover. Any Texan worth his salt and tequila includes Freddie King's Hide Away in his repertoire, but Johnny knows it from the inside out and makes the well- worn classic his own. Ever conscious of his true roots in country blues, he delivers a Southern fried Rollin' and Tumblin' for the ages, stamping it as bonafide with his slashing slide guitar. Further demonstrating his versatility, his original, brooding Stranger makes a case for this overlooked aspect of his talent.\n\nAs Johnny is quick to point out when anyone calls his recent resurgence as a comeback, But I never went anywhere! These priceless, previously unreleased live recordings only further serve to fill in the gaps in a legacy that continues to be added to with every passing contemporary show and recording.\n\nDave Rubin - Guitar Player Magazine \n\n\n\n\nThe CD is 100% Johnny Winter legit and I hope he makes a bundle off it and keeps on with series.\n\nThis CD is incredible!!! First off this appears to be a complete live session plus the added cut &quot;It's All Over Now&quot;. I am guessing based on the song set and Johnny's backup musicians this is a late 70's recording. This CD smokes. &quot;Johnny B. Goode&quot; has a few uneven bits but after that the band tightens up, they get in sync with Johnny and then it's a Johnny Winter show from then on out. At this point in Johnny's career he is a several years out of his rock n roll superstar era (as I call it) but still heavily influenced by it and it shows on this CD. It is rockin' high energy from start to finish. Johnny's playing is amazing (of course) and in many spots hits the, &quot;what did he just do&quot; incredible level. Most of the cuts are well over six minutes and what is really cool is Johnny and the band go into several &quot;jam sessions&quot; (trading off leads with the bass and drums) which are not usually found on Johnny's live stuff. &quot;Messin' With the Kid&quot; is excellent and, yes, Johnny plays that amazing rhythm section live that is on his studio version of the tune. &quot;Rollin and Tumblin&quot; has not been one of my favorite tunes by Johnny, however, this live version is by far my favorite. Every tune is excellent and a true stand out. The sound quality is quite good, so don't let the &quot;Bootleg&quot; in the title scare you.\n\nIf you like Johnny rockin' hard, rockin' the blues, and his blazing guitar licks, some at breakneck speeds, by this CD, you will not be disappointed. \n\n[Amazon user]\n\n\n\n\n1.: Introduction\n2.: Johnny B Goode\n3.: Messin' With The Kid\n4.: Help Me\n5.: Hideaway\n6.: Come On In My Kitchen\n7.: Rollin' And Tumblin'\n8.: Stranger\n9.: Jumpin' Jack Flash\n10.: Bony Maronie\n11.: Closing\n12.: It's All Over Now (bonus track)\n","torrent":{"xt":"urn:btih:41a32b82d9b304f857fdda93a590a1a70893363e","amp;dn":"Johnny+Winter-Live+Bootleg+Series%2C+Vol.+1%282007%29%5BEAC-FLAC%5D%5BTWR121","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"41a32b82d9b304f857fdda93a590a1a70893363e","infoHashBuffer":{"type":"Buffer","data":[65,163,43,130,217,179,4,248,87,253,218,147,165,144,161,167,8,147,54,62]},"announce":[],"urlList":[]}}