{"title":"SpywareBlaster v3.4","uid":3346627,"size":2560240,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:41c4e28b1bc26950d27db76ed937cae96d0964ec&amp;dn=SpywareBlaster+v3.4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"shareadictos","files":1,"time":1119257491,"description":"Go to www.shareadictos.com for more info\nEn www.shareadictos.com encontrar&amp;aacute;s torrents y foros de ayuda.\n\n\n\nSpyware, adware, secuestradores (hijackers) del navegador y dialers son algunas de las amenazas en el Internet hoy. Simplemente navegando en una page pdemos encontrar que nuestro PC se hace anfitri&amp;oacute;n de uno de estos amigos no deseados.\nLa medida m&amp;aacute;s importante que usted puede tomar es asegurar su sistema. Y SpywareBlaster es el programa m&amp;aacute;s potente disponible. \n# prevenga la instalaci&amp;oacute;n de spyware, adware, secuestradores del browser, dialers y otro software potencialmente indeseado basado en ActiveX\n# bloquea cookies de spyware/tracking en Internet Explorer y Mozilla/Firefox. \n# restringe las acciones de sitios potencialmente indeseados en Internet Explorer. \nSpywareBlaster puede ayudar a mantener su sistema spyware-libre y a asegurarlo, sin interferir con el &quot;lado bueno&quot; de la web. Y al contrario que otros programas, SpywareBlaster no tiene que permanecer corriendo para ser eficaz. \nSpywareBlaster es freeware para el uso personal y educativo.La &amp;uacute;nica diferencia con la versi&amp;oacute;n licenciada es que los updates deben hacerse manualmente y no son autom&amp;aacute;ticos.\n\nSpyware, adware, browser hijackers, and dialers are some of the fastest-growing threats on the Internet today.\nBy simply browsing to a web page, you could find your computer to be the brand-new host of one of these unwanted fiends!\nThe most important step you can take is to secure your system. And SpywareBlaster is the most powerful protection program available.\n# Prevent the installation of ActiveX-based spyware, adware, browser hijackers, dialers, and other potentially unwanted software.\n# Block spyware/tracking cookies in Internet Explorer and Mozilla/Firefox.\n# Restrict the actions of potentially unwanted sites in Internet Explorer.\nSpywareBlaster can help keep your system spyware-free and secure, without interfering with the &quot;good side&quot; of the web.\nAnd unlike other programs, SpywareBlaster does not have to remain running in the background.\nSpywareBlaster is freeware for personal and educational use","torrent":{"xt":"urn:btih:41c4e28b1bc26950d27db76ed937cae96d0964ec","amp;dn":"SpywareBlaster+v3.4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"41c4e28b1bc26950d27db76ed937cae96d0964ec","infoHashBuffer":{"type":"Buffer","data":[65,196,226,139,27,194,105,80,210,125,183,110,217,55,202,233,109,9,100,236]},"announce":[],"urlList":[]}}