{"title":"The Devil's Touch by Vivien Sparx prabhu_","uid":9476806,"size":3323336,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:420a407ceabd05729b501b6b9b908a390fadeec7&amp;dn=The+Devil%27s+Touch+by+Vivien+Sparx+prabhu_&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"prabhu_","files":4,"time":1389716442,"description":"The Devil's Touch by Vivien Sparx \n\nby Vivien Sparx\n &lt;a href=&quot;\nhttp://d202m5krfqbpi5.cloudfront.net/books/1356052590l/17159108.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://d202m5krfqbpi5.cloudfront.net/books/1356052590l/17159108.jpg&lt;/a&gt;\n\nabout book :-\n\n&quot;THE DEVIL'S TOUCH WILL SHOCK AND AMAZE YOU WITH THE INTENSELY SEXUAL SITUATIONS THAT SPARX PUTS HER CHARACTERS IN!&quot; - Sassy Book Lovers Blog.\n\nLucien Lance - a ruthless, relentless corporate raider. A man known for his single minded determination and his uncompromising thirst for money and power. A man so fearsome they had a name for him on Wall Street. \nLucifer.\nWhen young Angelica meets Lucien at a business function she quickly discovers just how dangerous and sexy Lucien is, as he seduces her into an erotic world of dominance and submission using a mysterious pleasure technique called the 'Devil's Touch'.\nBut Lucien's hunger for wealth and control comes with a cost... and Angelica must decide how much she is willing to risk to earn the chance of love. \nA story of approx. 42,000 words\n\n&quot;Amazing &amp; heartfelt story between 'Lucifer' Lance &amp; Angelica, aka: the devil &amp; the angel.\n\nLucien comes accross as ruthless and cold hearted to me, I was unsure of him for a long time. Angelica is so sweet you can't help but love her. The sub/dom relationship grows fast and fierce and not distasteful at all. There is a depth to each of them that I'd love to be opened up more. After the 'accident' Luciens's grown so much, you can feel it. I really hope Vivien writes The Devils Touch 2, I think she can really make the characters grow and do so much more with them. As always I want more!\n\nThe Devils Touch has a twist in it that shocked me and of course left me wanting more! I love all of the interviews at the ends of her books as well.. One thing I have to say about this book is.. I finished reading it a few hours ago and I can NOT stop thinking about it. The characters and the storyline has effected me, I feel happy, sad and pretty much every other emotion. I want to see so much more with these two, read the book and you will understand what I mean.\n\nI have read all of Vivien's books, each book she writes she is showing us she is growing into such a talented writer. Once you read one of her books she will have you hooked! I am so thankful to have found her, she is one of my favorite authors!\n\nAs for research, Vivien always blows me away with the detail she writes with. She puts so much thought into each character and storyline. It's like watching a movie! This is an amazing submissive/mesmerizing love story, with a twist and a devils touch. Get it now!&quot;\n-Kari Kuech\n\n&quot;One of my favourite Vivien Sparx books the erotica in this book sets the bar sky high. I am a big fan of Gail McHugh's books Collide and Pulse and when I finished them I was lucky enough to come across Vivien's books. Like Gail McHugh, Vivien weaves a brilliant lusty tale and one book just isn't enough!&quot;\n- Chelsea Veken\n\n&quot;If you love Gail McHugh and her book's Collide and Pulse you will love Vivien's books!&quot;\n- Aiesha, Reviewer.\n\n\n\n\n`~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~`\n  SEED PLEASE , LET OTHERS GET IT TOO. \n `~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~`\t\n\n\n","torrent":{"xt":"urn:btih:420a407ceabd05729b501b6b9b908a390fadeec7","amp;dn":"The+Devil%27s+Touch+by+Vivien+Sparx+prabhu_","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"420a407ceabd05729b501b6b9b908a390fadeec7","infoHashBuffer":{"type":"Buffer","data":[66,10,64,124,234,189,5,114,155,80,27,107,155,144,138,57,15,173,238,199]},"announce":[],"urlList":[]}}