{"title":"Pete Fountain - The Best of Pete Fountain (MCA 4032)","uid":11960004,"size":582778783,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:425cc12fec72e6a8a08b1a7b942e3b23665583ea&amp;dn=Pete+Fountain+-+The+Best+of+Pete+Fountain+%28MCA+4032%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Big-Papi","files":48,"time":1432533118,"description":"[i]This is the 80's original CD release. There was another CD release in the 90's. Big Papi is not a big fan of New Orlean's jazz because lots of it sounds like drunken idiots with trumpets making noise before the pass out, but this music is clarinet based and made with smoothness and skill. Give it a listen you will like. it is something different.\n\n- Big Papi[/i]\n\n\n\n[quote]By Caponsacchi VINE VOICE\n\nThe inclusion of &quot;Fascination&quot; and &quot;Shrimp Boats&quot; and the exclusion of &quot;Bourbon Street Parade&quot; and &quot;Panama&quot; emblematize what is missing on this otherwise slick, polished, practically flawless performance. But Pete (whom I remember catching at Chicago's Blue Note before his Lawrence Welk fame) has sponsored a genuinely valuable contribution to the catalog of recorded clarinet literature with an offering entitled: &quot;Pete Fountain Presents the Best of Dixieland.&quot;\n\nIf the word &quot;dixieland&quot; rubs you the wrong way, forget the labeling. For anyone who loves jazz clarinet or, for that matter, those modern-day listeners who tend to be dismissive of the old &quot;licorice stick,&quot; the other album provides a rare opportunity to hear virtually all of the masters of the instrument on a single disc. It's unlikely a collection like it exists anywhere. The all-star line-up includes the New Orleans triumvirate (Dodds, Noone, Bechet), the Chicago school (Pee Wee Russell), and latter-day giants (Wilbur, Davern, Fountain). Most telling is the expressive range and variety, from the intimate and heartfelt conversations of Russell, to the playful, flirtatious melodic statements of Irving Fazola, to the endlessly inventive responses of Omar Simeon, to the incisive, penetrating attack of Davern, to the breathtaking virtuoso solo work of Edmund Hall. In fact, Fountain's own smooth, polished performance sets him more in the company of Benny Goodman than alongside the highly personal voices represented on the sampler bearing his name. Those listeners who are so quick to champion the tenor sax as the most expressive instrument in jazz, as the closest thing to the human voice, should listen carefully and often to the &quot;Best of Dixieland&quot; (not the &quot;Best of Fountain&quot;) album before making any further pronouncements.\n\nWhether or not it's still possible to hear anything resembling the glorious past in the music's cradle is open to question. In the 1970s it still was. There was a jazz museum right on Bourbon Street (which must have cost the city an infinitesimal amount compared to the Super-Stadium, or whatever it's called), and you could still go to Preservation Hall and be transported back in time by over half a century by the clarinet of Albert Burbank (even the Humphrey brothers were a distant second). Consequently, I was somewhat taken back, upon bumping into Danny Barker in the middle of Bourbon Street early one morning, to hear his glum assessment of the state of the art of New Orleans music. He must have been prognosticating about the music's future. Either that or reflecting on a time the rest of us will never be privileged to re-enter--at least not in this temporal world.[/quote]\n\n[img]https://yuq.me/users/15/891/LWJZUoqAXQ.jpg[/img]\n\n---------------------------------------------------------------------\n Pete Fountain - The Best of Pete Fountain (MCA 4032)\n---------------------------------------------------------------------\n\nArtist...............: Pete Fountain\nAlbum................: The Best of Pete Fountain (MCA 4032)\nGenre................: Jazz\nSource...............: CD\nYear.................: 1972\nRipper...............: EAC (Secure mode) / LAME 3.92 &amp; Asus CD-S520\nCodec................: Free Lossless Audio Codec (FLAC)\nVersion..............: reference libFLAC 1.3.0 20130526\nQuality..............: Lossless, (avg. compression: 57 %)\nChannels.............: Stereo / 44100 HZ / 16 Bit\n\n---------------------------------------------------------------------\n Tracklisting\n---------------------------------------------------------------------\n\n 1. Pete Fountain - A Closer Walk [02:11]\n 2. Pete Fountain - Bye Bye Bill Bailey [02:44]\n 3. Pete Fountain - China Boy (Go Sleep) [05:41]\n 4. Pete Fountain - Columbus Stockade Blues [03:26]\n 5. Pete Fountain - Do You Know What It Means to Miss New Orleans?[03:02]\n 6. Pete Fountain - Fascination Medley: Fascination/Basin Street Blues/Tin Roof Blues/Way[04:38]\n 7. Pete Fountain - For Pete's Sake [02:15]\n 8. Pete Fountain - High Society [02:28]\n 9. Pete Fountain - Indiana (Back Home In Indiana) [02:35]\n 10. Pete Fountain - Lazy River [05:04]\n 11. Pete Fountain - My Blue Heaven [02:58]\n 12. Pete Fountain - Oh, Lady Be Good [06:17]\n 13. Pete Fountain - Over the Waves [02:37]\n 14. Pete Fountain - Put on Your Old Grey Bonnet [02:58]\n 15. Pete Fountain - Shrimp Boats [02:33]\n 16. Pete Fountain - St. Louis Blues [03:17]\n 17. Pete Fountain - Stranger on the Shore [05:13]\n 18. Pete Fountain - When My Baby Smiles at Me [02:35]\n 19. Pete Fountain - When The Saints Come Marching In March [02:29]\n 20. Pete Fountain - While We Danced at the Mardi Gras [02:29]\n 21. Pete Fountain - Yes Indeed [02:52]\n 22. Pete Fountain - You're Nobody 'Til Somebody Loves You [02:52]\n\nPlaying Time.........: 01:13:25\nTotal Size...........: 422.31 MB\n\nNFO generated on.....: 5/24/2015 12:29:29 PM\n---------------------------------------------------------------------\nWrite anything you want... \nAll Big Papi rips are directly from original CD's unless stated otherwise.\n\nThis download includes a volume that has been ripped at MP3 V0 \nwhich is nearly indistinguishable from FLAC using spectral analysis. It provides \nhigher dynamic range than 320kbps at a fraction of the file size. If you love \nFLAC then you'll know MP3 V0 is your other buddy for going mobile when \nspace and quality is a concern\n\nThe AccurateRip data is embedded in the MP3 tags so you can look at any \ntrack to validate the accuracy of the rip.\n\n\n:: Generated by Music NFO Builder v1.21a - www.nfobuilder.com","torrent":{"xt":"urn:btih:425cc12fec72e6a8a08b1a7b942e3b23665583ea","amp;dn":"Pete+Fountain+-+The+Best+of+Pete+Fountain+%28MCA+4032%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"425cc12fec72e6a8a08b1a7b942e3b23665583ea","infoHashBuffer":{"type":"Buffer","data":[66,92,193,47,236,114,230,168,160,139,26,123,148,46,59,35,102,85,131,234]},"announce":[],"urlList":[]}}