{"title":"Young James Herriot - COMPLETE SERIES - Season 1","uid":12285891,"size":1188434243,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:425d69723329c2b5af66f72984b5f1de65835e1f&amp;dn=Young+James+Herriot+-+COMPLETE+SERIES+-+Season+1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"7436746","files":5,"time":1440473736,"description":"From Wikipedia:\nYoung James Herriot is a three-part British television drama based on the early life of veterinary surgeon James Herriot. It features Iain De Caestecker as the title character following his arrival at veterinary college, alongside Amy Manson and Ben Lloyd-Hughes as fellow students Whirly Tyson and Rob McAloon. Directed by Michael Keillor and written by Ann McManus and Eileen Gallagher, it was a Koco Drama production for the BBC which first aired on BBC One in December 2011.\n\nPlot\nThe plot is based on the early life and studies of veterinary surgeon James Herriot, known for his autobiographical books which were the basis for the BBC television series All Creatures Great and Small. The series is set in the 1930s at the Glasgow Veterinary College, where Herriot (Iain De Caestecker) has arrived to train as a veterinary surgeon. It focuses on his relationship with his new-found friends Emma 'Whirly' Tyson (Amy Manson) and Rob McAloon (Ben Lloyd-Hughes). They lodge together at the home of Elspeth Munro (Natasha Little).\n\nAlso featured are Jenny Muirhead (Joanna Vanderham), who is the only other female student at the college, and lecturers Professor Gunnell (Gary Lewis) and Professor Richie (Tony Curran). Topics which features in the story lines include the subjugation of women, the treatment of students by Professor Gunnell, and the rise of the fascist movement in the UK","torrent":{"xt":"urn:btih:425d69723329c2b5af66f72984b5f1de65835e1f","amp;dn":"Young+James+Herriot+-+COMPLETE+SERIES+-+Season+1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"425d69723329c2b5af66f72984b5f1de65835e1f","infoHashBuffer":{"type":"Buffer","data":[66,93,105,114,51,41,194,181,175,102,247,41,132,181,241,222,101,131,94,31]},"announce":[],"urlList":[]}}