{"title":"Jane's Addiction - Stop! [promo].VOB","uid":11918017,"size":265588736,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:4287c198da5fa56a596ee59c8505c7bef41d2002&amp;dn=Jane%27s+Addiction+-+Stop%21+%5Bpromo%5D.VOB&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"SgtRlee","files":1,"time":1431576841,"description":"Jane's Addiction - Stop! [promo].VOB\n\n\nHQ rare promo music video from a promo DVD. &quot;Stop!&quot; is a song by Jane's Addiction released on their 1990 album, Ritual de lo Habitual. It reached number one on the Billboard Modern Rock Tracks chart for two non-consecutive weeks. The track was written in 1986.\n\nRitual de lo habitual is the second studio album (third overall) by Jane's Addiction, released on August 21, 1990, by Warner Brothers. Co-produced by Dave Jerden, it was the band's final studio album before their initial break-up in 1991. Singles from Ritual de lo Habitual include &quot;Been Caught Stealing&quot; and &quot;Stop!&quot;. Ritual de lo habitual is certified 2x Platinum in the U.S.\n\n&quot;It all makes you realise how few bands actually bother to try and be any good, to play stuff that's inspirational,&quot; enthused Andrew Perry in a retrospective review for Select. The same magazine later listed Ritual as the fifth best album of the '90s: &quot;Nevermind would never have been possible without it. And, along the way, they ushered in the Led Zep revival.&quot;\n\nIn 2003, the album was ranked number 453 on Rolling Stone magazine's list of the 500 greatest albums of all time.\n\n\nJane's Addiction is an American rock band from Los Angeles, California, formed in 1985. The band consists of Perry Farrell (vocals), Dave Navarro (guitar), Stephen Perkins (drums) and Chris Chaney (bass).\n\nFounded by Farrell and bass guitarist Eric Avery, following the disintegration of Farrell's previous band Psi Com, Jane's Addiction was one of the first bands from the early 1990s alternative rock movement to gain both mainstream media attention and commercial success in the United States. The band's first two studio albums, Nothing's Shocking (1988) and Ritual de lo Habitual (1990), were released to widespread critical acclaim, and an increasing cult fanbase. As a result, Jane's Addiction became icons of what Farrell dubbed the &quot;Alternative Nation.&quot; The band's initial farewell tour, in 1991, launched the first Lollapalooza, which has since become a perennial alternative rock festival.\n\nJane's Addiction was one of the pioneering acts of alternative metal and is credited for the mainstream exposure of the alternative music scene in the 1990s. The band was also heavily associated with the funk metal genre.\n\nJane's Addiction is usually regarded as one of the most influential acts in alternative music. Tom Morello of Rage Against the Machine compared the influence of the band to that of Nirvana.\n(video does not have any logos)\n\n\n    &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Stop!_(Jane's_Addiction_song)&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Stop!_(Jane's_Addiction_song)&lt;/a&gt; \n      &lt;a href=&quot;\nhttp://postimg.org/image/eaub6xf11/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://postimg.org/image/eaub6xf11/&lt;/a&gt; \n   \n\n\nFile properties info using Media Player Classic:     \n   Video: MPEG2 Video 720x480 (4:3) 29.97fps 6000kbps\n   Audio: LPCM 48000Hz stereo 1536kbps [DVD, 16 bits]\n   Duration: 00:04:36\n\n\n\n\n*Install the &quot;Media Player Classic&quot; player if you can't play this file, \nor for better visual and audio quality playback of all your videos. \nIt's 100% free to download and use. Latest stable build is v1.7.8\n\n*Media Player Classic Home Cinema*         &lt;a href=&quot;\nhttp://mpc-hc.org/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://mpc-hc.org/&lt;/a&gt; \n\nSgtRlee (Sgt.R.Lee)","torrent":{"xt":"urn:btih:4287c198da5fa56a596ee59c8505c7bef41d2002","amp;dn":"Jane%27s+Addiction+-+Stop%21+%5Bpromo%5D.VOB","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4287c198da5fa56a596ee59c8505c7bef41d2002","infoHashBuffer":{"type":"Buffer","data":[66,135,193,152,218,95,165,106,89,110,229,156,133,5,199,190,244,29,32,2]},"announce":[],"urlList":[]}}