{"title":"The Mendoza Line - 30 Year Low [2007] [EAC/FLAC]","uid":11674307,"size":543632998,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:42a0799c96d9eec4ffeee65c017ce7052e2c1b82&amp;dn=The+Mendoza+Line+-+30+Year+Low+%5B2007%5D+%5BEAC%2FFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dickspic","files":39,"time":1422749097,"description":"The Mendoza Line - 30 Year Low [2007] [EAC/FLAC]\n\n\n \n\n\nÂ» FLAC / Lossless / Log (100%) / Cue\nLabel/Cat#: Glurp Records #010\nCountry: USA\nYear: August 21, 2007\nGenre: indie\nFormat: CD\n\nDISC 1\n01 - Since I Came \n02 - Aspect Of An Old Maid \n03 - 31 Candles \n04 - I Lost My Taste \n05 - Love On Parole \n06 - Stepping On My Heels \n07 - Thirty Year Low \n08 - Tell It To The Raven \n\nDISC 2\n01 - Anything Goes \n02 - It Helps To Leave The House \n03 - Fleur De Lie (Live) \n04 - Withered And Died \n05 - Tougher Than The Rest \n06 - Go Shopping \n07 - Now Or Never Or Later (Original Demo) \n08 - Packs Of Three \n09 - Tax Me \n10 - It Takes A Lot To Laugh, It Takes A Train To Cry \n11 - I Am Small \n12 - Golden Boy (Live) \n13 - The Likely Nominee \n14 - Mysterious In Black (Live) \n15 - Mike T. Interlude \n16 - Over The Hill \n17 - Angry Crafts \n18 - Metro Pictures (Alternate Take) \n\nBrooklyn's the Mendoza Line have been poised at the brink of a precipice throughout their ten-year existence. 2000's masterful We're All in This Alone was a thrust and parry exchange between the principal combatants, husband and wife Timothy Bracy and Shannon McArdle, and the band's last effort, 2005's Full of Light and Full of Fire, seemed to foreshadow relational failure with a fatalistic shrug. So it should come as no great surprise that with 30 Year Low, the husband-and-wife duo, and the existence of the band itself, go hurtling over the edge of the cliff. Divorce albums, of course, have always constituted their own hypercharged subgenre, with Bob Dylan's Blood on the Tracks and Richard &amp; Linda Thompson's Shoot Out the Lights at the head of the sadsack class. You can slot 30 Year Low just slightly below those masterpieces. While Bracy tends to couch his sorrow and self-loathing in poetic sentiments and alt country rambles, McArdle goes straight for the rock &amp; roll jugular, and the contrasting styles create the tension that fuels this album. Bracy's Dylanesque rasp chronicles the dissolution of the couples' marriage on the disquieting ballad &quot;Love on Parole,&quot; while the title track finds him employing an extended marriage-as-stock-market metaphor on a Bakersfield lope that could have originated with Merle Haggard or Buck Owens. Only his &quot;I've Lost My Taste,&quot; which verges on mush-mouthed Dylan parody, fails to connect. If anything, McArdle is even more of a revelation. &quot;Stepping on My Heels&quot; is a lovely, disquieting meditation on aging and the chew 'em up and spit 'em out nature of the music industry. And &quot;31 Candles&quot; is a great, raging mess of snarling guitars, snarky commentary, and bitterness and recrimination, a cathartic middle finger to a marriage that was, and is no more. It's clear evidence that these folks won't be making music together anytime soon. And that's a shame. Aside from the relational crash and burn, which is reason enough to mourn, it's abundantly clear that we've lost a very talented band. The accompanying odds &amp; sods collection, Final Reflections of the Legendary Malcontent, will probably be of interest only to hardcore fans and completists. Compiling B-sides, live versions of previously released studio tracks, a few choice covers (Linda Thompson's exquisite &quot;Withered and Died,&quot; Bruce Springsteen's &quot;Tougher Than the Rest&quot;), and the kind of flaccid studio noodling that should have never seen the light of day, it's the perfect argument for the &quot;Next&quot; button on your CD player or iPod. The real action here is on 30 Year Low, and it's fast and most decidedly furious. Like the best divorce albums, it offers sadness, pathos, and the electric thrill of great music forged in the crucible of pain","torrent":{"xt":"urn:btih:42a0799c96d9eec4ffeee65c017ce7052e2c1b82","amp;dn":"The+Mendoza+Line+-+30+Year+Low+%5B2007%5D+%5BEAC%2FFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"42a0799c96d9eec4ffeee65c017ce7052e2c1b82","infoHashBuffer":{"type":"Buffer","data":[66,160,121,156,150,217,238,196,255,238,230,92,1,124,231,5,46,44,27,130]},"announce":[],"urlList":[]}}