{"title":"X3 - Reunion XTM 0.7.5 Mod (Full Version)","uid":4709059,"size":280744991,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:42e1561ae7703e6ec517a1fa82c3e330b58336a9&amp;dn=X3+-+Reunion+XTM+0.7.5+Mod+%28Full+Version%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"aNickname","files":-1,"time":1233953518,"description":"Features:\n\nFeaturing over 90 new sectors including:\n- The Terran Solar System\n- New Xenon, Khaak, Pirate, and Yaki Sectors\n- New Goner, Unknown and Main races sectors\n- Countless other places to explore or conquer, each one unique and useful to every players' needs.\n\n95 New Ships:\n- Argon, Terran, Paranid, and Otas M0 class ships\n- Full compliment of M7 frigate class ships\n- Full complement of MM6 military corvette class ships\n- An M8 class ship for each of the major races with a special feature per M8:\n- Argon Griffon: capable of producing and launching Fighter Drones MkII\n- Boron Swordfish: a powerful Ion-Blast (shield damaging) Frigate\n- Otas Custodian: group shield and repair Frigate\n- Otas HCF: allows capture of enemy ships and repair of damaged hulls\n- Paranid Agamemnon: fitted with the latest in powerful missile technology\n- Split Panther: a support frigate capable of producing Split fighters\n- Teladi Tern: a mine layer frigate for laying explosive blockades.\n- Terran Ollerus: wormhole deployment to make dynamic tradelanes.\n- 7 Ships from X2 brought back, remodeled and refitted by special dealers across the universe\n- Full compliment of Terran ships on sale and active in the universe from M0 down to TS/TP and fighter class.\n- MTS, Military Transport class ships, TS ships with much improved statistics.\n- Pirate Galleon, Frigates, Corvette and 4 unique Pirate fighter models.\n- Otas (a corporation specializing in highly advanced technologies) will have a full compliment of ships from M0 down to M3, each with special distinctive features.\n- A new race, and over 9 ships used by them.\n- A fleet of new Yaki and Goner ships to discover, buy and use.\n- New T0 class Civilian ships. These HUGE hulks go back to the days before cargobay-compression was invented. Nowadays most are converted to mobile ware- and resource production facilities.\n- Full complement of M3+ fighters for each race, even the Yaki!\n- The Goner Aran, the most powerful vessel the player can own, capable\nof mobile ship construction, reverse engineering, template equipping, remote fleet transport and even the 'conversion' of rogue-minded villains.\n- Many other ships and lifeforms like Boron X-Craft, revamped Xenon vessels, who knows, you might even encounter a Space Dragon!\n\nX-tensive Effects improvements\n- Shockwaves and improved capital ship explosions\n- Added detailed debris in most ship explosions\n- New pirate and Yaki engine effects\n- New sound effects for weapons and missiles\n- New sector soundtracks\n- Missile trails\n- Many new types of Suns\n- Many new Planet types\n- Improved Nebulae.\n\n2 New Weapons, 3 new Missiles and over 8 new shield types\n- The Paranid Heavy Missile Gun: An ammo base missile launcher capable of devastating long range bombardment\n- The Sohnen Beam Cannon: Limited intel available due to a distinct lack of survivors.\n- Military 5MJ, 25MJ, 125MJ, 500MJ, 5GJ shields as well as special pirate and Sohnen shields\n- Additionally all Terran weaponry can be purchased at Terran equipment docks (if your Terran notoriety is high enough!)\n\n\nOver 45 New commands and features including:\n- Shipbuilding capabilities on some ships\n- Drone building capabilities on the Argon Griffon Drone Frigate\n- Ship extension upgrade options at player owned equipment docks for fleet equipping purposes.\n- Complex warehouses to increase the amount that can be stored at factory complexes, or for their own stand alone use to store goods.\n- Multiple electronic warfare and hull repair features on Otas ships.\n- Point to Point jumpdrives on some advanced- and M0 class ships.\n- Many other features including installing ship repair facilities on docks and on carriers, setting capital ships to automatically execute tactical retreats when under fire, the ability to deploy scout drones for long range reconnaissance, and much more...\n\nNew stations:\n- The huge and ancient Dyson Sphere, under control of an unknown force\n- The magnificent Otas Headquarters built around a series of old mining facilities.\n- New factories for the production of the Heavy Missile Gun and ammo, Concussion Impulse Generator, Scout Drones and new Shield types.\n- Many larger factories for weapon and ship components production (potentially still compatible with Ashley's XXL fabs)\n- New, distinct Shipyards for the 5 main races AND Terrans\n\nOver 20 New Missions:\n- Including a new Xtended plot involving a new and terrifying race with the player trying to avert a universe shattering war.\n- Multiple ships to discover and interact with within the universe, leading to missions and side quests and general interaction with the universe.\n- Several new BBS missions, including missions to unlock new ships such as the Argon Leviathan.\n- Dangerous new missions into uncharted enemy space\n\nMany other new features including:\n- Countless new wares, freebies and features to find and use\n- Much improved AI usage of all ships, leading to more variety and life in the universe\n- New docking bays that allow M5 only, M6 only, TS/TP only docking, as well as new internal docking options\n- various AL plugin options to enable:\n\n    * Shockwave damage from capital ship explosions.\n    * Other independent companies within the universe.\n    * Randomized or fixed locations for new shipyards and important stations.\n\n- Many new stations to find and trade with \n\n\n\n\nXTM 0.7.5 Full version installation instructions\n\nWarning: XTM is not Vanilla save game compatible. You MUST start a new game once you have installed XTM\n\n1. Install X3:Reunion\n\n2. Patch X3 to the latest version\n\n3. (Optional) Install the latest X3 bonus pack\n  &lt;a href=&quot; http://thepiratebay.se/torrent/4642562/X3_-_Reunion_Bonus_Package_3.1.07&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://thepiratebay.se/torrent/4642562/X3_-_Reunion_Bonus_Package_3.1.07&lt;/a&gt;\n\n4. Click the 'XTM 0.7.5 Full.exe' installer\n\n5. Install to your 'X3 Reunion' folder. (Default path will be something like this (Can be slightly different depending on which country you bought the game in) C:Program FilesDeepSilverX3 Reunion). It is the same folder that X3.exe is in.\n\n6. Install any other compatible mods and/or scripts.\n\n7. Enjoy!\n\n\n\nXTM 0.7.5 needs the script editor activated due to having a new mission that uses the mission director. This is a limitation of the X3 mission director that is hard coded and therefore is out of our hands.\n\nFor more info visit: http://www.thexuniverse.com/xtended/\n\nChange you pilot name to: Thereshallbewings\nnote the capital T, there will be a short pause and the script editor will now be enabled.\nFinally, just save, and then reload your game for any new scripts to be loaded\n\n\n\nFinal note:\nMy connection is very slow, I have an upload of 64Kbps (so I get about 6 - 7 KB/s upload). AND I can only upload from 8p.m. till 5a.m. GMT.\nSo it might take a couple of days before there are more seeders.","torrent":{"xt":"urn:btih:42e1561ae7703e6ec517a1fa82c3e330b58336a9","amp;dn":"X3+-+Reunion+XTM+0.7.5+Mod+%28Full+Version%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"42e1561ae7703e6ec517a1fa82c3e330b58336a9","infoHashBuffer":{"type":"Buffer","data":[66,225,86,26,231,112,62,110,197,23,161,250,130,195,227,48,181,131,54,169]},"announce":[],"urlList":[]}}