{"title":"Stargazing Live 2016 1of5 1080p HDTV x264-MVGroup","uid":13214662,"size":2380766961,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:4370f0dcc8cbd99e92b88bb2c13364ebec6921c5&amp;dn=Stargazing+Live+2016+1of5+1080p+HDTV+x264-MVGroup&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"MVGroup","files":1,"time":1452677051,"description":"BBC Stargazing Live 2016 1of5 1080p HDTV x264-MVGroup\r\n\r\nPart 1:\r\nBrian Cox and Dara O Briain return for another celebration of space and astronomy. Tim Peake reveals how he is settling into life on the International Space Station one month after his launch into space. Brian and Dara attempt to make a garden shed fly. Liz Bonnin reports live from the European Astronaut Centre, where she finds out whether comedian John Bishop has the 'right stuff'. John will be following astronaut Tim's training programme over three nights, starting with a live, simulated space-walk - underwater. Brian and Dara are joined in the studio by NASA scientist Carly Howett to enjoy some new views from the surface of Pluto. They will also be asking for your help to find new pulsars - spinning stars that are heavier than the sun, yet smaller than Manchester. Meanwhile, Professor Lucie Green will be on hand to guide you around the night sky and to show you how to photograph the International Space Station.\r\n\r\nBack to Earth:\r\nBrian Cox and Dara O Briain are joined by a panel of stellar guests to delve deeper into the universe after a night of Stargazing Live. NASA's Carly Howett discusses 2015's New Horizons mission to Pluto, sharing some of the astonishing discoveries made possible by the images and data still being sent back from the probe. Also in the studio, Professor Chris Lintott explores the strange world of pulsars - spinning stars that are heavier than the sun, yet smaller than Manchester - and explains how Stargazing viewers can make their own contribution to astronomy by discovering new ones over the next three nights. The panel will be answering viewers' questions, as well as enjoying their photographs of the night sky, including the International Space Station.\r\n\r\nTechnical Spec\r\nVideo Codec: x264 CABAC   \r\nVideo Bitrate: CRF 23 (~3483Kbps)\r\nVideo Resolution: 1920x1080\r\nVideo Aspect Ratio: 16:9\r\nFrames Rate: 25 FPS\r\nAudio Codec: AAC-LC\r\nAudio Bitrate: Q=0.45 VBR 48KHz (~122Kbps)\r\nAudio Channels: 2\r\nRun-Time: 88 mins\r\nNumber Of Parts: 5\r\nPart Size: 2.21 GB\r\nSource: HDTV\r\nSubtitles: Merged","torrent":{"xt":"urn:btih:4370f0dcc8cbd99e92b88bb2c13364ebec6921c5","amp;dn":"Stargazing+Live+2016+1of5+1080p+HDTV+x264-MVGroup","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4370f0dcc8cbd99e92b88bb2c13364ebec6921c5","infoHashBuffer":{"type":"Buffer","data":[67,112,240,220,200,203,217,158,146,184,139,178,193,51,100,235,236,105,33,197]},"announce":[],"urlList":[]}}