{"title":"Robert Rankin - The Hollow Chocolate Bunnies of the Apocolypse","uid":4240072,"size":216436757,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:438f67954b8496521e42e74c2583f5ab109c85c8&amp;dn=Robert+Rankin+-+The+Hollow+Chocolate+Bunnies+of+the+Apocolypse&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"rambam1776","files":186,"time":1213487149,"description":"The Hollow Chocolate Bunnies of the Apocalypse - Robert Rankin\n\n\n\nEditorial Reviews\n\nFrom Publishers Weekly\nLike a mad toymaker&amp;#039;s fever dream, Rankin&amp;#039;s uproarious book imagines a town where toys and nursery rhymes come to life and pursue human activities: they walk, talk, eat, drink and commit heinous crimes. Thirteen-year-old Jack goes to the City to find his fortune, unaware that the City is in fact Toy City, where legends and fables walk (or stumble, if they&amp;#039;ve had too much to drink). He meets up with detective teddy bear Eddie, who is investigating the murder of Humpty Dumpty. When Little Boy Blue is offed, it&amp;#039;s clear that a serial killer is prowling Toy City, leaving behind the titular chocolate bunnies as his calling card. Rankin doesn&amp;#039;t just drop names of familiar characters but gives them riotous back stories: Miss Muffett hosts a daytime TV talk show called &quot;The Tuffet&quot;; Mother Goose (who prefers to be called Madame Goose) runs a brothel; Humpty Dumpty was likely a failed television stuntman named Terry Horsey. Although the story is wickedly clever and the payoff is a great and satisfying surprise, the real delight comes from watching Rankin work his linguistic magic: characters talk in hilariously circular and self-aware dialogue, and puns and wordplay are packed into the prose like sardines in a tin. Although substantially darker and edgier than the Hitchhiker&amp;#039;s series, this gem will appeal to Douglas Adams fans, as well as lovers of British humor in general. \nCopyright Â© Reed Business Information, a division of Reed Elsevier Inc. All rights reserved. \n\nEntertainment Weekly\n?Rankin more than lives up to his deliriously inventive title?? \n\n See all Editorial Reviews \n\n--------------------------------------------------------------------------------\nProduct Details\n\nPaperback: 352 pages \nPublisher: Gollancz (August 1, 2003) \nLanguage: English \nISBN-10: 0575074019 \nISBN-13: 978-0575074019  \n","torrent":{"xt":"urn:btih:438f67954b8496521e42e74c2583f5ab109c85c8","amp;dn":"Robert+Rankin+-+The+Hollow+Chocolate+Bunnies+of+the+Apocolypse","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"438f67954b8496521e42e74c2583f5ab109c85c8","infoHashBuffer":{"type":"Buffer","data":[67,143,103,149,75,132,150,82,30,66,231,76,37,131,245,171,16,156,133,200]},"announce":[],"urlList":[]}}