{"title":"SURF - Zen And Zero","uid":3958463,"size":737830297,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:46a6fe31b04d2827ad18d57f3898ed951b4f6c0f&amp;dn=SURF+-+Zen+And+Zero&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"foufoune23","files":3,"time":1199304744,"description":"Quote:\n\nEditorial Reviews\nSURFER MAG (Oktober 2006)\nIf you ever needed reassurance that the rebel heart of surfing is still beating strong under the slow strangulation of rampant mainstreaming, this film is for you. Zen and Zero, which explores the ambiguous metaphors of surfing through the dust-choked eyes of five transplanted Austrians on the quintessential pig-latitude road-trip, swept Best Story and Best Director at this year&amp;#039;s X-Dance film festival and continues to garner trophies on its international festival run. Employing a hardboiled Hunter S. Thompson-esque narration style crossed with a driving, surf-meets-Spaghetti-Western soundtrack (masterfully scored by Herwig Maurer), this soulful 16mm film lets you ride shotgun on a 7,000-mile surfing pilgrimage, complete with flat tires, Federales and happy buzzards feasting on bloated road-kill. Paying tribute to Bruce Brown&amp;#039;s 1960 classic, Surf Crazy, the crew of amiable Austrians journeys the length of the Pan-American Highway from Los Angeles to Costa Rica in search of Captain Zero and the zeitgeist of Dudeness.? Funded mostly on the film-makers&amp;#039; credit cards, Zen and Zero is refreshingly free of gratuitous logo shots and forced sponsored-rider antics, proving that surfing is not so much about riding a wave as living on one. - Steve Barilotti\n\n\n:unquote\n\nGuys, this is my favourite surf-trip movie. Firstly, if you&amp;#039;d have laughed your ass off as much aseveryone did reading A.C. Weisbecker&amp;#039;s &quot;Cosmic Banditos&quot; book, then, if you enjoyed the book that inspired those feloow austrian (in search of Captain&amp;#039; Zero), you&amp;#039;ll more than want to watch this! Even my girlfriend was stoked hehe.\n\n- and yes, please seed well afterwards, I won&amp;#039;t seed it much long.\n\nCheerz","torrent":{"xt":"urn:btih:46a6fe31b04d2827ad18d57f3898ed951b4f6c0f","amp;dn":"SURF+-+Zen+And+Zero","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"46a6fe31b04d2827ad18d57f3898ed951b4f6c0f","infoHashBuffer":{"type":"Buffer","data":[70,166,254,49,176,77,40,39,173,24,213,127,56,152,237,149,27,79,108,15]},"announce":[],"urlList":[]}}