{"title":"The Wire Bajo Escucha 4x01 [DVD DVB][Spanish]","uid":4387774,"size":357572632,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:47298f18bef5acf27be2b8d3fe38f5014387742d&amp;dn=The+Wire+Bajo+Escucha+4x01+%5BDVD+DVB%5D%5BSpanish%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Mois20","files":2,"time":1221003158,"description":"The Wire: Bajo escucha es una producciÃƒÂ³n alabada por la crÃƒÂ­tica norteamericana como posiblemente la mejor de HBO, cadena norteamericana que ha producido algunas de las series mÃƒÂ¡s revolucionarias de la dÃƒÂ©cada como A dos metros bajo tierra, Los Soprano o Sexo en Nueva York. En esta ocasiÃƒÂ³n, los responsables de HBO abordan el gÃƒÂ©nero de detectives. Sin embargo, fieles a su estilo rupturista, le han dado una vuelta y han logrado un producto mÃƒÂ¡s original, rompiendo consignas moralistas y difuminando la frontera entre el Bien y el Mal. Centrada en el trÃƒÂ¡fico de droga, The Wire: Bajo escucha ofrece un retrato crudo y realista del enfrentamiento en la calle entre la ley y los capos del narcotrÃƒÂ¡fico, pero tambiÃƒÂ©n de las rivalidades que afectan a cada uno de estos bandos. AsÃƒÂ­, policÃƒÂ­as de a pie, equipo de la brigada antinarcÃƒÂ³ticos, federales del FBI, concejales, y jueces rivalizan entre sÃƒÂ­, al tiempo que se oponen a los grandes seÃƒÂ±ores de la droga, a su vez ocultos detrÃƒÂ¡s de una madeja de traficantes y camellos de poco monta. Con una realizaciÃƒÂ³n muy moderna, en la que vemos planos cenitales, tomados desde ÃƒÂ¡ngulos imposibles; una iluminaciÃƒÂ³n que en ocasiones define claramente el contraste entre los pasillos de la ley y la agresividad de la calle; y unos guiones que no ahorran prendas a la hora de reflejar la crudeza del lenguaje policial o marginal, The Wire: Bajo escucha es deudora de algunos filmes recientes como Traffic y, sin duda, la ficciÃƒÂ³n televisiva mÃƒÂ¡s realista hasta la fecha sobre el mundo del trÃƒÂ¡fico de drogas. Destaca en este sentido la presencia en el equipo de producciÃƒÂ³n de destacados guionistas, como Richard Price, autor de destacadas novelas y de los guiones de Clockers, de Spike Lee; MelodÃƒÂ­a de seducciÃƒÂ³n, de Harold Becker; o El color del dinero, de Martin Scorsese. La acciÃƒÂ³n tiene lugar en Baltimore, prÃƒÂ³spera ciudad de la costa Este norteamericana, que no llega al volumen de poblaciÃƒÂ³n de urbes como Nueva York o Los Angeles, pero que sirve como microcosmos del diseÃƒÂ±o y organizaciÃƒÂ³n del trÃƒÂ¡fico de toda clase de estupefacientes. Hilo conductor de la acciÃƒÂ³n y protagonista mÃƒÂ¡s destacado de la serie es el personaje del agente James McNulty, policÃƒÂ­a empeÃƒÂ±ado en atrapar a uno de los grandes responsables del trÃƒÂ¡fico de drogas en Baltimore, que es asignado a dedo a la brigada antinarcÃƒÂ³ticos, despertando recelos a su alrededor y enfrentÃƒÂ¡ndose al poder judicial. El actor britÃƒÂ¡nico Dominic West da vida a este personaje. West, cuyo ÃƒÂºltimo estreno en EspaÃƒÂ±a es el filme Misteriosa obsesiÃƒÂ³n, junto a Julianne Moore, cuenta con una interesante carrera cinematogrÃƒÂ¡fica con apariciones en las pelÃƒÂ­culas La sonrisa de Mona Lisa, con Julia Roberts; el oscarizado musical Chicago, el drama 28 DÃƒÂ­as, con Sandra Bullock, o Star Wars: Episodio 1. La amenaza fantasma, de George Lucas. El extenso reparto de The Wire: Bajo escucha incluye un elenco lleno de rostros habituales del cine y la pequeÃƒÂ±a pantalla. Entre los mÃƒÂ¡s destacados, forman el equipo legal los actores John Doman (Mercury Rising, Cop Land) como el magistrado William Rawls; Wendell Pierce (Sleepers, Esperando un respiro, Misterioso asesinato en Manhanttan, Ley y orden), como el detective William Moreland; Sonja Sohn (Shaft), como la detective de narcÃƒÂ³ticos Shakima Greggs; Deirdre Lovejoy (El ala Oeste de la Casa Blanca), como la ayudante del fiscal del distrito; Lance Reddick (Ni una palabra), como el Teniente Cedric Daniels; o Aidan Gillen (CÃƒÂ­rculo de amigos), como el concejal Thomas Carcetti. Por lo que respecta al lado de los traficantes, The Wire: Bajo escucha cuenta con Idris Elba (CSI Miami), como el capo Russell Bell; Larry Gillard (GÃƒÂ¡nsters de Nueva York), como el traficante D?Angelo Barksdale; Wood Harris (Mejor imposible), como el traficante Aron Backsdale; o Andre Rojo (Ley y orden), como el camello Bubbles.","torrent":{"xt":"urn:btih:47298f18bef5acf27be2b8d3fe38f5014387742d","amp;dn":"The+Wire+Bajo+Escucha+4x01+%5BDVD+DVB%5D%5BSpanish%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"47298f18bef5acf27be2b8d3fe38f5014387742d","infoHashBuffer":{"type":"Buffer","data":[71,41,143,24,190,245,172,242,123,226,184,211,254,56,245,1,67,135,116,45]},"announce":[],"urlList":[]}}