{"title":"Great Masters Series: Harmensz van Rijn Rembrandt -Michel- PDF [","uid":10218946,"size":49910853,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:47e1d8d56d1126baa812fbb56dc1b83a9e8427dd&amp;dn=Great+Masters+Series%3A+Harmensz+van+Rijn+Rembrandt+-Michel-+PDF+%5B&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"K-Slender","files":3,"time":1401001225,"description":" &lt;a href=&quot;http://i.imgur.com/EPTbRA0.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://i.imgur.com/EPTbRA0.jpg&lt;/a&gt;\n\nISBN-13: 9781780423005\nPublisher: Parkstone International\nPublication date: 7/1/2011\nSeries: Great Masters\n\nRembrandt is completely mysterious in his spirit, his character, his life, his work and his method of painting. What we can divine of his essential nature comes through his painting and the trivial or tragic incidents of his unfortunate life; his penchant for ostentatious living forced him to declare bankruptcy. His misfortunes are not entirely explicable, and his oeuvre reflects disturbing notions and contradictory impulses emerging from the depths of his being, like the light and shade of his pictures. In spite of this, nothing perhaps in the history of art gives a more profound impression of unity than his paintings, composed though they are of such different elements, full of complex significations. One feels as if his intellect, that genial, great, free mind, bold and ignorant of all servitude and which led him to the loftiest meditations and the most sublime reveries, derived from the same source as his emotions. From this comes the tragic element he imprinted on everything he painted, irrespective of subject; there was inequality in his work as well as the sublime, which may be seen as the inevitable consequence of such a tumultuous existence. It seems as though this singular, strange, attractive and almost enigmatic personality was slow in developing, or at least in attaining its complete expansion. Rembrandt showed talent and an original vision of the world early, as evidenced in his youthful etchings and his first self-portraits of about 1630. In painting, however, he did not immediately find the method he needed to express the still incomprehensible things he had to say, that audacious, broad and personal method which we admire in the masterpieces of his maturity and old age. In spite of its subtlety, it was adjudged brutal in his day and certainly contributed to alienate his public. From the time of his beginnings and of his successes, however, lighting played a major part in his conception of painting and he made it the principal instrument of his investigations into the arcana of interior life. It already revealed to him the poetry of human physiognomy when he painted The Philosopher in Meditation or the Holy Family, so deliciously absorbed in its modest intimacy, or, for example, in The Angel Raphael leaving Tobias. Soon he asked for something more. The Night Watch marks at once the apotheosis of his reputation. He had a universal curiosity and he lived, meditated, dreamed and painted thrown back on himself. He thought of the great Venetians, borrowing their subjects and making of them an art out of the inner life of profound emotion. Mythological and religious subjects were treated as he treated his portraits. For all that he took from reality and even from the works of others, he transmuted it instantly into his own substance. ","torrent":{"xt":"urn:btih:47e1d8d56d1126baa812fbb56dc1b83a9e8427dd","amp;dn":"Great+Masters+Series%3A+Harmensz+van+Rijn+Rembrandt+-Michel-+PDF+%5B","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"47e1d8d56d1126baa812fbb56dc1b83a9e8427dd","infoHashBuffer":{"type":"Buffer","data":[71,225,216,213,109,17,38,186,168,18,251,181,109,193,184,58,158,132,39,221]},"announce":[],"urlList":[]}}