{"title":"The.Miracle.at.Garabandal.mp4","uid":9776323,"size":199244602,"categoryP":"video","categoryS":"movie_clips","magnet":"?xt=urn:btih:4843d1a4c1cbc1591f2d0aaa516b2b1c5671baa2&amp;dn=The.Miracle.at.Garabandal.mp4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"catholicpdf","files":1,"time":1395039081,"description":"The Miracle at Garabandal, Spain\n01:10:21 Hr:Mins:Sec\n\n\n\nGarabandal is a small village in northern Spain, in the Santander province, near the Picos de Europa mountains, a rugged and beautiful setting. Its full name is San Sebastian of Garabandal. It is located 600 meters above sea level, some 57 miles from the capital of the province. To get there one must climb steep, poor roads. No more than 300 people live in Garabandal. The town is impressively quiet. There is no doctor in the town and no resident pastor at the parish church. The pastor from Cosio, the next town down the road, used to celebrate Mass there on Sunday.\n\nIn the evening of June 18, 1961, four girls were playing on the outskirts of the town - Conchita Gonzalez, Maria Dolores (Mari-loli) Mazon, Jacinta Gonzalez and Maria Cruz Gonzalez (not related despite having the same name.) Maria Cruz was eleven, the others twelve, and all were from poor families.\n\nSuddenly they heard a loud noise, like thunder, and saw before them the bright figure of the Archangel Michael. On the following days the Archangel appeared to them again in the same place. He announced that on July 2 they would see Our Lady. This was the beginning of the Garabandal events. \n\n","torrent":{"xt":"urn:btih:4843d1a4c1cbc1591f2d0aaa516b2b1c5671baa2","amp;dn":"The.Miracle.at.Garabandal.mp4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4843d1a4c1cbc1591f2d0aaa516b2b1c5671baa2","infoHashBuffer":{"type":"Buffer","data":[72,67,209,164,193,203,193,89,31,45,10,170,81,107,43,28,86,113,186,162]},"announce":[],"urlList":[]}}