{"title":"Stonebride - Discography","uid":5542342,"size":244383807,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:48af8f42900411ac02fade1d931d388b90cb8e86&amp;dn=Stonebride+-+Discography&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Baphom3t","files":17,"time":1273273558,"description":"STONEBRIDE is a band from Zagreb, Croatia, that seek its own musical and spiritual philosophy since the winter of 2005. Band recorded and self-released three track EP called SMILE &amp; SHINE in September 2006. Huge ammount of gigs were played and the first European tour took place . In 2007. the band worked on new songs and recorded them for a future release. The legendary engine-ear and producer, mr. Billy Anderson who has worked with the bands as NEUROSIS, THE MELVINS, SLEEP, KISS IT GOODBYE, EYEHATEGOD, FANTOMAS, HIGH ON FIRE, OM, SICK OF IT ALL, BOTTOM, CAVITY, BONGZILLA, ACID KING, LOS NATAS, SUMA etc., took care of mixing, mastering and additional noising of the albuml! INNER SEASONS was the name and it showed intension to progress and to further evolve. In 2008. the band went on several occasions to play all over Europe which also included a month long tour in May 2008. On that tour the band was approached by a record label who shared the same passion and vision for the music. \n\nAs a result, INNER SEASONS ended up beeing Stonebrides' first official release on CD and LP (black and blue versions), through Berlin based Seta.light records from Germany and even more gigs came on to the menu,including some cool festivals like SWAMP ROOM MANIA and STONED FROM THE UNDERGROUND. .........SUMMON THE WAVES is the name of sophomore, second official release from the Croatian quartet. It represents a certain turning point in the constant quest of finding and stepping into new territories, both musically and mentally. It represents a certain state of mind and the mixture of ''heavy blues coloured sound, ambiental trance Rock, alternative and psychedelic elements, combined with space parts and melodious vocals''... the message for millions to follow........ Many stages were torn apart with unbeliavable bands from all over: SUMA, ULTRAPHALLUS , FLU.ID, GET HUSTLE , ZIPPO , STINKING LIZAVETA, VANDAL X , RAMON ZARATE, TONER LOW, KARMA TO BURN, ALIX, MONKEY 3, COLOUR HAZE, THE FREEKS, MY SLEEPING KARMA, TARENTATEC, CHERRY CHOKE, MAJMOON, COOGAN'S BLUFF, BURN PILOT, DUKATALON, BORN TO HULA, TALBOT etc.. Members of Stonebride have played or still play in bands: GOOD DAY TO DIE, IGUT, CHANG FFOS, BASTINADO, THE LIGHTROOM, DIRT, TARAPANA, ZEUS FABER, PRISON PLANET, ILIJINI SINOVI, RADIO FREE ISAAC and D POLIKKIA.\n\nCurrent line-up\nThee Steps : Drums\nLenny - Bass\nKrnfa - Vocals\nTjemisir - Guitar\n\nAlbums in this realese:\n\nSmile and Shine (2007)  &lt;---- 256 kbps\nInner Seasons (2008)    &lt;---- 320 kbps\nSummon The Waves (2010) &lt;---- 320 kbps \n\nGenre = Stoner / Doom Metal\nFormat = mp3\nBit Rate = vbr (different for each album)","torrent":{"xt":"urn:btih:48af8f42900411ac02fade1d931d388b90cb8e86","amp;dn":"Stonebride+-+Discography","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"48af8f42900411ac02fade1d931d388b90cb8e86","infoHashBuffer":{"type":"Buffer","data":[72,175,143,66,144,4,17,172,2,250,222,29,147,29,56,139,144,203,142,134]},"announce":[],"urlList":[]}}