{"title":"John Cowan - the Massenburg Sessions [2010][EAC.Log,Cue.FLAC]","uid":9291199,"size":328557557,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:49309e3f6d5f222547c98af6d90948848fa0a92a&amp;dn=John+Cowan+-+the+Massenburg+Sessions+%5B2010%5D%5BEAC.Log%2CCue.FLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dickspic","files":17,"time":1386095277,"description":"Artist: John Cowan\nRelease: the Massenburg Sessions\nReleased: 2010\nLabel: E1 Entertainment \nCatalog#:E1E-CD-2304\nFormat: FLAC / Lossless / Log (100%) / Cue\nCountry: USA\nStyle: americana,bluegrass,country\n\nimage\n\n\n1\tMy Time in the Desert/Maggie Little\t\n2\tCaldonia\t\n3\tKing of California\t\n4\tLakes of Ponchartrain\t\n5\tJesus Gave Me Water\t\n6\tLong Road Back to You\t\n7\tSafe Within Your Arms\t\n8\tCarry On\t\n9\tHeart of the Country\t\n10\tCan't You Hear Me Callin'\t\n11\tBlack Blizzard\t\n12\tSoiled Dove\t\n13\tSoiled Dove (Reprise)\n\n\n\n\n\nBy calling this album The Massenburg Sessions, contemporary bluegrass singer/bassist John Cowan puts the spotlight on the audiophile recording and mastering engineer George Massenburg, known for his work with Linda Ronstadt and Randy Newman, among others. Cowan and Massenburg recorded the music live in the studio, with no overdubs, no editing, and even no headphones for the musicians. Of course, no mixing was required, either, with the sound achieved through placement of the instruments and microphones in the studio. The resulting sound is excellent, but no better than what can be achieved through the usual techniques. For listeners, this is all really inside baseball, but it seems to have allowed Cowan to achieve a spirit of performance he found conducive to his typically vibrant and eclectic approach. The former New Grass Revival member continues to look for novel ways to play bluegrass, and here he finds them by adapting the Louis Jordan jump blues classic &quot;Caledonia&quot;; forging a hybrid between Cajun and Celtic on the traditional &quot;The Lakes of Ponchartrain&quot; (while welcoming duet partner Maura O'Connell); going a cappella for the gospel tune &quot;Jesus Gave Me Water&quot;; and bringing out the bluegrass implications of Paul and Linda McCartney's &quot;Heart of the Country.&quot; &quot;Black Blizzard&quot; features only Cowan's keening tenor and Shad Cobb's fiddle, and the album concludes with a string quartet arrangement of Cowan and Jon Randall Stewart's &quot;Soiled Dove.&quot; Those are the major variations from the bluegrass format, which is given its purest expression in a version of Bill Monroe's &quot;Can't You Hear Me Callin'&quot; on which Cowan is accompanied by the Del McCoury Band, but also is found on other songs, reassuring listeners that, if Cowan wants to take bluegrass in new directions, he also is willing to play it straight...\n","torrent":{"xt":"urn:btih:49309e3f6d5f222547c98af6d90948848fa0a92a","amp;dn":"John+Cowan+-+the+Massenburg+Sessions+%5B2010%5D%5BEAC.Log%2CCue.FLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"49309e3f6d5f222547c98af6d90948848fa0a92a","infoHashBuffer":{"type":"Buffer","data":[73,48,158,63,109,95,34,37,71,201,138,246,217,9,72,132,143,160,169,42]},"announce":[],"urlList":[]}}