{"title":"[2000] Sonique - Hear My Cry [CDRip - flac]","uid":5341889,"size":365671701,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:4974490a325a396714d5b8292d4eef12b54484cf&amp;dn=%5B2000%5D+Sonique+-+Hear+My+Cry+%5BCDRip+-+flac%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ddawg","files":-1,"time":1265509785,"description":" &lt;a href=&quot;http://g-ecx.images-amazon.com/images/G/01/ciu/2a/1f/d7a812bb9da00ac18056b010.L.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://g-ecx.images-amazon.com/images/G/01/ciu/2a/1f/d7a812bb9da00ac18056b010.L.jpg&lt;/a&gt;\n\n\nTitle: Hear My Cry\nArtist: Sonique \nAudio CD (February 15, 2000) \nOriginal Release Date: February 15, 2000 \nNumber of Discs: 1 \nGenre: Club-House\nFormat: flac\n\n\nTrack Listing:\n\n01. It Feels So Good\n02. I Put a Spell On You\n03. Are You Ready?\n04. Cold N' Lonely\n05. Drama\n06. Move Closer\n07. Can't Get Enough\n08. Hear My Cry\n09. Empty (Hideaway)\n10. Love Is on Our Side\n11. Sky\n12. Learn To Forget \n\n\nAllmusic Review:\nSonique's debut album Hear My Cry may be a little too diverse for its own good; then again, it could just be a case of missed expectations. The hit single &quot;It Feels So Good&quot; is a dynamite dance-club item, blending straight-ahead dance with flourishes of techno and a sweet, catchy melody. It is a bright, fresh single that sets the stage for an album's worth of similar material, not just because it was the first hit, but because it kicks off the record. That's not quite what Hear My Cry delivers, however. There is quite a lot of dance here, including the terrific Thunderpuss 2000-produced &quot;Love Is on Our Side,&quot; but it's tempered by glossy urban soul with Eurodance underpinning. It's kind of like Soul II Soul, filtered through M People and performed by a cross between Dionne Farris and Mary J. Blige, only without any sense of hip-hop. That may disappoint listeners that want more of &quot;It Feels So Good,&quot; even if the record does serve some of that up. And since it doesn't quite follow through with its soul inclinations, it might not please most urban R&amp;B fans either. That's not a bad thing, however, since it's refreshing to hear an album that attempts more than it achieves. Even if there are moments that don't quite work or some forgettable songs, much of it is exceptionally produced and Sonique's singing is usually compelling. For patient listeners, these things may balance out the lack of a song as exciting as &quot;It Feels So Good.&quot; \n \n\nAmazon Review:\nA pair of uptempo, minor-key tunes kick off this Brit diva's debut CD. The catchy opener, &quot;It Feels So Good,&quot; recalls both '80s freestyle and Cher's wildly successful hit single &quot;Believe.&quot; The next track, &quot;I Put a Spell on You,&quot; is &quot;inspired by&quot; (as the CD's sleeve puts it) Screamin' Jay Hawkins's classic R&amp;B gem of the same name. The new version has none of the 1956 original's over-the-top sense of absurdity and abandon; Sonique's &quot;Spell&quot; is a lean machine fueled by a disco bass throb, festooned by strings, and graced by Sonique's stylish vocals. Hear My Cry covers a lot of dance territory, from the dressed-up funk of &quot;Are You Ready?&quot; to the techno-tinged house of &quot;Love Is on Our Side.&quot; The album also includes an R&amp;B slow jam (&quot;Drama&quot;), gloomy trip-hop (&quot;Empty [Hideaway]&quot;), and a piano ballad (&quot;Learn to Forget&quot;). A fair amount of the disc's tracks are pedestrian, but what makes just about any of them worth checking out is Sonique's distinctive voice, an instrument with an unusual grain to it.","torrent":{"xt":"urn:btih:4974490a325a396714d5b8292d4eef12b54484cf","amp;dn":"%5B2000%5D+Sonique+-+Hear+My+Cry+%5BCDRip+-+flac%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4974490a325a396714d5b8292d4eef12b54484cf","infoHashBuffer":{"type":"Buffer","data":[73,116,73,10,50,90,57,103,20,213,184,41,45,78,239,18,181,68,132,207]},"announce":[],"urlList":[]}}