{"title":"FEZ UPDATE 1.06a-GOG","uid":8473798,"size":5101176,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:4a2922d682928237de8e9ddaa1fc1d1531fb8953&amp;dn=FEZ+UPDATE+1.06a-GOG&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Gh0stNet","files":1,"time":1368561012,"description":"This is the official GOG.com release of FEZ.\n\n--\n\nDescription from GOG.com:\n\n\nWhat's cool about it:\n\nExplore a magical 3D world without conflict or enemies, rich with ambiance, a pleasant place to spend time in.\nGo anywhere you please as there is no one path, no right or wrong way to play.\nRotate your perspective to navigate the complex environments, solve puzzles, and find secrets!\n\nOverview:\n\nGomez is a 2D creature living in a 2D world. Or is he? When the existence of a mysterious 3rd dimension is revealed to him, Gomez is sent out on a journey that will take him to the very end of time and space. Use your ability to navigate 3D structures from 4 distinct classic 2D perspectives. Explore a serene and beautiful open-ended world full of secrets, puzzles and hidden treasures. Unearth the mysteries of the past and discover the truth about reality and perception, in this phenomenal puzzle-platformer!\n\nChangelog:\n\nVersion 1.06\n------------\n- Fixed stuck doors for the weightswitch, owl and waterfall puzzle doors\n- Fixed that the New Game+ state would get cleared after exiting the game without starting a New Game+\n- Fixed bug where the save selection would show the red save icon but not progress to the main menu\n- Fixed bug related to music streaming and threading lock usage\n- Added CLI flag to address threaded content loading issues : --singlethreaded\n- Fixed stuck dot dialog when getting hurt by a bomb while she's talking\n- Added back the missing falling &quot;text&quot; during the hexahedron encounter cutscene\n- Added error messages for unsupported Intel driver versions\n- When setting an unsupported resolution, the game now falls back to the current/native one\n- Tentative fix for bugs related to not-a-number floating point errors in the camera math\n- Default menu highlight is on Start New Game+ when it's available, to reduce accidental save file clearing\n- Added a controller vibration toggle in game options\n- Fixed rare bug related to the tuning fork puzzles\n- Fixed bug where the application data directory is written to before being created\n\nVersion 1.05\n------------\n- Fixed the &quot;Error initializing audio subsystem&quot; error\n- Fixed the bug where &quot;Continue Game&quot; is greyed out when reloading a valid save game\n- Fixed that map icons did not show up on Intel HD Graphics chips\n- Running the game &quot;As Administator&quot; should not necessary anymore\n- Fixed random crash bug when loading between levels\n- Tentative fix for transitioning to levels in the background while using endgame feature\n- Game now checks for available disc space on start (200Mb required)\n- Added CLI flag to disable joystick support : --no-gamepad\n- Added CLI flag to assume/force 60fps : --force-60hz (this is equivalent to the MonoGame DLL hack that's been going around)\n- Added CLI flag for debug tracing : --trace (please use this when reporting crashes)\n- Fixed sprite alignment of corner ledge animations\n- Final cutscene will play even if you glitched your way to more than 64 cubes\n- Added tentative support for retroactive or glitched/non-unlocked achievements (Steam)\n- Fixed cloning/duplicate/infinite anti-cube glitch\n- Game should not force a resolution that is not supported by the display device on first run\n- Added slightly broader support for Intel HD cards with outdated drivers\n- NOTE : The &quot;Debug Log.txt&quot; file is now located in %APPDATA%FEZ, the one in the FEZ directory is stale and won't be written to\n\nVersion 1.04\n------------\n- Tentative fix for missing world map icons on Intel HD Graphics 3000 and 4000 cards\n- Added experimental CLI flag for variable timestep (--variable-time-step), may break game physics, try at your own risk!\n- Fixed possible crash during loading screens\n- Fixed window scaling problem when using higher Windows DPI settings\n- Fixed leaderboard crash with unmapped characters in usernames\n- Game no longer forces 1280x720 resolution on first run if it's not supported\n- Sound effect volume setting now applied when starting game\n- Fixed possible crash with music buffering\n- Fixed problem where doors would remain closed forever after exiting or crashing out of a level\n- Tentative fix for invisible pages in tome\n- Number of anti-cubes now capped at 32, if you somehow manage to find 33!","torrent":{"xt":"urn:btih:4a2922d682928237de8e9ddaa1fc1d1531fb8953","amp;dn":"FEZ+UPDATE+1.06a-GOG","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4a2922d682928237de8e9ddaa1fc1d1531fb8953","infoHashBuffer":{"type":"Buffer","data":[74,41,34,214,130,146,130,55,222,142,157,218,161,252,29,21,49,251,137,83]},"announce":[],"urlList":[]}}