{"title":"Handbook of Photovoltaic Science and Engineering","uid":14535103,"size":17965419,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4a8e625358a3cc4d785e5f2144dc27721a6fb7d5&amp;dn=Handbook+of+Photovoltaic+Science+and+Engineering&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1462487946,"description":"Handbook of Photovoltaic Science and Engineering - A. Luque and S. Hegedus (Wiley, 2011).pdf\r\n\r\nThe most comprehensive, authoritative and widely cited reference on photovoltaic solar energy\r\n\r\nFully revised and updated, the Handbook of Photovoltaic Science and Engineering, Second Edition incorporates the substantial technological advances and research developments in photovoltaics since its previous release. All topics relating to the photovoltaic (PV) industry are discussed with contributions by distinguished international experts in the field.\r\n\r\nSignificant new coverage includes:\r\n\r\nthree completely new chapters and six chapters with new authors\r\ndevice structures, processing, and manufacturing options for the three major thin film PV technologies\r\nhigh performance approaches for multijunction, concentrator, and space applications\r\nnew types of organic polymer and dye-sensitized solar cells\r\neconomic analysis of various policy options to stimulate PV growth including effect of public and private investment\r\n\r\nDetailed treatment covers:\r\n\r\nscientific basis of the photovoltaic effect and solar cell operation\r\nthe production of solar silicon and of silicon-based solar cells and modules\r\nhow choice of semiconductor materials and their production influence costs and performance\r\nmaking measurements on solar cells and modules and how to relate results under standardised test conditions to real outdoor performance\r\nphotovoltaic system installation and operation of components such as inverters and batteries.\r\narchitectural applications of building-integrated PV\r\n\r\nEach chapter is structured to be partially accessible to beginners while providing detailed information of the physics and technology for experts. Encompassing a review of past work and the fundamentals in solar electric science, this is a leading reference and invaluable resource for all practitioners, consultants, researchers and students in the PV industry","torrent":{"xt":"urn:btih:4a8e625358a3cc4d785e5f2144dc27721a6fb7d5","amp;dn":"Handbook+of+Photovoltaic+Science+and+Engineering","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4a8e625358a3cc4d785e5f2144dc27721a6fb7d5","infoHashBuffer":{"type":"Buffer","data":[74,142,98,83,88,163,204,77,120,94,95,33,68,220,39,114,26,111,183,213]},"announce":[],"urlList":[]}}