{"title":"DJ_APC Hardcore Megamix 2001","uid":7334341,"size":44981897,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:4ab998a6b3dbaafd22d53a8660eb0b4ef1d65bb9&amp;dn=DJ_APC+Hardcore+Megamix+2001&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"DJ_APC","files":3,"time":1339021588,"description":"For all the hardcore ravers out there!!!\n\nI created this megamix way back in 2001 (my first attempt at a megamix).  It features many hardcore tracks from the late '90's along with numerous samples from labels such as Rotterdam Records, Industrial Strength Records, Ruffneck Records and Killa Kanga Records and artists such as Ultrasonic, Lenny Dee, Rob Gee and DJ Paul.\n\nFeatures classic tracks such as: Hocus Pocus, Please Make Love To Me, Make That Move, Hard As Hell, Funky Tales and more.\n\nMovie quotes have also been added at intervals for some extra fun.  The sound quality is average, it was after all my first attempt at creating a megamix, haha.  The intention was to squeeze as many tracks and samples into the mix as possible.\nRuntime: 47 minutes\n\nWARNING:  This mix contains A LOT of offensive lyrics.  If you are easily offended this is not the mix for you!!\n\nDedicated to all the DJ's, artists, record labels and ravers that made the late '90s awesome.  If you were raving during that time you will recognise a lot of these tracks......enjoy.  \n\nMessage me if you want a specific track identified.  Any comments welcome","torrent":{"xt":"urn:btih:4ab998a6b3dbaafd22d53a8660eb0b4ef1d65bb9","amp;dn":"DJ_APC+Hardcore+Megamix+2001","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4ab998a6b3dbaafd22d53a8660eb0b4ef1d65bb9","infoHashBuffer":{"type":"Buffer","data":[74,185,152,166,179,219,170,253,34,213,58,134,96,235,11,78,241,214,91,185]},"announce":[],"urlList":[]}}