{"title":"(Blues-VA) Texas Blues 1927-1935","uid":6592192,"size":181139812,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:4ae2c8a190bd5a67030077f1ec0c7687ac9f859b&amp;dn=%28Blues-VA%29+Texas+Blues+1927-1935&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"nightissuchproximity","files":-1,"time":1312876652,"description":"mp3   320kbps\n\n\nTime: 75:24\nSize: 172.6 MB\nLabel: Document\nStyles: Acoustic Texas blues, Country blues, Pre-war blues\nYear: 1994\nArt: Front\n\n[2:48] 1. Coley Jones - Army Mule In No Man's Land\n[3:34] 2. Coley Jones - Traveling Man\n[3:18] 3. Coley Jones - Drunkard's Special\n[3:07] 4. Coley Jones - The Elder's He's My Man\n[3:14] 5. Bo Jones - Back Door Blues\n[3:01] 6. Bo Jones - Leavenworth Prison Blues\n[2:58] 7. Little Hat Jones - New Two Sixteen Blues\n[3:12] 8. Little Hat Jones - Two String Blues\n[3:04] 9. Little Hat Jones - Rolled From Side To Side Blues\n[3:10] 10. Little Hat Jones - Hurry Blues\n[3:12] 11. Little Hat Jones - Little Hat Blues\n[3:15] 12. Little Hat Jones - Corpus Blues\n[3:13] 13. Little Hat Jones - Kentucky Blues\n[3:09] 14. Little Hat Jones - Bye Bye Baby Blues\n[3:15] 15. Little Hat Jones - Cross The Water Blues\n[3:23] 16. Little Hat Jones - Cherry Street Blues\n[3:10] 17. Oak Cliff T-Bone (Walker) - Trinity River Blues\n[3:09] 18. Oak Cliff T-Bone (Walker) - Wichita Falls Blues\n[3:04] 19. Willie Reed - Dreaming Blues\n[3:17] 20. Willie Reed - Texas Blues\n[2:51] 21. Willie Reed - Leavin' Home\n[2:50] 22. Willie Reed - Goin' Back To My Baby\n[2:51] 23. Willie Reed - Some Low Down Groundhog Blues\n[3:08] 24. Willie Reed - All Worn Out And Dry Blues\n\nOne of Document's many regional blues anthologies, Texas Blues 1927-1935 is a particularly fine sampling of work by five different Lone Star bluesmen. You'll probably want to note that it contains T-Bone Walker's first two sides, which were waxed in Dallas near the end of 1929. Walker's primary inspirations were his boyhood friend Blind Lemon Jefferson, master guitarist Lonnie Johnson, and Johnson-influenced, Louisiana based Carl Davis, who backed Walker on this session along with pianist Douglas Fernell (or Finnell). For his first-ever 78 rpm phonograph record, Aaron Thibeaux Walker chose to be identified as &quot;Oak-Cliff T-Bone.&quot; Oak Cliff was a section of South Dallas which served as his stomping grounds and was already well on its way to becoming an important locus for the African American population. &quot;Trinity River Blues&quot; describes a devastating flood (presumably the one that took place in 1908), while &quot;Wichita Falls Blues&quot; is primarily about his girlfriend. In keeping with the interconnectivity that always seems to have characterized the Southwestern blues environment, this collection also brings to light the first four sides ever recorded by another mentor of Walker's, Coley Jones, who led the Dallas String Band and recorded with vocalist Bobbie Cadillac.\n\nWhat Jones performed at his session in December 1927 were comedic narrative routines that root back to folk tradition, vaudeville, minstrelsy, and medicine shows. (For a real treat, compare Coley's &quot;Drunkard's Special&quot; and &quot;Army Mule in No Man's Land&quot; to the monologues of old-time British comedian Stanley Holloway.) To vary the mix, the producers of this collection added six rare titles by Willie Reed and two by Bo Jones, whose sounds have been compared with those of Alabamian bluesman Barefoot Bill. These straightforward rural Southern blues rituals add substance and depth to an already richly stocked archive of vintage Texas blues. Even given the wealth of talent already described, some may regard the complete recorded works of George Dennis &quot;Little Hat&quot; Jones as the real goldmine at the heart of this collection. While everyone else on this disc worked out of Dallas, Little Hat's home turf was San Antonio, and that's where his ten titles were recorded in 1929 and 1930. Something about this man is mesmerizing, and exposure to his expressive voice and personalized guitar technique may be habit forming. Although he lived until 1981, these are apparently the only records Little Hat ever made under his own name. Like Carl Davis and Willie Reed, he also recorded with Alger Texas Alexander. &quot;Two String Blues&quot; and &quot;New Two Sixteen Blues&quot;, in fact, were cut on June 15, 1929, at the same session as Alexander's &quot;Ninety-Eight Degree Blues&quot; and &quot;Someday, Baby, Your Troubles Is Gonna Be Like Mine.&quot;\n","torrent":{"xt":"urn:btih:4ae2c8a190bd5a67030077f1ec0c7687ac9f859b","amp;dn":"%28Blues-VA%29+Texas+Blues+1927-1935","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4ae2c8a190bd5a67030077f1ec0c7687ac9f859b","infoHashBuffer":{"type":"Buffer","data":[74,226,200,161,144,189,90,103,3,0,119,241,236,12,118,135,172,159,133,155]},"announce":[],"urlList":[]}}