{"title":"Universal Soldier: Day of Reckoning ( Dk subs )","uid":8298946,"size":1418520715,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:4c0d14e9621ae60ffcbca8a8c124de7a4e35e998&amp;dn=Universal+Soldier%3A+Day+of+Reckoning+%28+Dk+subs+%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"slurpy97","files":-1,"time":1364220082,"description":"114 min  -  Action | Sci-Fi | Thriller  \n\n\nJohn awakens from a coma to discover his wife and daughter were slaughtered in a brutal home invasion. Haunted by images of the attack, he vows to kill the man responsible: Luc Deveraux. While John tries to piece his reality back together, things get more complicated when he is pursued by a relentless UniSol named Magnus. Meanwhile, Deveraux and surviving UniSol Andrew Scott are preparing to battle anarchy and build a new order ruled by Unisols without government oversight. They are weeding out the weak and constantly testing their strongest warriors in brutal, life-and-death combat. Luc has emerged operating the Unisol Church of Eventualism, taking in wayward Unisols whom the government has been secretly operating as remote-controlled sleeper agents. His mission is to liberate these Unisols from the implanted memories and the lies the government has inserted in them. As John gets closer to Deveraux and the rogue army of genetically enhanced warriors, he discovers more about himself ...\n\n\n\nContainer: MKV File\n\nTestet: WinRaR Extract to\n\nRemember to seed so others can get the same enjoyment of the movie that you've got.\nKeep in mind I can not give full speed to all, so if you're one of the lucky ones, help seed.\n\nAnd remember, because I upload in winRAR files, it does not mean that it is &quot;VIRUS&quot;.\n\nPress my name &quot;Realuploads&quot; and see my other uploads before you write crap.\n\n \n\nGreetings Realuploads ","torrent":{"xt":"urn:btih:4c0d14e9621ae60ffcbca8a8c124de7a4e35e998","amp;dn":"Universal+Soldier%3A+Day+of+Reckoning+%28+Dk+subs+%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4c0d14e9621ae60ffcbca8a8c124de7a4e35e998","infoHashBuffer":{"type":"Buffer","data":[76,13,20,233,98,26,230,15,252,188,168,168,193,36,222,122,78,53,233,152]},"announce":[],"urlList":[]}}