{"title":"Badminton Queen of India Saina Nehwal - Renu Saran","uid":9155271,"size":727741,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4cc34a5a47c6bf82120971045b7af59c2be1cdef&amp;dn=Badminton+Queen+of+India+Saina+Nehwal+-+Renu+Saran&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"Mohammad_AT","files":3,"time":1383764668,"description":"Saina Nehwal, the badminton queen of India, has become a role model to young women not only in our country but also across the globe over the last few years. Her growing popularity quotient soared higher after her Olympic feat in London in the year 2012; the year she earned the title of India's first shuttler to win a medal at the quadrennial event.\n\nThe living legend, Saina Nehwal, the best player of India and one of the top enterprising individuals in the world badminton map, holds an influential rank in the Badminton Globe Federation position. Her incredible success has made the country people proud and placed India on the international badminton arena. This young, immensely talented girl has proved that Indian players are capable of counter attacking the infamous control of China on the game.\n\nNehwal's unparalleled success as an international badminton player is one of the most inspiring and soul-stirring stories of Indian sports. The girl from a middle-class family was gradually groomed and transformed into a world-class player. The journey wasn't easy for Saina and her family but the girl managed to achieve great heights in the face of awesome odds.\n\nWe pray and wish that this 'Super Girl of India' accomplishes larger glorious heights for herself and the entire nation.","torrent":{"xt":"urn:btih:4cc34a5a47c6bf82120971045b7af59c2be1cdef","amp;dn":"Badminton+Queen+of+India+Saina+Nehwal+-+Renu+Saran","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4cc34a5a47c6bf82120971045b7af59c2be1cdef","infoHashBuffer":{"type":"Buffer","data":[76,195,74,90,71,198,191,130,18,9,113,4,91,122,245,156,43,225,205,239]},"announce":[],"urlList":[]}}