{"title":"Bob Marley And The Wailers - Natty Dread (1974) WMA320","uid":6076102,"size":107180302,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:4ce42081751067100d89342c0a8627cf191a5d6a&amp;dn=Bob+Marley+And+The+Wailers+-+Natty+Dread+%281974%29+WMA320&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"MARCELODRGZ","files":-1,"time":1293864343,"description":"After Bob Marleys recent split from the oringinal 3 Wailers, Bob had to come up with some way to get him back on track. \nSo by joining together his wife Rita Marley and Marcia Griffiths and Judy Mowatt known as the I-Threes and an American Guitarist Al Anderson he made his new Wailers with Familyman and Carly Barret still on Bass/Percussion. The band was now named, \n&quot;Bob Marley &amp; The Wailers.&quot; \n\nAnd about 10 months later they produced Natty Dread releasing October 25th 1974. \nThe album was not a huge succes unlike it is today, as the likes of Queen releasing Bohiem Rhapsody and Abba firmly in the charts, did not give Bob Marley a decent chance. \nNatty Dread however was still a solid albym. \n\nThe album kicks off with the groovy Lively Up Yourself, Bobs humour brings the song alive, along with Familymans amazing bass playing. 10/10 \n\nThe second song No Woman No Cry is a studio version of the legendary live version, nethertheless the song still is a very decent effort. 9/10 \n\nThird brings the inspiring Them Belly Full(But We Hungry) it is a rebel on how the rich greedly flash there money while the poor poeple are shunted to one side and left there to starve. 9/10 \n\nForth brings Rebel Music(3 O'clock Road Block) this is a very well produced song with a strong reggae feel. Bobs talking about his ambush in London. 8/10 \n\nFifth brings So Jah Seh, which was one of the singles, a very underated song, written by Rita Marley and Willy Francisco. 10/10 \n\nSixth brings Natty Dread a brilliant song, a catchy beat, talking about life in Trench Town. One of the many highlights of the album. 10/10 \n\nTrack numer seven brings Bend Down Low originally produced 1968 with Lee &quot;Scratch&quot; Perry, it is a very well thought of love song. 9/10 \n\nNumber eight sees Talkin' Blues an absoulute gem, its very nice to see Blue's with Reggae said Chris Blackwell. Another highlight of the album. 10/10 \n\nTrack nine Revoulution is probably the albums best, and is the most hard hitting song. Another excellent song written by Bob. 10/10 \n\nAnd finaly number tens Am-A-Do is a rare Bob song which originally appeared on the Talkin' Blues album. I must admit the song is addictively catchy, and sometimes you may find yourself humming the tune. A great way to end the album. 9/10 \n\nAll in all Natty Dread is a collection of classic songs its a pity that some of these songs arent as well known as they should be, and i cannot believe none made Legend. \n\nFeel free to buy any over Bob Marley albums as they are equally as good as this one. \nHis a list of them to help you. \n\n1. Catch A Fire released 13th April 1973 \n2. Burnin released October 19th 1973 \n3. Natty Dread released October 25th 1974 \n4. Live! released December 5th 1975 \n5. Rastaman Vibration released 15th January 1976 \n6. Exodus released June 3rd 1977 \n7. Kaya released March 23rd 1978 \n8. Babylon By Bus released October 12th 1978 \n9. Survival released October 2nd 1979 \n10. Uprising released June 10th 1980 \n11. Confrantation released May 23rd 1983 - recorded same time as Uprising though. \n\nMy favourite has to be Uprising but Natty Dread is still a all time classic. \n\nby AMAZON\n\nTRACKLIST:\n\n01 - Lively Up Yourself.wma                                 \n02 - No Woman, No Cry.wma                                   \n03 - Them Belly Full (But We Hungry).wma                    \n04 - Rebel Music (3 O'clock Roadblock).wma                  \n05 - So Jah Seh.wma                                         \n06 - Natty Dread.wma                                        \n07 - Bend Down Low.wma                                      \n08 - Talkin' Blues.wma                                      \n09 - Revolution.wma                                         \n10 - Am-a-do (Bonus Track).wma\n\nWMA 320Kbps 44100Hz STEREO","torrent":{"xt":"urn:btih:4ce42081751067100d89342c0a8627cf191a5d6a","amp;dn":"Bob+Marley+And+The+Wailers+-+Natty+Dread+%281974%29+WMA320","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4ce42081751067100d89342c0a8627cf191a5d6a","infoHashBuffer":{"type":"Buffer","data":[76,228,32,129,117,16,103,16,13,137,52,44,10,134,39,207,25,26,93,106]},"announce":[],"urlList":[]}}