{"title":"AC/DC - '74 Jailbreak [1984][2003][320 KBPS][JAPAN RMSTD]","uid":9077704,"size":63647528,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:4ce8bc19d7242751aa02bb9cb6220c8cac67fca0&amp;dn=AC%2FDC+-+%2774+Jailbreak+%5B1984%5D%5B2003%5D%5B320+KBPS%5D%5BJAPAN+RMSTD%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"LameDuck69","files":11,"time":1382320520,"description":"AC/DC - '74 Jailbreak [1984][2003][Japan Remaster]\n\n\n\n\n\n1. Jailbreak  \n2. You Ain't Got A Hold On Me  \n3. Show Business  \n4. Soul Stripper  \n5. &quot;Baby, Please Don't Go&quot;  \n\n\n\n\n\n320 KBPS\n\nCover Art\n\n\n\n\n\n\nFrom Wikipedia:\n\n\n\nAC/DC are an Australian hard rock band, formed in November 1973 by brothers Malcolm and Angus Young, who have remained constant members. Commonly referred to as a hard rock or blues rock band, they are also considered pioneers of heavy metal and are sometimes classified as such, though they have always dubbed their music as simply &quot;rock and roll&quot;. To date they are one of the highest-grossing bands of all time.\n\n-----------------------------------------------------------------------------------\n\nFrom Amazon:\n\n\n\nReleased for the American fans that were still paying attention, '74 Jailbreak was a short collection (only 24 minutes) of tracks taken from two Australia-only releases. &quot;Jailbreak&quot; had already appeared on the Australian version of Dirty Deeds Done Dirt Cheap, while the other ones were taken from High Voltage (1975). As for the quality of the songs, it's there! While not as heavy as the grinding crunch of Let There Be Rock or Powerage , the songs show a more blues-oriented version of the band, even more so than the American version of High Voltage (which leads me to presume the songs gathered here were taken from the band's early stages when they were still experimenting and trying to make sense of their own brilliant style). The undisputed highlight here is the title track, a delicious riff-rocker that has all of the Scott-era swagger and a bluesy core that was absent from the next line-up's releases. Other proof of the much more roots-oriented music of the band are the frantic boogie-rock of &quot;Show Business&quot; (with lots of nice soloing by an Angus, who was only 15 at the time) and Joe Williams' classic &quot;Baby Please Don't Go&quot; that's clearly based on the version of Ted Nugent's Amboy Dukes, and this implies it's fast `n nasty.\n\n&quot;You Ain't Got a Hold on Me&quot; and &quot;Soul Stripper&quot; are less impressive, the first one being a decent but unremarkable laidback blues-rocker, while the second one is a lengthy dirge that nevertheless contains some fiery guitar playin' and some rare percussion touches. So, '74 Jailbreak is obviously a must for any self-respecting fan, and we all know that a self-respecting AC/DC-fan is also a Bon Scott-fan, so there you go. I still haven't found an answer as to why it only contains five songs - for chrissakes! - and still costs as much as any other of their releases. It's a mystery why they didn't include the remaining songs from the Australian albums, such as &quot;School Days&quot; (from T.N.T.), &quot;Stick Around&quot; and &quot;Love Song&quot; (from High Voltage), &quot;R.I.P&quot; (from Dirty Deeds) or even the rare single version of &quot;Can I Sit Next to You Girl?&quot; they recorded with Dave Evans on vocals. All those would've fit on one shiny disc, and then the full-price would've been justified. Oh well, just ignore impotence and buy it anyway, after you've purchased all the other Scott-era albums, of course.\n\n","torrent":{"xt":"urn:btih:4ce8bc19d7242751aa02bb9cb6220c8cac67fca0","amp;dn":"AC%2FDC+-+%2774+Jailbreak+%5B1984%5D%5B2003%5D%5B320+KBPS%5D%5BJAPAN+RMSTD%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4ce8bc19d7242751aa02bb9cb6220c8cac67fca0","infoHashBuffer":{"type":"Buffer","data":[76,232,188,25,215,36,39,81,170,2,187,156,182,34,12,140,172,103,252,160]},"announce":[],"urlList":[]}}