{"title":"Omega The Unknown # 1-10 (Marvel)","uid":8751047,"size":183893319,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:4d59da5cf3bf26858338cd3075a3da3b724250fa&amp;dn=Omega+The+Unknown+%23+1-10+%28Marvel%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"fudoh101","files":10,"time":1375031536,"description":"Written by Jonathan Lethem\nIllustrated by Farel Dalrymple and Paul Hornschemeier\n\nGary Panter worked on # 7\n\nIn 2005, novelist Jonathan Lethem announced that he was planning to revive the character of Omega the Unknown, in collaboration with artist Farel Dalrymple, in a ten-issue limited series to be published in 2006. Lethem was a childhood fan of the first Omega series, and referenced the character in his 2003 novel The Fortress of Solitude. When asked about Omega's appeal, Lethem stated,\nWhen Marvel invited me into their vault of iconography, I simply leapt at the icon that resonated most deeply with me. It didn't hurt that Omega had been laying in neglect for so long, I might have had trouble trying to utilize a character who'd been put through so many paces as Spider-Man or the Hulk, say. Omega seemed a resource of thwarted possibility, open to speculation, not plumbed-out.\nAfter hearing of Lethem's plans to revive Omega, the character's co-creator Steve Gerber expressed personal outrage over the use of the character without his participation, though he and Mary Skrenes later discussed the project with Lethem and admitted that he had &quot;misjudged&quot; him. The first issue of the revamped Omega the Unknown was published in October 2007, and Marvel released another issue each month until the tenth was published in July 2008. All ten issues have been collected and reprinted in a single volume.\nThe series was nominated in the &quot;Best Limited Series&quot; and &quot;Best Lettering&quot; categories in the 2009 Eisner Awards. An excerpt was selected by Neil Gaiman to be anthologized in The Best American Comics 2010.","torrent":{"xt":"urn:btih:4d59da5cf3bf26858338cd3075a3da3b724250fa","amp;dn":"Omega+The+Unknown+%23+1-10+%28Marvel%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4d59da5cf3bf26858338cd3075a3da3b724250fa","infoHashBuffer":{"type":"Buffer","data":[77,89,218,92,243,191,38,133,131,56,205,48,117,163,218,59,114,66,80,250]},"announce":[],"urlList":[]}}