{"title":"La Amenaza Andromeda 2[Dvdrip][Spanish]","uid":4684224,"size":731480064,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:4d86e9c3e038bca2f6c87a511ba270c831b1ffd7&amp;dn=La+Amenaza+Andromeda+2%5BDvdrip%5D%5BSpanish%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"calasma","files":1,"time":1233176181,"description":"TÃƒÂ­tulo original:  \nAÃƒÂ±o: 2008 \nGÃƒÂ©nero: Ciencia Ficcion  \nDuraciÃƒÂ³n: 85 minutos \nSipnosis: La amenaza de AndrÃƒÂ³meda&quot; ha obtenido recientemente siete nominaciones a los Emmy, los premios mÃƒÂ¡s importantes de la televisiÃƒÂ³n en EE.UU: Mejor Miniserie, DirecciÃƒÂ³n ArtÃƒÂ­stica, FotografÃƒÂ­a, Maquillaje, Montaje, Sonido y Montaje de Sonido.\n\nDirigida por el dos veces nominado al Oscar, Mikael Salomon (&quot;Hard Rain&quot;) y adaptada para la pantalla por el premio Pulitzer Robert Schenkkan (&quot;El americano impasible&quot;) , &quot;La amenaza de AndrÃƒÂ³meda&quot; estÃƒÂ¡ protagonizada por Benjamin Bratt (&quot;El amor en tiempos de cÃƒÂ³lera&quot;), Eric McCormack (ganador de un Emmy por la serie &quot;Will y Grace&quot;) y Daniel Dae Kim (Jin en &quot;Perdidos&quot;).\n\nUn satÃƒÂ©lite militar americano, que porta una bacteria mortal llamada &quot;AndrÃƒÂ³meda&quot;, se estrella en una pequeÃƒÂ±a poblaciÃƒÂ³n del interior de los Estados Unidos. Esta extraÃƒÂ±a cepa, venida del espacio exterior, desencadena una letal plaga que acaba aniquilando a toda una poblaciÃƒÂ³n excepto a dos ÃƒÂºnicos supervivientes: un anciano y un bebÃƒÂ©.\n\nMientras el gobierno dispone un plan de cuarentena, un equipo de cientÃƒÂ­ficos especializados lucha por conseguir una cura que frene la propagaciÃƒÂ³n de este virus. La especie humana se enfrenta a un posible ataque alienÃƒÂ­gena que busca acabar con toda la vida en el planeta y su supervivencia dependerÃƒÂ¡ de estos hombres.\n\nNueva adaptaciÃƒÂ³n de la novela homÃƒÂ³nima de Michael Crichton (Jurassic Park), que ya fue llevada al cine con anterioridad por Robert Wise en 1971. En esta ocasiÃƒÂ³n dirige Mikael Salomon, dos veces nominado al Oscar - a la mejor fotografÃƒÂ­a por Abyss y a los mejores efectos visuales por Llamaradas -, segÃƒÂºn una adaptaciÃƒÂ³n de la historia realizada por el ganador de un Pulitzer, Robert Schenkkan (El americano impasible).\n\nLa cinta, producida por Scott Free Production (con los hermanos Ridley y Tony Scott al frente) estÃƒÂ¡ protagonizada por Benjamin Bratt (E-Ring, The Cleaner), Christa Miller (Scrubs), Eric McCormack (Will &amp; Grace), Ricky Schroder (PolÃƒÂ­cias de Nueva York), Andrew Braugher (Ladron, tambiÃƒÂ©n emitida por Canal+), Daniel Dae Kim (Perdidos, 24) y Viola Davis (Traveler, Ley y Orden: Unidad de VÃƒÂ­ctimas Especiales).","torrent":{"xt":"urn:btih:4d86e9c3e038bca2f6c87a511ba270c831b1ffd7","amp;dn":"La+Amenaza+Andromeda+2%5BDvdrip%5D%5BSpanish%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4d86e9c3e038bca2f6c87a511ba270c831b1ffd7","infoHashBuffer":{"type":"Buffer","data":[77,134,233,195,224,56,188,162,246,200,122,81,27,162,112,200,49,177,255,215]},"announce":[],"urlList":[]}}