{"title":"The Light and The Shadow. Illuminati Agenda- Spiritual Solutions","uid":11418305,"size":487972107,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:4dd38b58c521a66a7721991669f9a0e48f21d512&amp;dn=The+Light+and+The+Shadow.+Illuminati+Agenda-+Spiritual+Solutions&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"GoTo6666","files":1,"time":1415597498,"description":"\n\nThe Light &amp; the Shadow; Illuminati Agendas-Spiritual Solutions. Lecture recorded in Edgewater, Florida, 10/ 1999.\n\nBehind the scenes overview of contemporary Illuminati Agendas, Visitor presence, covert manipulation tactics, repression of scientific data on multi-dimensional reality. The science behind Metaphysics, human multi-dimensionality and spiritual integration (inc. Star Gate passage/ ascension). Becoming immune to covert manipulation tactics through understanding the science of our true Angelic/ multi-dimensional anatomy and reclaiming our full spiritual identity.\n\nCustomer Review:\nThis is a powerful mix of history, ET agendas, HAARP etc, ranging from World Management Team to Pyramids in Giza, and to understanding spirituality from a KS point of view. A very inspired Ash really shows her posture of &quot;THIS CAN BE DONE&quot;! To me it gave further insights and body to the Voyagers books. Due to rapid dispensations leading to Hetharo (Dance For Programs - 2003) I watched it for the first time 2 years after buying it. It still rocks! It really is an inspirational and powerful talk about being informed. A lot of goodies! And a bargain for the bucks!&quot;\nB.H., Sweden","torrent":{"xt":"urn:btih:4dd38b58c521a66a7721991669f9a0e48f21d512","amp;dn":"The+Light+and+The+Shadow.+Illuminati+Agenda-+Spiritual+Solutions","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4dd38b58c521a66a7721991669f9a0e48f21d512","infoHashBuffer":{"type":"Buffer","data":[77,211,139,88,197,33,166,106,119,33,153,22,105,249,160,228,143,33,213,18]},"announce":[],"urlList":[]}}