{"title":"BBC Long Shadow - 1. Remembering and Understanding - GHOST DOG","uid":11154114,"size":1051787080,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:4e14d40bd1267452e9a9bbf0554149db4171967b&amp;dn=BBC+Long+Shadow+-+1.+Remembering+and+Understanding+-+GHOST+DOG&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":3,"uploader":"marxph","files":2,"time":1412383423,"description":"David Reynolds traces the legacy of the Great War across 100 years and 10 different countries, examining how the war haunted a generation and shaped the peace that followed.\n\nPart 1: Remembering and Understanding\n\nDavid Reynolds shows how the common perception of the Great War as futile slaughter has been moulded over time. The image of mud and trenches, poets and poppies was not the general view in the 1920s and 1930s, but developed after the Second World War and most of all, through popular depictions of the war from the 1960s.\n\nReynolds gets to the roots of shifting public memory by comparing the British and German sense of what the Great War meant right back in its immediate aftermath. Britain invested in the diplomatic ideals of the League of Nations, and Reynolds charts the extraordinary popularity of disarmament movements. For many British people, the terrible sacrifice would not have be in vain if the Great War proved be the war to end war. Reynolds tells the story of the Peace Ballot of 1935, which attracted an extraordinary 11.9 million signatories who hoped to stop the slide to war of 1914 ever happening again. In Weimar and Berlin, Reynolds shows that, by contrast, what mattered for Germany was not preventing another 1914 but another 1918 - the year of humiliating defeat. He also examines the myth of the stab in the back which fuelled the rise of Adolf Hitler and another, even more appalling conflict.\n\nThe Second World War changed the meaning of the Great War, creating the sense that 1914-18 had been an ineffectual sacrifice that required a second round. Reynolds examines how in the 1960s a new, less deferential generation looked back at the First World War during the 50th anniversaries. In plays like Oh! What a Lovely War and the rediscovery of war poets like Wilfred Owen, they helped set the public memory of a futile war waged by stupid generals.\n &lt;a href=&quot;\nhttp://www.tvrage.com/shows/id-44987&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.tvrage.com/shows/id-44987&lt;/a&gt;\n\n[code]General\n\nRipper: marxph\nSource: WEB-DL\nFile Format: MP4\nDuration: 00:59:07\nBit Rate: 2371K\nFile Size: 1003.00 MB\n\nVideo\n\nVideo Codec: h264\nVideo Bitrate: 2273K\nVideo Size: 1280x720\nAspect Ratio: 1.78:1\nFrame Rate: 25.00fps\n\nAudio\n\nAudio Codec: AAC\nAudio Bitrate: 128K\nTrack: 2\nSample Rate: 48kHz[/code]\n\nghost dog...","torrent":{"xt":"urn:btih:4e14d40bd1267452e9a9bbf0554149db4171967b","amp;dn":"BBC+Long+Shadow+-+1.+Remembering+and+Understanding+-+GHOST+DOG","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4e14d40bd1267452e9a9bbf0554149db4171967b","infoHashBuffer":{"type":"Buffer","data":[78,20,212,11,209,38,116,82,233,169,187,240,85,65,73,219,65,113,150,123]},"announce":[],"urlList":[]}}