{"title":"Wolf's Rain","uid":15721157,"size":4121807408,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:4e808b075d4e6b62689da1bfe926a5bf3065b778&amp;dn=Wolf%27s+Rain&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"JQPL","files":30,"time":1472676547,"description":"This is a brand new rip from the DVD. Hopefully this lets people experience this show with the video quality it deserves instead of the interlaced blocky mess currently circulating around.\r\n\r\n***********\r\nSUMMARY\r\n***********\r\n\r\nIn a dying world, there exists an ancient legend: when the world ends, the gateway to paradise will be opened. This utopia is the sole salvation for the remnants of life in this barren land, but the legend also dictates that only wolves can find their way to this mythical realm. Though long thought to be extinct, wolves still exist and live amongst humans, disguising themselves through elaborate illusions.\r\n\r\nA lone wolf named Kiba finds himself drawn by an intoxicating scent to Freeze City, an impoverished town under the rule of the callous Lord Orkham. Here, Kiba discovers that wolves Hige, Tsume, and Toboe have been drawn in by the same aroma. By following the fragrance of &quot;Lunar Flowers,&quot; said to be the key to opening the door to their ideal world, the wolves set off on a journey across desolate landscapes and crumbling cities to find their legendary promised land. However, they are not the only ones seeking paradise, and those with more sinister intentions will do anything in their power to reach it first","torrent":{"xt":"urn:btih:4e808b075d4e6b62689da1bfe926a5bf3065b778","amp;dn":"Wolf%27s+Rain","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4e808b075d4e6b62689da1bfe926a5bf3065b778","infoHashBuffer":{"type":"Buffer","data":[78,128,139,7,93,78,107,98,104,157,161,191,233,38,165,191,48,101,183,120]},"announce":[],"urlList":[]}}