{"title":"Barenaked Ladies - Barenaked for the Holidays","uid":6032833,"size":311513286,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:4ea1673941df3d548a624915430573b5a7bb149d&amp;dn=Barenaked+Ladies+-+Barenaked+for+the+Holidays&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ddawg","files":-1,"time":1292137534,"description":"\n &lt;a href=&quot;\nhttp://ecx.images-amazon.com/images/I/517C225DZ0L._SS500_.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://ecx.images-amazon.com/images/I/517C225DZ0L._SS500_.jpg&lt;/a&gt;\n\n\nTitle: Barenaked for the Holidays\nArtist: Barenaked Ladies\nAudio CD (October 5, 2004) \nOriginal Release Date: October 5, 2004 \nNumber of Discs: 1 \nGenre: Christmas\nFormat: Free Lossless Audio Codec\n\n\nTrack Listing:\n\n01. Jingle Bells\n02. Green Christmas\n03. I Saw Three Ships\n04. Hanukkah Blessings\n05. O Holy Night \n06. Elf's Lament\n07. Snowman\n08. Do They Know It's Christmas?\n09. Hanukkah, Oh Hanukkah\n10. God Rest Ye Merry Gentlemen/We Three Kings\n11. Rudolph the Red-Nosed Reindeer\n12. Carol of the Bells\n13. Footprints  Robertson\n14. Deck the Stills\n15. Christmastime (Oh Yeah)\n16. Sleigh Ride\n17. Christmas Pics  \n18. I Have a Dreidel\n19. Wonderful Christmastime\n20. Auld Lang Syne\n\n\nAllmusic Review:\nIt's probably safe to say that fans of Barenaked Ladies have never found a holiday album to suit their tastes until now, when the notoriously quirky Canadian quintet released Barenaked for the Holidays. This will likely satisfy that portion of their audience (however large or small it is) that has wanted a holiday album delivered with that patented blend of jokiness and sentiment that's been the group's stock-in-trade. That may give the inaccurate impression that this album has been tossed off, which is hardly the case. The arrangements are nimble and largely clever, even when the group goes for an easy joke, as on the Casio-driven bossa nova instrumental revamp of &quot;Rudolph the Red-Nosed Reindeer.&quot; Admirably, the group doesn't rely solely on traditional carols, they contribute six originals to the mix; some, like &quot;Green Christmas,&quot; are quite good, while others, like &quot;Elf's Lament,&quot; are too jokey, but that may not bother the diehards all that much. Even more admirably, this is one of the few holiday albums that is pretty evenly divided between Christmas and Hanukkah songs, which isn't just nicely PC, but gives the album both musical and topical variety, making it a little more interesting and distinctive than the average holiday record. Still, whether you like the album or not boils down to this: do you find it funny when a slow, sincere version of &quot;Jingle Bells&quot; breaks into a jocular parody with the classic &quot;Jingle bells/Batman smells/Robin laid an egg&quot; lyric halfway through the song, and if you do, do you like the sentimental beginning as much as the silly conclusion? If so, Barenaked for the Holidays is for you. \n\nAmazon Review:\nFew bands are better suited than the Barenaked Ladies to take obnoxious old Christmas jingles to an entirely new level of obnoxiousness. The Canadian pop group does a smack-up job on this generous collection, where they tackle children's relics like &quot;Rudolph the Red-Nosed Reindeer,&quot; curious seasonal fare such as Band-Aid's Ethiopian charity single &quot;Do They Know It's Christmas,&quot; and a handful of tongue-in-cheek originals that share the bookish humor of the band's hits like &quot;One Week&quot; and &quot;Brian Wilson.&quot; Even the inclusion of three Hannukah songs doesn't raise the bar for reverence. The disc also includes collaborations with Sarah McLachlan and Michael Buble.","torrent":{"xt":"urn:btih:4ea1673941df3d548a624915430573b5a7bb149d","amp;dn":"Barenaked+Ladies+-+Barenaked+for+the+Holidays","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4ea1673941df3d548a624915430573b5a7bb149d","infoHashBuffer":{"type":"Buffer","data":[78,161,103,57,65,223,61,84,138,98,73,21,67,5,115,181,167,187,20,157]},"announce":[],"urlList":[]}}