{"title":"Your Highness(2011)DVDRip.AC3(ENG)-DROCK","uid":6826437,"size":733963115,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:4ecf4245cf24fec1876e222a47a03998dda83829&amp;dn=Your+Highness%282011%29DVDRip.AC3%28ENG%29-DROCK&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"drock232","files":-1,"time":1321582072,"description":"Pineapple Express co-stars Danny McBride and James Franco reunite for director David Gordon Green's fantasy comedy Your Highness, which sends up such beloved '80s gems as Krull and The Sword and the Sorcerer. Thadeous (McBride) has always stood in the shadow of his older brother, Fabious (Franco), a fearless knight who never met a Minotaur he couldn't slay or a warlord he couldn't defeat. Meanwhile, as Fabious embarked on incredible adventures and returned home to lavish celebrations, Thadeous puffed on wizard's weed, and spent his nights in the company of loose maidens. But Thadeous' life of luxury comes to an abrupt end when powerful wizard Leezar (Justin Theroux) shows up and abducts Fabious' beautiful fiancÃƒÂ©e, Belladonna (Zooey Deschanel). Now threatened with being cut off from the family fortune by his father, the king (Charles Dance), Thadeous reluctantly agrees to join Fabious on a treacherous quest to rescue the fair maiden, and defeat Leezar once and for all. Their voyage to rescue Belladonna will be marked by incredible adventure and unprecedented danger, but together with the help of a fearless warrior named Isabel (Natalie Portman) the two brothers will battle mythical beasts and villainous knights. Meanwhile, as Isabel carries out a clandestine agenda that could place them all in greater danger than they ever imagined, Thadeous struggles to summon his inner warrior and help his noble brother prevent Leezar from using his powers to usher in a terrifying new age of darkness.\n\nRipped with Handbrake.\n\nLength: 1 Hour 42 Minutes\n\nFile Type: MP4\n\nFrame Width: 624\n\nFrame Height: 352\n\nFrame Rate: 29fps\n\nAudio\n\nBit Rate: 159kbps","torrent":{"xt":"urn:btih:4ecf4245cf24fec1876e222a47a03998dda83829","amp;dn":"Your+Highness%282011%29DVDRip.AC3%28ENG%29-DROCK","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4ecf4245cf24fec1876e222a47a03998dda83829","infoHashBuffer":{"type":"Buffer","data":[78,207,66,69,207,36,254,193,135,110,34,42,71,160,57,152,221,168,56,41]},"announce":[],"urlList":[]}}