{"title":"Brunelleschi's Dome: How a Renaissance Genius Reinvented Archite","uid":7564735,"size":283471938,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:4f09644972b1ad97485e6271de01402af31844ef&amp;dn=Brunelleschi%27s+Dome%3A+How+a+Renaissance+Genius+Reinvented+Archite&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":114,"time":1345831169,"description":"You'd think it was scarcely possible to write yet another book on Renaissance Florence, and yet produce something fresh, original and illuminating. But Ross King has done exactly this - and what's more he's chosen as his subject one of the most familiar, most studied - and most visited - buildings in Europe, Florence cathedral. Every guidebook says that Brunelleschi designed the dome, or cupola, of the cathedral, and that it's the biggest masonry dome ever built. But to learn how it was built, you normally have to turn to some pretty specialised works of art history. Ross King has drawn on these. But he goes much further, and brings the Florence of the first half of the fifteenth century, and especially the people engaged in building the great cathedral, tremendously to life. Brunelleschi himself is portrayed as an argumentative and moody man, with no doubts of his own importance. But he also emerges as one of the most imaginative and daring architects and engineers of any era. His dome is shown to be not just an artistic triumph, and one of the defining structures of Western architecture, but also a technical masterpiece, studied by architects to this day. In many ways this book reminds one of Dava Sobel's &quot;Galileo's Daughter&quot;. The style is very different, and Ross King writes of Florence two hundred years before Galileo, but in taking such an original and captivating look at an apparently familiar subject, &quot;Brunelleschi's Dome&quot; stands comparison. Certainly if you enjoyed one, you'll like the other.\n","torrent":{"xt":"urn:btih:4f09644972b1ad97485e6271de01402af31844ef","amp;dn":"Brunelleschi%27s+Dome%3A+How+a+Renaissance+Genius+Reinvented+Archite","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4f09644972b1ad97485e6271de01402af31844ef","infoHashBuffer":{"type":"Buffer","data":[79,9,100,73,114,177,173,151,72,94,98,113,222,1,64,42,243,24,68,239]},"announce":[],"urlList":[]}}