{"title":"HISTORY OF POP AND ROCK MUSIC - part 556","uid":9651909,"size":1285558364,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:4f4544e3f546369ae6a5eb0945a8d7ea13ee530c&amp;dn=HISTORY+OF+POP+AND+ROCK+MUSIC+-+part+556&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"zlatkopupovac","files":-1,"time":1393092242,"description":"                             \n\n                           PART  556\n\n\n\n             &quot;Ram&quot; is a studio album by Paul and Linda McCartney, released on 17 May 1971 by Apple Records. It is the only album credited to the pair. The album was recorded amid Paul McCartney's legal action in Britain's High Court to dissolve the Beatles' partnership, following their break-up the year before. Ram was the second of two albums that he released between quitting the Beatles and forming his own band Wings. \n\n            He and his wife Linda recorded the album with guitarists David Spinozza and Hugh McCracken and future Wings drummer Denny Seiwell. Although it was a collaborative project, Linda's vocal duties were mostly limited to singing harmonies and backing Paul, who sang almost all of the lead parts; however, Linda sang co-lead vocals upon &quot;Long Haired Lady&quot;. The New York Philharmonic was brought in by McCartney to play on &quot;Uncle Albert/Admiral Halsey&quot;, &quot;Long Haired Lady&quot;, &quot;The Back Seat of My Car&quot; and &quot;Another Day&quot;. Paul and Linda's daughter, Heather, sang backing vocals on &quot;Monkberry Moon Delight&quot;.\n\n           The album was a Number 1 in the UK and the Dutch and Canadian charts. Upon its release, the album was received negatively by music critics, although critical opinion has become more favourable in subsequent decades. Three singles were released from Ram: the US number 1 hit &quot;Uncle Albert/Admiral Halsey&quot;, the minor British hit &quot;The Back Seat of My Car&quot;, and &quot;Eat at Home&quot;, which appeared in Europe, Japan and Australia. The album was reissued in May 2012.\n            Music videos were made for &quot;3 Legs&quot; and &quot;Heart of the Country&quot;, from footage that was filmed on 2 January 1971, and edited together 5 months later, by Ray Benson.  \n\n\n\n\n       PAUL McCARTNEY  -  Monkberry Moon Delight  (1971)\n       PAUL McCARTNEY  -  Uncle Albert ( Admiral Halsey) (1971)\n       PAUL McCARTNEY  -  Heart Of The Country  (1971)\n       PAUL McCARTNEY  -  Three legs  (1971)\n       PAUL McCARTNEY  -  Eat At Home (1971)\n       PAUL McCARTNEY  -  Hey Diddle  (1971)\n       PAUL McCARTNEY  -  Michael (1973)  \n\n                \n\n                 &quot;Eat at Home&quot; is a 1971 single by Paul and Linda McCartney that appeared on their album Ram from the same year. The song, a standard rock number, features McCartney on lead vocals, electric guitar, bass and drums and Linda McCartney performing backing vocals . The single was not released in the UK or the US. It was released in several European countries and reached #7 in the Netherlands and #8 in Norway. Music critic Stewart Mason of Allmusic described it as McCartney's homage to Buddy Holly, and Stephen Thomas Erlewine, also of Allmusic, described it as a &quot;a rollicking, winking sex song.&quot;  Although John Lennon was highly critical of many of the songs on Ram, feeling they were veiled attacks on him, he publicly admitted that he enjoyed this particular song quite a bit.\n               &quot;Uncle Albert/Admiral Halsey&quot; is a song by Paul and Linda from the album Ram. Released in the United States as a single on 2 August 1971, it reached number one on the Billboard Hot 100 on 4 September 1971, making it the first of a string of post-Beatles, McCartney-penned singles to top the US pop chart during the 1970s and 1980s.  \nPaul McCartney won the Grammy Award for Best Arrangement Accompanying Vocalists in 1971 for the song. The single was certified Gold by the Recording Industry Association of America for sales of over one million copies. \nAccording to Allmusic critic Stewart Mason, fans of Paul McCartney's music are divided in their opinions of this song. Although some fans praise it as &quot;one of his most playful and inventive songs&quot; others criticize it for being &quot;exactly the kind of cute self-indulgence that they find so annoying about his post-Beatles career.&quot; Mason himself considers it &quot;churlish&quot; to be annoyed by the song, given that song isn't intended to be completely serious, and praises the &quot;Hands across the water&quot; section as being &quot;lovably giddy.&quot;\n\n\n\n\n\n\n\n\n\n","torrent":{"xt":"urn:btih:4f4544e3f546369ae6a5eb0945a8d7ea13ee530c","amp;dn":"HISTORY+OF+POP+AND+ROCK+MUSIC+-+part+556","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4f4544e3f546369ae6a5eb0945a8d7ea13ee530c","infoHashBuffer":{"type":"Buffer","data":[79,69,68,227,245,70,54,154,230,165,235,9,69,168,215,234,19,238,83,12]},"announce":[],"urlList":[]}}