{"title":"Wired Love by Ella Cheever Thayer - Pulsate","uid":8746176,"size":147848,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:500e5dcbee46652ddaa2432c4d5902a56f9abc84&amp;dn=Wired+Love+by+Ella+Cheever+Thayer+-+Pulsate&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"kPulsate","files":2,"time":1374883900,"description":"This book published in 1879 mulls what how authentic a romance can be that is mediated over the wire by two telegraph operators.\n\nAn excerpt from the book:But a very significant noise to Miss Nathalie Rogers, or Nattie, as shewas usually abbreviated; a noise that caused her to lay aside her book,and jump up hastily, exclaiming, with a gesture of impatience:--&quot;Somebody always 'calls' me in the middle of every entertainingchapter!&quot;For that noise, that little clatter, like, and yet too irregular to bethe ticking of a clock, expressed to Nattie these four mystic letters:--&quot;B m--X n;&quot;which same four mystic letters, interpreted, meant that thename, or, to use the technical word, &quot;call,&quot; of the telegraph officeover which she was present sole presiding genius, was &quot;B m,&quot; and that &quot;Bm&quot; was wanted by another office on the wire, designated as &quot;X n.&quot;A little, out-of-the-way, country office, some fifty miles down theline, was &quot;X n,&quot; and, as Nattie signaled in reply to the &quot;call&quot; herreadiness to receive any communications therefrom, she was conscious ofholding in some slight contempt the possible abilities of the humanportion of its machinery.For who but an operator very green in the profession would stay _there_?Consequently, she was quite unprepared for the velocity with which thetelegraph alphabet of sounds in dots and dashes rattled over theinstrument, appropriately termed a &quot;sounder,&quot; upon which messages arereceived, and found herself wholly unable to write down the words asfast as they came.","torrent":{"xt":"urn:btih:500e5dcbee46652ddaa2432c4d5902a56f9abc84","amp;dn":"Wired+Love+by+Ella+Cheever+Thayer+-+Pulsate","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"500e5dcbee46652ddaa2432c4d5902a56f9abc84","infoHashBuffer":{"type":"Buffer","data":[80,14,93,203,238,70,101,45,218,162,67,44,77,89,2,165,111,154,188,132]},"announce":[],"urlList":[]}}