{"title":"L.I.E. 2001 NTSC","uid":4657092,"size":4679981538,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:51917e628255b21f1857a5f4be777848bf1e2749&amp;dn=L.I.E.+2001+NTSC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"joeyjammer69","files":-1,"time":1232238854,"description":"UPDATE Nov 20 2010  Add these tracker urls if you are having problems especially if you are not using DHT (the stats here are not good usually there are more seeders &amp; peers than shown. &lt;a href=&quot;\nhttp://tracker.publicbt.com/announce&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://tracker.publicbt.com/announce&lt;/a&gt;\nudp://tracker.publicbt.com:80/announce\n\nthepiratebay trackers no longer works, the http-openbitorrent doesn't work and the udp-openbitorrent is flaky \n\nL.I.E. (2001)  Custom DVD Cover - bayimg\n\nPlot summary\nFifteen-year-old Howie loses just about everything and everyone in the space of a single week, but ends up finding himself in the process. His mother has just died. His father, a building contractor, can barely keep tabs on his young girlfriend, let alone his own son. Thusly, the teen must navigate his adolescence virtually unsupervised. Floating towards an ill-behaved existence, Howie and his crowd begin robbing houses in the middle-class neighborhoods off the Long Island Expressway. Together, he and his best friend Gary break into a place belonging to an old guy named Big John, a local man who is a respected pillar of the community. When Big John fingers Gary for the crime, Howie learns that his pal has been leading a secret, dangerous but also alluring double life. Subsequently, we also discover that Big John has secrets of his own. Written by Sujit R. Varma\n\nFULL DVD\nRuntime: 97 min\nNTSC COLOR 29.970 fps\nDisplay aspect ratio :  2.35\nDolby Digital English, NO Subtitles\nmenus include, Theatrical Trailer, Scene Selection, 2 Audio Commentaries (director Michael Cuesta, Actor Brian Cox), Deleted Scenes, Other trailers\n\nMemorable quotes\nHowie: On the Long Island Expressway there are lanes going east, lanes going west, and lanes going straight to hell.\n\nBig John: And if I was a spy, what would you think of me then ?\nHowie: Well, I'd think that you are just like James Bond except James Bond doesn't go around blowing boys.\n\nGary: I don't like that kid. He smiles too much.\n\nBig John Harrigan: [on women] They're professional ball busters, and you know it.\nBig John Harrigan: [Talking with Howie about Gary] You must be the only guy on Long Island who hasn't fucked him. Such a slut. The only thing that hasn't been used on him is his brain.\n\nBrilliant and daring, 22 June 2002\n9/10\nAuthor: zetes from Saint Paul, MN\n\nUser review\n\nIt's shocking that this film was ever made. You don't often get characters this well written in American independent cinema, and you certainly don't get characters who are pedophiles portrayed with this much thought behind them. Todd Solondz's Happiness can only be partially counted, as that pedophilic character was played half as comedy (very daring in its way, as well). Brian Cox gives the performance of a lifetime with this character - you won't entirely understand how perfect he is or how perfectly written he is until you see it. Any expectation you can come up with will be quashed when you see the film.\n\nBut, aside from that, this film is about young Howie, also played brilliantly by newcomer Paul Franklin Dano. This is one of the best films about the status of high school students today. No, not all kids are like this, but these characters represent an important segment in the school population. This could have easily been one of those my-dad-is-too-busy-to-pay-attention-to-me-so-I'm-going-to-act-out movies, and, indeed, it is in a way, but the characters and situations are so well written - and the film's technique is amazing, as well - that they're entirely believable.\n\nI praise the hell out of Michael Cuesta for making this film. He's an absolute daredevil. Almost every piece of the film is like a highwire act, and he only stumbles at the very end. It's just too abrupt and simplistic, as if some producer thought that these characters shouldn't be able to live their lives. I hope Cuesta will make more films in the future. He's one of the best to pop up in the last few years.\n\n\nMake sure you are using this tracker\n it shows 3 seeders and 3 leechers on July 2,  2010  \n\nOpenbitoreent only shows 0 seeders and 1 leecher","torrent":{"xt":"urn:btih:51917e628255b21f1857a5f4be777848bf1e2749","amp;dn":"L.I.E.+2001+NTSC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"51917e628255b21f1857a5f4be777848bf1e2749","infoHashBuffer":{"type":"Buffer","data":[81,145,126,98,130,85,178,31,24,87,165,244,190,119,120,72,191,30,39,73]},"announce":[],"urlList":[]}}