{"title":"Galactic Guardians 01-04 (1994)","uid":9874632,"size":55680264,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:51c00266a9a0f260d6ee7b993ced1ec99a1463d0&amp;dn=Galactic+Guardians+01-04+%281994%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ringmancz","files":4,"time":1396462222,"description":"version from newcomic.org, complete your Guardians of the Galaxy collection\n\n\nThe Galactic Guardians is the big dream of Martinex, a member and former leader of the Guardians of the Galaxy. He believed that the organization should be even bigger and far more powerful if they were to truly guard the entire galaxy. After the Guardians under leadership of Major Victory decided to stay on Earth, Martinex parted ways with them to form his new team. This brought him to Main Frame's World, home of Main Frame - the Avenger formerly known as Vision.\n\nWhen Main Frame was infected with a computer virus, Martinex summoned and was greeted by several old allies to help with the situation:\n\n    Wileaydus Autolycus, able to generate Kauri (Hell) fire and transform into the skull-headed, Death-Cycle riding Spirit of Vengeance, temporarily put aside his never-ending battle against the oppressive Universal Church of Truth\n    Firelord, former Herald of Galactus and now Eon's chosen Protector of the Universe, lent his cosmic flame to the cause\n    Replica, the Skrull shape-shifter and former member of the Guardians of the Galaxy, abandoned her new position as companion to Protege head of the Universal Church of Truth\n    Hollywood , formerly the hero Wonder Man, who blamed himself for the deaths of many of his fellow heroes during the early 21st Century Martian invasion of Earth.\n\nThe heroes tracked the power drain that allowed Main Frame to become infected to the criminal group Minions of Menance (now known as the Intimidators), who succeeded in resurrecting their old master, Korvac. Racing to stop Korvac before Main Frame was completely absorbed, the Guardians triumphed through the intervention of their final recruit Phoenix IX, the newest host of the Phoenix Force and possessed of vast psionic powers, who transported Korvac to another reality.","torrent":{"xt":"urn:btih:51c00266a9a0f260d6ee7b993ced1ec99a1463d0","amp;dn":"Galactic+Guardians+01-04+%281994%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"51c00266a9a0f260d6ee7b993ced1ec99a1463d0","infoHashBuffer":{"type":"Buffer","data":[81,192,2,102,169,160,242,96,214,238,123,153,60,237,30,201,154,20,99,208]},"announce":[],"urlList":[]}}