{"title":"Bound by Fate (The Fate Trilogy Book One - Gray, Sherilyn.epub","uid":8981445,"size":195396,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5248c07b1fe46a46107ccf5f393c1743b10f2f38&amp;dn=Bound+by+Fate+%28The+Fate+Trilogy+Book+One+-+Gray%2C+Sherilyn.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"420weedman","files":1,"time":1380576655,"description":"She is a woman without a name and without a past. Two years ago, she woke up on the streets of San Francisco, alone, lost, and without her memories. Her life has been a constant struggle for survival. When she is offered an opportunity for a new life in the household of the wealthy and scorchingly hot Victor Draper, she accepts it without hesitation. Nothing can be worse than living on the streets. She is given food, a warm place to sleep, and even a name: Dove.\n\nIn her new life, Dove must clean, cook, and... surrender herself to Victor's every desire. Dove finds the entire situation strange, but giving her body to most eligible bachelor in the world can hardly be considered a sacrifice.\n\nUnlike Dove, Victor is a man who tried to bury his past in the deepest hole that money could buy. When Dove's contract with Victor becomes more... complicated, his demons resurface to threaten their budding relationship.\n\nWill their passion for each other be able to overcome Victor's past? And even if they do, an even greater question awaits: what will they do when Dove begins to recover her memories?\n\nGenre: Erotic Romance","torrent":{"xt":"urn:btih:5248c07b1fe46a46107ccf5f393c1743b10f2f38","amp;dn":"Bound+by+Fate+%28The+Fate+Trilogy+Book+One+-+Gray%2C+Sherilyn.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5248c07b1fe46a46107ccf5f393c1743b10f2f38","infoHashBuffer":{"type":"Buffer","data":[82,72,192,123,31,228,106,70,16,124,207,95,57,60,23,67,177,15,47,56]},"announce":[],"urlList":[]}}