{"title":"FireStarter","uid":7442886,"size":713484512,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:52d0671c268feb1572e161e68642c08f009dd7a9&amp;dn=FireStarter&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"esharoth","files":-1,"time":1342277381,"description":"Title: FireStarter\nGenre: FPS / action / sci-fi\nReleased: 28th November 2003\nDeveloper: GSC Game World\nPublisher: Hip Interactive\nDescription:\nIn the year 2010 video games have evolved from consoles to virtual reality playing machines. The only problem is computer viruses still exist and can wreak havoc on your mind. This is the premise of FireStarter, a first person shooter named after the virtual reality machine. The virus infected game has trapped your consciousness and you must complete your virtual reality game within 48 virtual hours to free yourself. \n\nYou can choose from six different characters to play as with some being an Agent - a female with excellent acrobatic skills, a Gunslinger - a male with good reaction and great accuracy, a Cyborg - a heavily armored player with the skill to restore his armor and a Mutant - a four armed humanoid with the ability to fire with all four arms. Each character can improve his/her skills (27 total) by gaining experience points on completion of objectives in missions. Skills range from learning - increased experience points to vampire - conversion of monster damage to player health. A unique skill is vandalism in which the player receives extra experience points for brutally killing a monster or desecrating dead bodies.\n\nGameplay consists of 16 levels broken down into several episodes with each episode objective being different as in killing a certain amount of enemies or surviving for a limited time before the door to the next episode opens. There are 19 different types of weapons from your typical assault rifle to the mighty mortar firing 7 types of shells in which to slay the 20 different enemies from demons to symbiont's. In each episode you must (or game over) find and pick up artifacts within a certain amount of time. Artifacts range from invisibility to terminator where the monster targeted by this artifact will become the #1 enemy and all other enemies will attack it until death. \n\nChoose from single player campaign (from one level to the next) or instant game where you can select a single map to play with your character from the campaign mode. Multiplayer modes include classic deathmatch and cooperative play to hunting - several players on one map with one monster to kill, first one to kill it wins and slaughter - players fight non-aggressive re-spawning stealth mimer's to see who can kill the most.\n\nHow to play:\n1) Download the torrent files;\n2) Mount or burn disc image;\n3) Run Install.exe to install the game (it will start automatically if you have autorun enabled);\n4) After installation is complete, run FireStarter.reg to remove the CD check;\n5) Play the games without the disc.\n\n! Notice\nTested and working fine on Windows 7 x64.","torrent":{"xt":"urn:btih:52d0671c268feb1572e161e68642c08f009dd7a9","amp;dn":"FireStarter","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"52d0671c268feb1572e161e68642c08f009dd7a9","infoHashBuffer":{"type":"Buffer","data":[82,208,103,28,38,143,235,21,114,225,97,230,134,66,192,143,0,157,215,169]},"announce":[],"urlList":[]}}