{"title":"AIDA64 3.20.2600 (KiwiPirate)","uid":8927427,"size":16293027,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:52f583f52fb65d24e7a8b99a951b40b8d1acf132&amp;dn=AIDA64+3.20.2600+%28KiwiPirate%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"KiwiPirate","files":-1,"time":1379389865,"description":"CPU, memory and disk benchmarks\n\nAIDA64 implements a set of 64-bit benchmarks to measure how fast the computer performs various data processing tasks and mathematical calculations. Memory and cache benchmarks are available to analyze system RAM bandwidth and latency. Processor benchmarks utilize MMX, SSE, XOP, FMA, AVX and AVX2 instructions, and scale up to 32 processor threads. For legacy processors all benchmarks are available in 32-bit version as well. AIDA64 Disk Benchmark determines the data transfer speed of hard disk drives, solid-state drives, optical drives, and flash memory based devices. Learn more...\nSystem stress testing\n\nAIDA64 System Stability Test uses a 64-bit multi-threaded stress testing module to drive the computer to its absolute limits. Temperature and voltage readings can be monitored while the stress test reveals any potential stability and reliability issues. Hard disk, SSD and OpenCL GPGPU video adapter stress testing is also available.\nTemperature, voltage and cooling fan monitoring\n\nAIDA64 supports over 250 various sensor devices to measure temperatures, voltages, fan speeds, and power draw. Measured values can be displayed on System Tray icons, OSD panel, Sidebar Gadget, and Logitech G15/G19 Gaming Keyboard LCD. The values can also be logged to file or exported to external applications such as RivaTuner or Samurai. AIDA64 can also alarm the user when it detects overheating, over-voltage, or cooling fan failure.\nHardware diagnostics\n\nAIDA64 has the most accurate hardware detection capabilities in its class, to provide detailed information on the computer internals without the need to open it up. The hardware detection module is strengthened by an exhaustive hardware database holding over 160,000 entries. Additional modules are available to overview processor frequencies, check CRT and LCD display status, and stress the system to reveal potential hardware failures and thermal issues.\nSoftware and operating system analysis\n\n\nExtract &quot;AIDA64 3.20.2600.rar&quot; to your &quot;C:\\Program Files&quot; folder\nRun \\AIDA64\\aida64.exe\n\nuse AIDA64 Keygen.exe to get a cerial\n\nEnjoy\n\n//KiwiPirate","torrent":{"xt":"urn:btih:52f583f52fb65d24e7a8b99a951b40b8d1acf132","amp;dn":"AIDA64+3.20.2600+%28KiwiPirate%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"52f583f52fb65d24e7a8b99a951b40b8d1acf132","infoHashBuffer":{"type":"Buffer","data":[82,245,131,245,47,182,93,36,231,168,185,154,149,27,64,184,209,172,241,50]},"announce":[],"urlList":[]}}