{"title":"Ali Mc Namara - Colazione da Darcy [Pdf - Ita]","uid":12772288,"size":1640888,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:538f582bd141fda888266523d6fa1e8616d6f27d&amp;dn=Ali+Mc+Namara+-+Colazione+da+Darcy+%5BPdf+-+Ita%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"vitolanz","files":1,"time":1447695197,"description":"Ali Mc Namara - Colazione da Darcy [Pdf - Ita][TNTVillage]\r\n-----------------------------------------------------------------------------------\r\n.: Dettagli :.\r\n\r\nAutore: Ali McNamara \r\nTitolo: Colazione da Darcy\r\nAnno: 2012\r\nLingua: Italiana\r\nTraduttore Francescon M.\r\nGenere: Contemporanea e per adulti\r\nDimensione del file: 1,56 MB\r\nFormato del file: PDF \r\n-----------------------------------------------------------------------------------\r\n\r\n.: Trama :.\r\n\r\nQuando Darcy McCall perde l’adorata zia Molly, l’ultima cosa che si aspetta è di ricevere in eredità un’isoletta in mezzo al mare. Secondo le ultime volontà della donna, però, per entrarne in possesso, Darcy dovrà trascorrere almeno dodici mesi sull’isola di Tara, al largo delle coste occidentali dell’Irlanda. Una bella sfida, non c’è che dire, per una come lei, abituata alla frenetica vita londinese. Ma forse un cambiamento è proprio ciò di cui Darcy ha bisogno, così, senza quasi rendersene conto, da un giorno all’altro si ritrova a dover dire addio alle amate scarpe con il tacco per indossare un paio di orribili stivali. Adattarsi alla spartana vita dell’isola sarà un’impresa tutt’altro che facile, ma nel ristorantino appena aperto, tra una tazza di tè e i biscotti fatti in casa, Darcy scoprirà che l’isola ha molto da offrire… E dopo le difficoltà iniziali, il calore e l’affetto della piccola comunità di Tara finiranno per conquistare anche la mondana Darcy. Nuovi amici e forse un nuovo amore l’attendono dietro l’angolo: chi, tra l’affascinante Conor e il testardo Dermot, saprà far battere il suo cuore?\r\n-----------------------------------------------------------------------------------\r\n\r\n.: Biografia dell'autore :.\r\n\r\nAli McNamara ha iniziato a scrivere per gioco postando alcuni pensieri sul sito di Ronan Keating, ex membro della band Boyzone, finché le sue considerazioni non si sono trasformate in una storia vera e propria, che ha attirato migliaia di contatti giornalieri sulla pagina del cantante. Quando si è accorta di questo straordinario successo, Ali ha messo la sua scrittura a disposizione dell’associazione benefica di Keating, vendendo le sue storie all’asta per poi devolvere il ricavato alla lotta contro il cancro.\r\nDopo questo strano inizio, ha deciso di scrivere il suo romanzo d’esordio From Notting Hill with Love… Actually, che è stato un grande bestseller in Gran Bretagna e sarà presto pubblicato in Italia dalla Newton Compton. \r\nPer maggiori informazioni, visitate il suo sito www.alimcnamara.co.uk o seguitela su twitter: @AliMcNamara","torrent":{"xt":"urn:btih:538f582bd141fda888266523d6fa1e8616d6f27d","amp;dn":"Ali+Mc+Namara+-+Colazione+da+Darcy+%5BPdf+-+Ita%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"538f582bd141fda888266523d6fa1e8616d6f27d","infoHashBuffer":{"type":"Buffer","data":[83,143,88,43,209,65,253,168,136,38,101,35,214,250,30,134,22,214,242,125]},"announce":[],"urlList":[]}}