{"title":"The.Ascent.of.Woman.s01e03.EN.SUB.WEBRIP.[MPup]","uid":12440512,"size":1060312535,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:5497478ef0a98d00971202b75e39111485651cbe&amp;dn=The.Ascent.of.Woman.s01e03.EN.SUB.WEBRIP.%5BMPup%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"makinapufterpup","files":2,"time":1442574233,"description":"The.Ascent.of.Woman.s01e03.EN.SUB.WEBRIP.[MPup]\nPower\n\nFormat: MPEG-4\nSize: 1280x720\nDisplayAspectRatio: 16:9\nFrameRate: 25.000 fps\nAudioCodec: AAC\nChannels: 2 channels\nSamplingRate: 48.0 KHz\n\n[b]3 of 4[/b]\n\nDr Amanda Foreman explores the role of women in early civilisations. Amanda looks at the stories of women behind some of the most powerful empires of the Middle Ages.\n\n[img]http://extraimago.com/images/2015/09/18/e88bb22a20bea4dc3088ba4e858c0e59.jpg[/img]\n\nDr Amanda Foreman travels to Istanbul, Germany, Paris and Delhi to explore the stories of women behind some of the most powerful empires of the Middle Ages. From 6th-century Byzantium to Medieval Europe, the Ottoman Court to the Mughal Empire, Amanda looks behind the male-dominated perceptions of these empires to reveal the strength of women at the heart of power and influence.\n\nThis is the story of the few exceptional women who defied the entrenched male intellectual movements and religions of the period by creating their own worlds from which a female perspective could thrive. Women who operated from within the systems of religion, law, marriage and education to create their own routes to power - from Empress Theodora, who transformed herself from street performer and prostitute to empress and co-ruler of the Eastern Orthodox Church, to 12th century German writer, preacher and visionary Hildegard of Bingen. From Christine de Pizan, the first woman to write in defence of women's rights to Roxelana, a former slave who changed the structure of sexual dynastic politics in the Ottoman Court and the Mughal Empress Nur Jahan, who helped establish trade routes and pioneered the visual aesthetic of India we know today.\n\nThese women resisted and rebelled from within the confines of the palace, the convent and the harem. They demanded to be heard, fought to be respected and insisted on having their own authority. And in doing so, they helped to shape our world","torrent":{"xt":"urn:btih:5497478ef0a98d00971202b75e39111485651cbe","amp;dn":"The.Ascent.of.Woman.s01e03.EN.SUB.WEBRIP.%5BMPup%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5497478ef0a98d00971202b75e39111485651cbe","infoHashBuffer":{"type":"Buffer","data":[84,151,71,142,240,169,141,0,151,18,2,183,94,57,17,20,133,101,28,190]},"announce":[],"urlList":[]}}