{"title":"Worthy Brown's Daughter - Phillip Margolin.epub","uid":9567425,"size":414266,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:558f8335d43a26742a67de3124eaf88527c6b1e5&amp;dn=Worthy+Brown%27s+Daughter+-+Phillip+Margolin.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Mohammad_AT","files":1,"time":1391547480,"description":"Known for his critically acclaimed contemporary thrillers, New York Times bestselling author Phillip Margolin explores intriguing new territory in Worthy Brown's Daughter, a compelling historical drama, set in nineteenth-century Oregon, that combines a heartbreaking story of slavery and murder with classic Margolin plot twists.\n\nOne of a handful of lawyers in the new state of Oregon, recently widowed Matthew Penny agrees to help Worthy Brown, a newly freed slave, rescue his fifteen year old daughter, Roxanne, from their former master, a powerful Portland lawyer. Worthy's lawsuit sets in motion events that lead to Worthy's arrest for murder and create an agonizing moral dilemma that could send either Worthy or Matthew to the hangman.\n\nAt the same time, hanging judge Jed Tyler, a powerful politician with a barren personal life, becomes infatuated with a beautiful gold-digger who is scheming to murder Benjamin Gillette, Oregon's wealthiest businessman. When Gillette appears to die from natural causes, Sharon Hill produces a forged contract of marriage and Tyler must decide if he will sacrifice his reputation to defend that of the woman who inspired his irrational obsession.\n\nAt Worthy's trial, Matthew saves Worthy by producing a stunning courtroom surprise and his attempt to stop the deadly fortune hunter ends in a violent climax.","torrent":{"xt":"urn:btih:558f8335d43a26742a67de3124eaf88527c6b1e5","amp;dn":"Worthy+Brown%27s+Daughter+-+Phillip+Margolin.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"558f8335d43a26742a67de3124eaf88527c6b1e5","infoHashBuffer":{"type":"Buffer","data":[85,143,131,53,212,58,38,116,42,103,222,49,36,234,248,133,39,198,177,229]},"announce":[],"urlList":[]}}