{"title":"Glee - S01E13 - Sectionals [Np]","uid":5938880,"size":367151886,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:55cd3e4b2d8ed1336b652f96910c4bb005a09508&amp;dn=Glee+-+S01E13+-+Sectionals+%5BNp%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"NoahPuckerman","files":1,"time":1289065270,"description":"Name: Glee\nSeason: 1\nEpisode: 13\nEpisode Name: Sectionals\nOriginal Air Date on TV: December 9, 2009\n\n\nEpisode Plot\n(Via: Wikipedia)\n\nAs a result of a technicality in the show choir competition rules, glee club director Will Schuester is not allowed to accompany New Directions to sectionals. Guidance counsellor Emma Pillsbury postpones her own wedding by several hours so that she can take the club in his place, although her fiancÃƒÂ©, football coach Ken Tanaka, feels she is choosing Will over him.\n\nThe glee club learns that Puck (Mark Salling), not Finn, is the father of Quinn's baby. They decide not to tell Rachel (Lea Michele), believing that she will tell Finn, but she deduces it anyway and tells him. When coming up with their set list, Mercedes sings &quot;And I Am Telling You I'm Not Going&quot; after Rachel acts like her usual bossy self, saying she would sing the ballad at Sectionals. After Mercedes' performance, Rachel agrees that Mercedes deserves to sing the solo and the two hug. Angered by Quinn's and Puck's betrayal, Finn leaves the club on the eve of sectionals, and has to be replaced by school reporter Jacob Ben Israel (Josh Sussman). New Directions arrive at the event to discover their competitors have received an advance copy of their set list, and are performing the songs they had chosen. Emma calls Will, who talks with Finn and convinces him to rejoin New Directions. The club scrambles together a new set list. Emma then confronts rival choir directors Grace Hitchens (Eve) and Dalton Rumba (Michael Hitchcock), while New Directions are forced to choose new performance pieces at the last minute, aided by the return of Finn. Rachel is chosen to sing the ballad and gives a solo performance of &quot;Don't Rain On My Parade&quot;, receiving a standing ovation after finishing. The group then performs &quot;You Can't Always Get What You Want&quot; by the Rolling Stones, to the applause and cheers of the audience. After their performance, Grace attempts to confess her duplicity to the judges, but they have already unanimously decided that New Directions has won the competition.\n\nHaving previously discovered that his wife Terri was faking her pregnancy, Will tells her he no longer feels the same way he did when they first fell in love. He later attends Ken and Emma's delayed wedding to find that Ken has ended the relationship as a result of Emma's feelings for Will. She announces her intention to leave McKinley High School, explaining that it will be too painful for her to carry on working with Will and Ken. Back at school, Principal Figgins (Iqbal Theba) suspends cheerleading coach Sue Sylvester (Jane Lynch) for leaking the glee club's set-list, and has Will reinstated as New Directions' director. The glee club members show Will their trophy and perform &quot;My Life Would Suck Without You&quot; for him. As Emma prepares to leave the school, Will chases after her and stops her with a kiss. Both are happy, but uncertain of what will happen next.\n\nI Will Be Uploading All Glee Episodes As Single Files Then All Together (:\nI Will Also Be Uploading All Albums To Each Season (:\n\nEnjoy (: &amp; Please Seed \n\nThanks\n\n- [Np]\n","torrent":{"xt":"urn:btih:55cd3e4b2d8ed1336b652f96910c4bb005a09508","amp;dn":"Glee+-+S01E13+-+Sectionals+%5BNp%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"55cd3e4b2d8ed1336b652f96910c4bb005a09508","infoHashBuffer":{"type":"Buffer","data":[85,205,62,75,45,142,209,51,107,101,47,150,145,12,75,176,5,160,149,8]},"announce":[],"urlList":[]}}