{"title":"Superchick - 2001 - Karaoke Superstars","uid":4874695,"size":46363641,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:56d39efca2da3caa208e9efb1e13d64d9d7610ae&amp;dn=Superchick+-+2001+-+Karaoke+Superstars&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"TorrentTracts","files":14,"time":1241062590,"description":"Superchick - 2001 - Karaoke Superstars\n\n\nTRACK LISTING:\n\n01 - Barlow Girls\n02 - Big Star Machine\n03 - Karaoke Superstars\n04 - Get Up\n05 - Not Done Yet\n06 - Super Trouper\n07 - TV Land\n08 - Help Me Out God\n09 - One Girl Revolution\n10 - Alright\n11 - Let It Be\n12 - Help Me Out God\n13 - Alright\n14 - One Girl Revolution\n\n\n\nADDITIONAL INFORMATION:\n\nEver wondered what would happen if some of the boys from Church of Rhythm would do after their band split up prematurely in 1997? I can say I have, but I never would have guessed they would have not only helped out with Superchic[k], but now they're members. Well, CoR fans, I guess this definitely seals the band's fate. But this isn't a CoR review. Superchic[k] is a band made up of eight (yes, eight!) members and offers the listener fun and energetic female-fronted pop punk. &quot;Barlow Girls&quot; kicks of the project nicely setting the stage for more tracks of the same kind. \n\nUnfortunately, after multiple listens, what seems to be the element keeping the CD from screaming &quot;play me till I die!&quot; is in fact the vocals. Although stylized and quite possibly just aren't my bag, the vocals often are flat, emotionless and just fall short of being super exciting. The music is often fun, fast, furious, and attractive, but the vocals fail to grab me. While I keep feeling that vocals more like that of the late Dakoda Motor Co. (or even Flight 180) would help the songs better, I just might be missing something. \n\nBut what they do offer is done with quality. The music is well-produced, only occasionally partially overproduced, but it is hard to nail it perfectly with a style like this. When the group closes out the new track listing with &quot;Let It Be,&quot; they leave you with a groovy pop/rock tune which proves the girls really have pretty good voices. It puzzles me why they didn't experiment even more vocally on the record. I found &quot;Let It Be&quot; to be the best song and I felt the disc would have benefited greatly by the inclusion of more tracks like this or at least further experimentation with the girls stronger vocals. \n\nDefinitely not a bad record, but with room for growth, this garage band sure knows how to have fun and make it show through their songs. &quot;Get Up,&quot; &quot;Barlow Girls,&quot; &quot;TV Land,&quot; and other fun tracks will definitely keep your spirits high and your feet moving when you just need some music to groove to. \n\n\n\nTORRENTED BY:\n\nTorrent Tracts, April 2009\n","torrent":{"xt":"urn:btih:56d39efca2da3caa208e9efb1e13d64d9d7610ae","amp;dn":"Superchick+-+2001+-+Karaoke+Superstars","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"56d39efca2da3caa208e9efb1e13d64d9d7610ae","infoHashBuffer":{"type":"Buffer","data":[86,211,158,252,162,218,60,170,32,142,158,251,30,19,214,77,157,118,16,174]},"announce":[],"urlList":[]}}