{"title":"Erotic Short Stories by Tinca Turle (Chaptered Audiobook)","uid":6687425,"size":52887935,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:5778366d1542a620c193e1fa8773e21546f254f7&amp;dn=Erotic+Short+Stories+by+Tinca+Turle+%28Chaptered+Audiobook%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Glitch02","files":-1,"time":1316456974,"description":".\n\nErotic Short Stories by Tinca Turle (Chaptered Audiobook)\nListening Length: 1 hour 50 minutes\nEncoding: MP3, Mono, 64 Kbps\n\nLeatherback presents a selection of short erotic stories, narrated for your pleasure. Each story is approximately 20 minutes long.\n\nClub Erotica\nNick\\'s brother had recommended a club in Soho, saying he and Emma would have never seen anything like it. In order to gain entry, Emma had to gain the secret camera\\'s approval. Once inside, the club was filled with hundreds of beautiful people, with slave men and women serving them. Having been tied and whipped, Emma was brought to Nick for a public screwing she would not easily forget.\n\nHotel Room\nHaving been caught on the beach, they ran inside the nearest bar where they met a beautiful couple who liked to do more than share stories. Tied to the chair in the middle of the hotel room, she enjoyed all three of them. Ending on the bed for group sex, both girls were given a wild time.\n\nBirthday Surprise\nFor her birthday he promised her a day she wouldn\\'t forget. With a champagne dinner, dancing, and a hot bath, she thought he\\'d given her everything. However, there was one more present that she was to receive. Blindfolded, he introduced her to a whole new sexual experience!\n\nThe French Teacher\nStarting a new term can be a depressing time for any school boy, but things start to look up for Olli and Mick as they catch a glimpse of their new French teacher. Finding her in an embarrassing situation, they are taken on an erotic ride with this French vixen. Sex in the classroom, corridors, and school grounds ensures that this term will be one they never forget.\n\nThe Kimono\nNicky, and her husband Simon, had spoken on many occasions about each other\\'s fantasies. Most of them involved just the two of them, but there were a few which were a little more adventurous. They booked themselves into a hotel room and sent Simon out to find two girls to join them. They set to work fulfilling his fantasy of seeing his wife being pleasured by these women.\n\nÃ‚Â© &amp; (P)2005 Leatherback Productions, Ltd.\n\n.","torrent":{"xt":"urn:btih:5778366d1542a620c193e1fa8773e21546f254f7","amp;dn":"Erotic+Short+Stories+by+Tinca+Turle+%28Chaptered+Audiobook%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5778366d1542a620c193e1fa8773e21546f254f7","infoHashBuffer":{"type":"Buffer","data":[87,120,54,109,21,66,166,32,193,147,225,250,135,115,226,21,70,242,84,247]},"announce":[],"urlList":[]}}