{"title":"DVD Rebuilder Pro V1.26 &amp; CCE SP V2.70 + Cracks, Extras [PC]","uid":5841861,"size":48944255,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:5a972290023458fb30861fd2819139944d77e9ff&amp;dn=DVD+Rebuilder+Pro+V1.26+%26+CCE+SP+V2.70+%2B+Cracks%2C+Extras+%5BPC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Big_dude","files":1,"time":1284993495,"description":"DVD Rebuilder Pro V1.26 &amp; CCE SP V2.70 for PC\n\n\nPlatform: PC, Windows\n\n\nCompressed with 7Zip tested &amp; working.\n\n(Tested on XP, I don't know if it will work for Vista or Windows 7. If\nusing Vista or Windows 7 you may need run as admin or use XP compatibility)\n\n\nFirst of all this is an older version of DVD RB PRO but it works with the patch.\n\n\nThe newer version is out with the crack but it didn't work for me\nthis still works good and will get the job done.\n\n\n\nExtras included: DVD Decrypter v3.5.4.0, ImgBurn V2.5.2.0, AnyDVDHD V6.6.8.3 + \n                 Crack, AVISynth V2.58, Cinema Craft Encoder SP 2.70.02.12 + \n                 Crack, Daemon Tools Lite V4.35.6.91.\n                 \n\n\nInstall Info:\n\n\n1.  Install CCE SP first and apply the cracks. Open up CCE SP click Template\n    and select either NTSC DVD or PAL DVD, (NTSC is America &amp; Canada standard,\n    PAL is for UK or Australia). The DVD Movie should say NTSC or PAL, you'll \n    know if its the wrong one if the screen keeps rolling. Select Options, misc...\n    and make sure After Encoding shutdown is clicked. \n\n\n2.  Install AVISynth 2.58 by running Avisynth_258.exe or Install built-in version \n    from the DVD RB PRO setup (The installer dvd rb sets up avisynth an older \n    version but still works with it). If DVD RB PRO isn't working with AviSynth \n    2.58 version uninstall dvdrbpro and avisynth completely and just use the \n    avisynth version from dvdrbpro installer instead along with reinstalling \n    dvdrbpro.\n\n\n3.  Install DVD-Decrypter and/or AnyDVD with ImgBurn if you don't have them   \n    already. This is for ripping your retail/protected DVD9 or DVD movies to a \n    usable ISO. (If AnyDVD is outdated, use the most recent version with crack)\n\n\n4.  If you don't have a virtual DVD/CD drive on your computer, Install Daemon    \n    Tools Lite. After install open daemon and make sure all the emulation is \n    turned off.\n\n\n5.  Install DVD Rebuilder, during the setup when it asks for cce sp location it \n    should be in the default area which is c:\\program files\\custom \n    technology\\Cinema Craft Encoder SP\\ Select version CCE SP 2.70 Retail \n    (No EcICCE).\n\n\n6.  After install of DVD Rebuilder we need to crack it. Run the patch type or copy \n    the system id you get from the dvd rebuilder reg key app (Reg-RB.exe) located\n    in DVD-RB Pro installation directory, to the patch where it says system id  \n    then click crack.\n\n\n7.  Now open up DVD Rebuilder Pro, click mode and make sure CCE is selected as \n    default encoder. Click settings, CCE settings click advanced settings adjust \n    the VBR Passes you want...more is better quality but will take longer, less \n    passes is lesser quality but will be take less time. Some DVD9 movies need to \n    be over 6 passes or even 10 for the best picture but this could take well over \n    10 or more hours.\n\n\n8.  Select Mode, and select output to ISO Image File.\n\n\n9.  Now rip your DVD9 or DVD retail/protected movie with DVD-Decrypter or Open \n    AnyDVD and rip it with ImgBurn. Rip it to an MDS/ISO or ISO Image to your \n    computer.\n\n\n10. Turn off any other programs running, including automated tasks. Don't have   \n    your computer turn off the harddrive, hibernate, or go into sleep mode...just \n    have your monitor turn off after x amount of minutes. Disable any screen \n    savers. This is because you don't want any other processes running while \n    dvdrbpro is working, it could cause interference with the encoding process and \n    screw up the movie.\n\n\n11. Mount the MDS or ISO file to your Virtual DVD/CD drive. Open up DVD Rebuilder \n    and select the source path to your virtual dvd/cd drive you just mounted the \n    image to. Make sure all your settings are correct. Click Rebuild and wait for \n    it to complete and build the ISO. Depending on how many VBR passes you \n    selected this can take a very long time. But its worth it.\n\n   \n\n\nImportant:\n\nTo use your retail dvd9 or dvd movies with DVD RB PRO it first must be ripped to a usable ISO to mount, since the retail dvd movies are encrypted or protected you must rip it with either dvd decrypter or anydvd. (If the movie has other protection that dvd decrypter can't handle consider using Anydvd this is a driver that you use with Imgburn to rip the protected movie. For example it removes the protection while you rip it with other software.)\n\n\nRemember CCE SP is a powerful encoder and the best to use with dvd rebuilder \nit is a professional encoder and is actually used in the industry as well.\n\n\nDVD Rebuilder is best used with CCE SP encoder to convert your dvd9 movies to dvd5 in near perfect quality without any pixlation, depending on the number of VBR Passes above 6 is the best but will take a hours to complete. Most other converters degrade to dvd5 and theres picture pixlation or loss of quality and performance.\n\n\nFor a reference about CCE SP advanced settings open up CCE SP encoder Settings.mht located in this download and read it.\n\n\nIf you get any virus consider it a false positive I am using this with xp\nand firewall/virus software with no problems.\n\n\n\nAny Problems or questions please post a comment.\n\n\nIf this is working fine for you let us know write a comment.\n\n\nPlease Seed this when your done.\n\n(I can't seed 24/7, do your part and seed to keep the torrent healthy).\n\n\n\nEnjoy!","torrent":{"xt":"urn:btih:5a972290023458fb30861fd2819139944d77e9ff","amp;dn":"DVD+Rebuilder+Pro+V1.26+%26+CCE+SP+V2.70+%2B+Cracks%2C+Extras+%5BPC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5a972290023458fb30861fd2819139944d77e9ff","infoHashBuffer":{"type":"Buffer","data":[90,151,34,144,2,52,88,251,48,134,31,210,129,145,57,148,77,119,233,255]},"announce":[],"urlList":[]}}