{"title":"Comedy   Stand Up  Richard Jeni (A Big Steaming Pile of Me)","uid":4495296,"size":404779198,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:5aa00e87dff312a3ea0b45b0223e13fe6a93f3d0&amp;dn=Comedy+++Stand+Up++Richard+Jeni+%28A+Big+Steaming+Pile+of+Me%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Welshguy","files":-1,"time":1226167393,"description":"Richard Jeni 1957 - 2007 \n\n\nRichard Jeni burst onto the national scene in 1990 with his first Showtime Special &quot;Richard Jeni: The Boy From New York City.&quot; The show received three Cable ACE Awards (the awards for cable excellence) nominations. Two years later, he followed up with his second one-hour concert for Showtime, &quot;Richard Jeni: Crazy From The Heat&quot;, which was the highest-rated stand-up special in Showtime's history. During this period, Richard was also becoming a favorite guest on The Tonight Show with Johnny Carson. After a couple of white-hot stand-up appearances on the show, Johnny moved Richard up to the status of &quot;panel guest.&quot; Richard's banter with Johnny got the kind of desk pounding tears of laughter response from the legendary host that made Richard a fixture on the show. When Jay Leno took over, he kept the working formula of Richard Jeni and The Tonight Show going. During Jay's tenure, Richard was on the show more than any other stand-up. \nIn the early 90's, Richard's success on cable and network TV caught the eye of HBO President Chris Albrecht who wooed Richard with an offer for a coveted HBO Comedy Hour, the most prestigious showcase available to today's comedians. The result was &quot;Richard Jeni: Platypus Man&quot;, an unqualified smash that won the Cable ACE Award for &quot;Best Stand-up Comedy Special&quot; and formed the basis for his network sitcom of the same name. \n\n\nThroughout the 90's, awards and accolades continued to pile up and Richard's growing popularity was making him a sold-out attraction in concert venues. A particular thrill was when George Carlin handed Richard the American Comedy Award for &quot;Best Male Stand-up&quot; on ABC TV. He hosted A&amp;E's &quot;Caroline's Comedy Hour&quot; for two years and the show won the Cable ACE Award for &quot;Best Stand-Up Comedy Show.&quot; \nJeni made his feature film debut co-starring as Jim Carrey's best friend in the blockbuster hit, &quot;The Mask.&quot; In 1997, Richard released his long awaited CD entitled &quot;Richard Jeni's Greatest Bits&quot; which is a compilation of his fans favorite material. In 1997/98, Richard returned to HBO for his second comedy hour, &quot;Richard Jeni: A Good Catholic Boy.&quot; In it's premiere outing, the show was the fifth highest rated cable program of the week and a non-stop comedy barrage that Entertainment Tonight said, &quot;left the audience dazzled, breathless, and hungry for more.&quot; With his fourth special, Richard was now firmly established at the top of his profession and had amassed a body of work that could be matched by only a tiny handful of his contemporaries - no small trick for a shy kid from Brookly\n\nVery Funny Man well worth the time to watch sadly no longer with us but his laughs still go on.\n\n\nPlease seed and enjoy","torrent":{"xt":"urn:btih:5aa00e87dff312a3ea0b45b0223e13fe6a93f3d0","amp;dn":"Comedy+++Stand+Up++Richard+Jeni+%28A+Big+Steaming+Pile+of+Me%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5aa00e87dff312a3ea0b45b0223e13fe6a93f3d0","infoHashBuffer":{"type":"Buffer","data":[90,160,14,135,223,243,18,163,234,11,69,176,34,62,19,254,106,147,243,208]},"announce":[],"urlList":[]}}