{"title":"Jerry Garcia Band Piercy Aug 29, 1987 Set 3 FM","uid":7437504,"size":113137458,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:5ae68b6ba069b72a65d383964c5d5062692fd414&amp;dn=Jerry+Garcia+Band+Piercy+Aug+29%2C+1987+Set+3+FM&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":19,"time":1342122086,"description":"mp3 256\nfm broadcast\nexcellent quality\n\nJerry Garcia - guitar, vocals\nJohn Kahn - bass\nMelvin Seals - keyboards\nDavid Kemper - drums\nJaclyn LaBranch - backing vocals\nGloria Jones - backing vocals\n\n1987 was a remarkably challenging year for Jerry Garcia. Many Deadheads had reasons to be thankful, as Garcia's health problems had put his future in jeopardy the previous year, when he lapsed into a diabetic coma. Following his miraculous recovery, the Dead returned with a new focus, a new album, and would soldier on into their third decade together. Much to everyone's surprise, the group would actually score a hit that year with &quot;Touch Of Grey,&quot; a song written years earlier by the Dead's primary lyricist, Robert Hunter, and revamped with an arrangement by Garcia. A song of survival that resonated with radio programmers and MTV as well as Deadheads, this would catapult the band into financial success and media exposure like they had never experienced before. However, it was a double-edged sword. Along with all the new accolades came an onslaught of new fans and the Dead's cultural scene would begin collapsing under the pressure. Police and local officials would react negatively to the legions of Deadheads converging on their cities, many without tickets, and arrests and violence were becoming more frequent occurrences outside the venues. Several venues even barred the Dead from returning. Still, it was a monumental year in the band's history. They would embark on a tour with Bob Dylan that summer, release their &quot;So Far&quot; home video, and their new album, In The Dark would become a bona fide hit.\n\nTo escape the ever-increasing pressures surrounding the Dead and to pursue his own boundless musical interests, Garcia maintained side projects that allowed him to explore outside the context of the Grateful Dead. One of the most rewarding was the Jerry Garcia Band, which often toured during times the Dead were off the road. In 1987, Garcia also put together the Jerry Garcia Acoustic Band, featuring old friends from his pre-Dead bluegrass days. The debut of the acoustic band and one of the most memorable 1987 performances by the Garcia Band proper occurred when Bill Graham, in collaboration with the Hog Farm, presented this memorable concert at French's Camp, a beautiful outdoor location situated on the Eel River, well known for its annual reggae festival. This concert featured the debut performance of Garcia's acoustic band (also featured here in the Concert Vault) and two fully charged sets by the electric incarnation of the Jerry Garcia Band. Few JGB recordings from this era circulate from soundboard direct sources and even fewer still were recorded with such clarity and balance between the instruments, making this recording a very engaging listen.\n\nThe Jerry Garcia Band takes the stage for this third set of the evening, and kicks off with a rousing version of Jimmy Cliff's &quot;The Harder They Come,&quot; made complete with female backing vocals by Jaclyn LaBranch and Gloria Jones that warmly complement Garcia's distinctive voice. Over the course of the hour-long set, the band rolls through some of the most cherished songs of Garcia's repertoire. Highlights include a beautiful rendition of Bob Dylan's &quot;I Shall Be Released,&quot; &quot;Gemorrah,&quot; &quot;The Lucky Old Sun,&quot; and another Dylan cover, &quot;Tangled Up in Blue.&quot;","torrent":{"xt":"urn:btih:5ae68b6ba069b72a65d383964c5d5062692fd414","amp;dn":"Jerry+Garcia+Band+Piercy+Aug+29%2C+1987+Set+3+FM","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5ae68b6ba069b72a65d383964c5d5062692fd414","infoHashBuffer":{"type":"Buffer","data":[90,230,139,107,160,105,183,42,101,211,131,150,76,93,80,98,105,47,212,20]},"announce":[],"urlList":[]}}