{"title":"Shutters and Boards and More - Songs by Audie Murphy","uid":9164226,"size":197180983,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:5b7a737bd6160a94515dd6cadfcd1ff11017cbe3&amp;dn=Shutters+and+Boards+and+More+-+Songs+by+Audie+Murphy&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"kescha66","files":50,"time":1383938144,"description":" This is an extensive collection of songs co-written by Audie Murphy (the most decorated Soldier of World War II and the star of many motion pictures including his autobiographical movie: To Hell and Back). \n\n Normally there are only 17 songs attributed to him, but through a little research, I have found over 100 songs that he has penned, 48 of which I have copies of in one form or another. I have LPs and 45s of about 10 of the songs, but the majority of them were written with Scotty Turner, and I have a set of 20 tapes that Mr. Turner made of his career in music.  I extracted the songs he made with Audie Murphy and made them into distinct tracks.\n\n I have also included the spreadsheet I made to keep track of the songs.\n\n There are a couple of songs (numbers 118 and 119) that were not named on the source material, so they might actually be listed on spreadsheet as something else.\n\n I hope that Audie Murphy fans will find this a welcome addition to their collection.  As well as proof that he did not only write the 17 songs that most publications and websites (including the Army's Audie Murphy Club) credit him with, but many many more.\n\n If there are any questions, comments or additions (or even complaints) that anyone would like to make, please feel free to email me at ksh011366 yahoo com.\n\n Enjoy!","torrent":{"xt":"urn:btih:5b7a737bd6160a94515dd6cadfcd1ff11017cbe3","amp;dn":"Shutters+and+Boards+and+More+-+Songs+by+Audie+Murphy","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5b7a737bd6160a94515dd6cadfcd1ff11017cbe3","infoHashBuffer":{"type":"Buffer","data":[91,122,115,123,214,22,10,148,81,93,214,202,223,205,31,241,16,23,203,227]},"announce":[],"urlList":[]}}