{"title":"Sentinel v1-v2 (Marvel-Tsunami)","uid":4444095,"size":143427386,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:5ba25fb827cc28d52ddff6cf79c43c666e8a25ff&amp;dn=Sentinel+v1-v2+%28Marvel-Tsunami%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mmdsx","files":-1,"time":1223954871,"description":"Sentinel volumes 1 &amp; 2 (Marvel-Tsunami)\n&quot;Juston Seyfert had made a discovery that will change his life:\nthe ravaged remains of a giant, mutant-hunting robot buried in his family&amp;#039;s salvage yard.&quot;\n\n\nSentinel is a comic book series published by Marvel Comics as part of the Tsunami imprint.\nIt is written by Sean McKeever and illustrated by UDON Studios.\nSean McKeever is well known for the Spider-Man Loves Mary Jane series he wrote for Marvel. He currently works for DC exclusively, he writes Birds Of Prey, I think.\nUDON Studios, a collective of asian-influenced creators, is better known for their Street Fighter series, but they have done other work for Marvel, like Agent X, Cable &amp; Deadpool and Taskmaster.\nThe imprint, Tsunami, released some similar titles, like this and Runaways, and some with a different tone, like Mystique.\n\nNow, about this series; it was originally published in 2003 and it was planned to be an ongoing, but lack of sales forced Marvel to end the book by issue #12, giving chance to the creators to wrap the final arc.\nThen, it returned in 2006 for a five-issue limited series by the same creative team.\nThis torrent includes both series\n\n\nSentinel volume one (12 issues)\n\n\n&quot;The first book out of the gate is Sentinel, Sean McKeever&amp;#039;s take on the classic, and familiar, Iron Giant story.\nThe back-story to the main character, Juston Seyfert, is also a familiar tale. He&amp;#039;s a high school kid blessed with high intelligence and cursed with a meager social status. His days are filled with bullying from high school jocks. Once school ends, however, Juston&amp;#039;s world is filled with life. This is the time when he and his fellow outcast friends can do what they want without persecution. They scavenge his father&amp;#039;s junkyard and build miniature robots, testing their machines against one another, honing their skills.\nJuston&amp;#039;s story is probably the one most often shared among protagonists throughout any entertainment medium and genre. Luckily, McKeever has some talent with a pen, and Juston&amp;#039;s life, although very familiar, is at least delivered with enough skill to keep my interest. McKeever&amp;#039;s words ring true and therefore his characters come to life.&quot; - Chad Boudreau\n\n\n\n\n\nSentinel volume two (5 issues)\n\n\n&quot;The globally praised tale of a boy and his &amp;#039;bot returns! After using his refurbished government weapon of mutant destruction to make himself popular, you&amp;#039;d think Juston Seyfert would be on top of the world. Instead, he&amp;#039;s run away from home, torn up inside by the guilt brought on by his selfish acts. Now in search of his mother, who left his family at an early age, Juston must figure out what to do with his life. And if he doesn&amp;#039;t figure it out soon, there are a couple government types who would be more than happy to figure it out for him!&quot; - Solicitacion info (Marvel dot com) ","torrent":{"xt":"urn:btih:5ba25fb827cc28d52ddff6cf79c43c666e8a25ff","amp;dn":"Sentinel+v1-v2+%28Marvel-Tsunami%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5ba25fb827cc28d52ddff6cf79c43c666e8a25ff","infoHashBuffer":{"type":"Buffer","data":[91,162,95,184,39,204,40,213,45,223,246,207,121,196,60,102,110,138,37,255]},"announce":[],"urlList":[]}}