{"title":"[PC - MAC ~ Multi9] Football Manager 2010 [+ patch v.10.1.0]","uid":5140933,"size":2789429035,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:5bfce1f46572a38c1dfdc9329a282c991f716c4f&amp;dn=%5BPC+-+MAC+%7E+Multi9%5D+Football+Manager+2010+%5B%2B+patch+v.10.1.0%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":3,"uploader":"Colombo-bt","files":-1,"time":1256924055,"description":"***********************************\n[PC + MAC ~ MULTI9] FOOTBALL MANAGER 2010\n***********************************\n\nLanguages : ENG - DAN - NOR - SWE - DUT - FRA - ITA - POR - SPA\nGenre: Sport / management (strategy)\nTheme: Soccer\nDeveloper: Sports Interactive\nPublisher : SEGA\nRelease : 30/10/2009\nSupport : DVD\nDim.: 2.59 gb\n\nPATCH V.10.1.0 INCLUDED\n\n\n*************************************\n\n\nFM2010 - THE BEST JOB ON EARTH\n\nPolish - a year of polish, making the game faster, more immersive, more realistic and easier to play with better in game feedback and more advice, delivered in a more user friendly way.\n\nImproved Match Engine - improved AI, over 100 new animations in 3D mode, new stadiums and crowds, improved pitch degradations and better lighting make for the most immersive pitch-side experience ever.\n\nMatch Analysis - a match analysis tool that shows you where shots, passes, crosses, headers, tackles, fouls and interceptions have been made on the field for both teams. See this analysis both live in game, and post match, allowing you to pinpoint the weaknesses and strengths of both your team and your opponents.\n\nNew User Interface - a completely new vibrant look and feel to the game, plus a \nnavigational overhaul. The side menu is replaced by an intuitive tab system, based on extensive consumer feedback and usability studies, which allows you to access all areas of FM 2010 quickly and easily.\n\nTactical Overhaul - a new tactics module makes it much easier to make your team play as you want them to. There are thousands of possible pre-set options and touchline &quot;shout&quot; instructions for making instant changes to your teams playing style. Don't worry; the old system is still there for people who love their sliders.\n\nNews Center - a subscription based newspaper. Get the news about the football world around you that you want, and not the news you don't want.\nNew Data Editor - including a brand new Competition Editor allowing you to add competitions and extra levels for leagues currently in the game, and add completely new competitions and leagues all via a very simple to use editor. Plus, the new editor allows you to keep your game up to date more easily than ever before.\n\n***************************\n\nFootball Manager 2010 ÃƒÂ¨ un titolo difficile e complesso che non lascia troppo spazio al relax. Una vera e propria sfida che ci vede impegnati al massimo su ogni singola partita, consci che in caso di una sconfitta recuperare quei tre punti non sarÃƒÂ  per niente facile. Ma ÃƒÂ¨ anche un modo di vivere quell'immaginario fatto di eroi, scontri e caduti che gli uomini hanno costruito e affossato nel nome dell'agonismo esistenziale e sotto l'egida del dio denaro.\n\n\n\nMinimum Requirements PC\n***********************\nOperating System : Windows Vista / XP / Windows 7\nProcessor : Vista 2.0 GHz / XP 1.4 GHz\nMemory : Vista / Windows 7: 1GB - XP: 512 MB RAM\nVideo card : 128mb Nvidia FX5900 Ultra ; ATI Radeon 9800 ; Intel 82915G / 82910GL or greater\n2 GB Free hard drive space\n\nPlease note: Minimum screen resolution 1024 x 768. Earlier cards may only display 2D Match Viewer Mode and are not supported.\n\nIncreased performance will be noticed on more powerful systems.\n\n\nINSTRUCTION (ENGLISH)\n*********************\n1. Mount iso file with a virtual device (daemon, alcohol)\n2. Install game using &quot;offline system&quot;\n3. If you want play game in english, danish, norwegian or swedish skip to n.5\n4. Copy the other languages file (folder &quot;languages&quot;) in the game folder:\n   /program files/Sports Interactive/Football Manager 2010/data/languages\n5. Run game\n6. Game should be auto select your language in according to your OS, but    you can choose language in    preferences.\n7. REMEMBER -&gt; Support the software developers. If you like this game, buy it.\n\nISTRUZIONI (ITALIANO)\n*********************\n1. Carica il file .iso su unitÃƒÂ  virtuale (daemon, alcohol) o utilizza una copia masterizzata\n2. Installa il gioco utilizzando la funzione &quot;offline system&quot;\n3. Per giocare in inglese, danese, norvegese e svedese, salta al punto 5\n4. Copia gli altri file linguaggio (contenuti nella cartella /languages) nella cartella di gioco:\n   /programmi/Sports Interactive/Football Manager 2010/data/languages\n5. Esegui il gioco\n6. Il gioco dovrebbe caricare automaticamente il linguaggio giusto, per cambiarlo apri le preferenze e    seleziona il linguaggio preferito\n7. RICORDA -&gt; Supporta gli sviluppatori. Se ti piace questo gioco, compralo !\n\n*********************************************************************************\n","torrent":{"xt":"urn:btih:5bfce1f46572a38c1dfdc9329a282c991f716c4f","amp;dn":"%5BPC+-+MAC+%7E+Multi9%5D+Football+Manager+2010+%5B%2B+patch+v.10.1.0%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5bfce1f46572a38c1dfdc9329a282c991f716c4f","infoHashBuffer":{"type":"Buffer","data":[91,252,225,244,101,114,163,140,29,253,201,50,154,40,44,153,31,113,108,79]},"announce":[],"urlList":[]}}