{"title":"'N Sync - Tearin' Up My Heart  (2nafish)","uid":5378496,"size":139692036,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:5c17c82c07735b203f01f44bde7526c326b1ef97&amp;dn=%5C%27N+Sync+-+Tearin%5C%27+Up+My+Heart++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":-1,"time":1266660077,"description":"File Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 8000 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nThis video has no logos or titles.\n\n\n&quot;Tearin' Up My Heart&quot; is the second single released from 'N Sync's Europe/US self-titled debut album. This single is also included on 'N Sync's Greatest Hits.\n\nIn 2007, Tearin' Up My Heart peaked #30 at VH1's 100 Greatest Songs of '90s.\n\nIn 2009, on America's Best Dance Crew it was given to the Massive Monkees on the VMA Challenge. The performance was given the biggest applause and support ever on the show.\n\nThe video is the same for both Europe and the US. It features 'N Sync in a warehouse, dancing, goofing off, and participating in a photo shoot. Originally, a girl was supposed to be in the bed with Justin Timberlake in his solo shots, but this idea was nixed, as Timberlake was only 16 at the time. (He can be seen barefoot in the bed by himself.) The dance routine shown is the same as each time 'N Sync performed it on TV or in concert. The video Debut on TRL September 14, 1998.\n\nThe video was directed by Stefan Ruzowitzky and was nominated for the Video Music Award in 1999.\n\n*NSYNC is the 1998 self-titled debut album by the boy band 'N Sync, released in the United States on March 24, 1998. At first, album sales were mediocre until *NSYNC's 1998 Summer Disney Concert. After the concert was aired, sales began to sky rocket. It reached #2 on the chart and has shipped over 10 million copies in the US alone, making it certified 10x Platinum and earning the group a RIAA diamond award.\n\n'N Sync (occasionally stylized as *NSYNC) was an American boyband. They have sold more than 56 million records worldwide.\n\nFormed in Orlando, Florida in 1995 and launched in Germany by BMG Ariola Munich, NSYNC consisted of Justin Timberlake, JC Chasez, Lance Bass, Joey Fatone and Chris Kirkpatrick and became the 2nd highest selling boyband of all-time (behind the Backstreet Boys). After heavily publicized legal battles with their former manager Lou Pearlman and former record label Sony BMG, the group's 2nd album No Strings Attached sold 1.1 million copies in one day and 2.4 million copies in one week, giving it the highest first week album sales ever in US and #5 worldwide. In addition to a host of Grammy nominations, 'N Sync has performed at the Academy Awards, the World Series, the Super Bowl and the Olympics, and sang or recorded with the likes of Mandy Moore, Aerosmith, Mary J Blige, Britney Spears, Nelly, Michael Jackson, The Jackson Five, Stevie Wonder, Celine Dion, and Gloria Estefan. The group also appeared as themselves on The Simpsons, in an episode entitled &quot;New Kids on the Blecch&quot;, which aired on February 25, 2001. The band are among the highest selling musical acts of the 2000s, and have emerged as one of the most acclaimed boy bands.\n\nWhile 'N Sync announced a &quot;temporary hiatus&quot; in spring 2002, the band has not recorded new material since. The group's official website shut down in summer of 2006, and in 2007, a rumor occurred that Lance Bass confirmed that the group has &quot;definitely broken up.&quot;\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:5c17c82c07735b203f01f44bde7526c326b1ef97","amp;dn":"%5C%27N+Sync+-+Tearin%5C%27+Up+My+Heart++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5c17c82c07735b203f01f44bde7526c326b1ef97","infoHashBuffer":{"type":"Buffer","data":[92,23,200,44,7,115,91,32,63,1,244,75,222,117,38,195,38,177,239,151]},"announce":[],"urlList":[]}}