{"title":"Psychiatric Genetics - Applications in Clinical Practice (Malest","uid":4910016,"size":2607380,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5c34e359de3dd8680f4df973ec5de30e076bd0f4&amp;dn=Psychiatric+Genetics+-+Applications+in+Clinical+Practice+%28Malest&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"malestrom_HH","files":1,"time":1243104659,"description":" &lt;a href=&quot;http://www.image-upload.net/images/7cat1ark0elby1bbpk6.jpeg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.image-upload.net/images/7cat1ark0elby1bbpk6.jpeg&lt;/a&gt;\n\nPsychiatric Genetics: Applications in Clinical Practice by Jordan W., M.D. Smoller\nPublisher: American Psychiatric Publishing, Inc. | Number Of Pages: 337 | Publication Date: 2008-02-15 | ISBN-10: 1585622060 | PDF \n\nPsychiatric Genetics is the first book to focus on clinical applications of genetics in psychiatry. It covers issues involved in genetic counseling, the interpretation of familial and genetic information for clinical use, information regarding risks associated with specific psychiatric disorders, and the uses of genetic testing. Written explicitly for practitioners, it offers a clinically relevant resource to help readers interpret the often bewildering flood of information about genetics and to facilitate responding to patients requests to predict the risk of recurrence of psychiatric illness or provide information about reproductive and pregnancy-related issues.\n\nThe book first presents a framework for understanding and critically evaluating psychiatric genetic research literature, then provides guidelines for genetic counseling. Subsequent chapters summarize genetic aspects of major psychiatric conditions from childhood-onset disorders through psychotic, mood, and anxiety disorders to dementia as well as neuropsychiatric manifestations of other genetic disorders. Risk/benefit considerations related to medication use during pregnancy are then presented. Coverage of ethical, legal, and social implications illustrates the dilemmas that arise with advances in genetic research. Whether used as a clinical guide, reference, or ancillary text, Psychiatric Genetics provides the most up-to-date source on the impact of this growing field on everyday psychiatric practice.","torrent":{"xt":"urn:btih:5c34e359de3dd8680f4df973ec5de30e076bd0f4","amp;dn":"Psychiatric+Genetics+-+Applications+in+Clinical+Practice+%28Malest","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5c34e359de3dd8680f4df973ec5de30e076bd0f4","infoHashBuffer":{"type":"Buffer","data":[92,52,227,89,222,61,216,104,15,77,249,115,236,93,227,14,7,107,208,244]},"announce":[],"urlList":[]}}