{"title":"Feast of the Uninvited","uid":4140484,"size":2457220952,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:5d0860e0b324cd57d0a8e09c608f4864ccc1eaa8&amp;dn=Feast+of+the+Uninvited&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"softline","files":9,"time":1208467631,"description":"Feast of the Uninvited is the story of small lives touched by war. When the great insurrections, revolutions, the wars, sweep over everyday people, their social fabric is torn to shreds, their futures become uncertain, their lives open-ended. And in their desperate predicament they find themselves doing what would have been unthinkable during the secure and predictable times of peace. In the confusion and uncertainty that disruption brings in its wake, there will also emerge from deep inside such people strange traits, blemishes of character and even perhaps bravery - things that they never could have known had been part of them all along. \n\nFeast of the Uninvited is the story of small lives touched by war... \nThe backdrop to this story is a war with more than one name: The South African War; the Boer War; the Anglo-Boer War; Ãƒdie Engelse Oorlog; die Tweede VryheidsoorlogÃƒ. The name of the war depends on the point of view of the speaker. It was fought between 1899 and 1902 between the British Empire and two Boer republics in Southern Africa. The reasons why it came about are many and varied, but in the lives of those who had to suffer through it, reasons are of marginal importance. The immediacy of their plight was their concern, not the abstractions that lead to it. To Captain Brooks, Harry the Welsh miner, the wealthy Van Wyk family and people like Daantjie van Wyk and his beautiful wife, Magrieta, the war became the ultimate test of who they really were. Never could they have imagined that such nameless fears, jealousies and hatreds lurked inside them. That rape and murder could enter their lives was unthinkable. Yet the war...\n\nPerhaps only the little dreamer, Fienatjie Minter, understood the things that would happen to her and the people around her... because, in her strange dreams, only she could hear the dying children sing.\n\nThis award winning drama has a relatively slow start in episode one, but stick with and the later episodes are great.\n\nNot my capture.  Thanks to original capper\n\nShow site:  &lt;a href=&quot;\nhttp://www.mnet.co.za/Mnet/shows/displayShow.asp?id=613&amp;Type=art&amp;ArticleId=2027&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.mnet.co.za/Mnet/shows/displayShow.asp?id=613&amp;Type=art&amp;ArticleId=2027&lt;/a&gt;","torrent":{"xt":"urn:btih:5d0860e0b324cd57d0a8e09c608f4864ccc1eaa8","amp;dn":"Feast+of+the+Uninvited","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5d0860e0b324cd57d0a8e09c608f4864ccc1eaa8","infoHashBuffer":{"type":"Buffer","data":[93,8,96,224,179,36,205,87,208,168,224,156,96,143,72,100,204,193,234,168]},"announce":[],"urlList":[]}}