{"title":"Warhammer 40,000: Space Wolf v1.1.3 apk + data","uid":13109954,"size":515976774,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:5d5c15006064f812bf37e922296c22378cc733e7&amp;dn=Warhammer+40%2C000%3A+Space+Wolf+v1.1.3+apk+%2B+data&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"tiropitaki","files":2,"time":1451457493,"description":"Lead the Sons of Russ into battle and slash your way through hordes of ferocious enemies with Boltgun fire and Chainsword teeth. Write your own saga in the annals of the Space Wolves Chapter as you hunt your sworn enemies – the Chaos Space Marines.\r\n\r\nSavour the atmosphere, as you play this unique combination of turn-based strategy and collectible card game, where you can turn defeat into victory, where events on the battlefield depend on a wise choice of cards and decisions must be planned meticulously.\r\n\r\nIt will take the leadership, senses and cunning of the Space Wolves to be victorious on the planet Kanak, Segmentum Obscurus – the harsh, hostile world chosen by the forces of Chaos as their outpost. What secrets does this slumbering giant, lost in the cold cruel depths of space, hold? What sort of monstrous powers are lurking in its suffocating green jungles, the fiery hell of its volcanoes, and its dusty lifeless wastelands? Discover them as you progress through the campaign! \r\n\r\nFor Russ! For the Wolftime and the Allfather!\r\n\r\nDefeat the unrelenting enemies of the Space Wolves:\r\n• An epic campaign, spanning hostile environments on a distant planet.\r\n• Combat the Word Bearers - fanatical and deadly traitors who serve the chaos gods.\r\nSquad-based tactical battles:\r\n• Grey Hunter, Wolf Scout or Wolf Guard – select your main hero for each mission, to best match your own style, strategy and tactics.\r\n• Unlock all five companions and choose two to take into battle with you.\r\n• Level up your party and unlock numerous perks.\r\n• Lead your Space Wolves into fierce battles in glorious, interactive 3D environments.\r\n\r\nCollectible card driven combat:\r\n• Hundreds of weapons and abilities with various mechanics.\r\n• Customise your decks to fit your unique strategy and tactics.\r\n• Victories unlock powerful new weapons, bonuses and tactics cards.\r\n• Evolve your cards at the Iron Priest’s Forge to further enhance your killer deck! \r\n\r\nPvP Multiplayer:\r\n• Fierce, 3 v 3 close-quarter battles. Use each turn to inflict massive damage on your enemy!\r\n• Rating. Here's your chance to become the top Space Wolf. With each stage, battles get tougher - but the rewards get better.\r\n• At the start of each season, leaderboards are reset. But prove you're the best - and reclaim your leadership status!\r\n\r\nWhat’s New:\r\nImperium Outpost - a new arena for fierce PvP battles available in the game!\r\nAnniversary update is here!\r\n- new legendary weapon;\r\n- special armour elements for veterans of the game;\r\n- &quot;white&quot; textures problem fixed;\r\n- mission 3-4 now works properly;\r\n- minor bug fixes and improvements.\r\n\r\nAn internet connection and 1 GB RAM on your device is required to play.\r\nInstall APK,Place data folder in SDCard/Android/Obb/ and play.\r\nRequires Android: 2.3.3+","torrent":{"xt":"urn:btih:5d5c15006064f812bf37e922296c22378cc733e7","amp;dn":"Warhammer+40%2C000%3A+Space+Wolf+v1.1.3+apk+%2B+data","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5d5c15006064f812bf37e922296c22378cc733e7","infoHashBuffer":{"type":"Buffer","data":[93,92,21,0,96,100,248,18,191,55,233,34,41,108,34,55,140,199,51,231]},"announce":[],"urlList":[]}}