{"title":"VA-Mellomania 22 Mixed By Pedro Del Mar-2CD-2012-QMI-JKoop","uid":7857855,"size":295797817,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:5d6b625a742cb51a9c3b47fa504483550316b95e&amp;dn=VA-Mellomania+22+Mixed+By+Pedro+Del+Mar-2CD-2012-QMI-JKoop&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"jmz619","files":-1,"time":1353828291,"description":"Artist...:   VA\nTitle....:   Mellomania 22 Mixed By Pedro Del Mar\nLabel....:   Black Hole Recordings\nGenre....:   Trance\nQuality..:   VBR kbit/ 44,1 kHz\nSource...:   CDDA\nRipdate..:   Nov-24-2012\nEncoder..:   LAME 3.98.4 (VBR -V0 --vbr-new)\nTracks...:   02\n\nTracklist:\n\n01.Mellomania 22 Mixed By Pedro Del Mar CD1    77:48\n\n01.Mellomania 22 Mixed By Pedro Del Mar CD2    77:37\n\n                                               279,7 MB\nNotes:\n\nHi Mellomaniacs,\n\nAlmost another year has passed since the release of the last Mellomania 2CD,\nso I'm very thrilled myself to present the brand new Mellomania 22!\n\nThe global EDM-scene massively changed over the last months.\nProgressive house is dominating the global club scene, and more and more former\ntrance artists are going into a more progressive direction.\nI'm personally very open-minded when it comes to music styles,\nand I'm also showcasing many different genres in my Mellomania radio shows.\nIn these times you can anyway hardly separate the unique styles,\nand in my opinion there is also no need to limit yourself to stay within certain boundaries.\n\nBut before you're becoming frightened about the style of the album you're currently holding in your hands,\nI can release the all-clear. Mellomania 22 is a 100% trance compilation with euphoric,\nemotional and uplifting tunes on Disc 1 and Balearic and slightly progressive trance tracks on Disc 2.\nWhilst one or the other tune may already sound familiar to you, you'll also find a lot of fresh tracks,\nwhich have exclusively been produced for this compilation.\n\nI'm really excited to receive your honest feedback and comments about this album.\nThe easiest way of catching up with me is always via my social networks like Facebook and Twitter,\nor you can just give me a shout during one of my gigs.\n\nLast but not least I would like to thank all Mellomaniacs from all across the globe for the never ending support\nyou're giving me, and I wish you outstanding remaining weeks of the year.\nFor all those who do celebrate Christmas, have a great time with your beloved.\n\nSee you soon on a gig nearby you.\n\nCheers,\n\nPedro.\n","torrent":{"xt":"urn:btih:5d6b625a742cb51a9c3b47fa504483550316b95e","amp;dn":"VA-Mellomania+22+Mixed+By+Pedro+Del+Mar-2CD-2012-QMI-JKoop","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5d6b625a742cb51a9c3b47fa504483550316b95e","infoHashBuffer":{"type":"Buffer","data":[93,107,98,90,116,44,181,26,156,59,71,250,80,68,131,85,3,22,185,94]},"announce":[],"urlList":[]}}