{"title":"Max Payne 3 Incl 3 DLC's Repack PC | Complete Edition","uid":15962052,"size":16957014016,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:5db9b777f294927693c2d50a3f569844a1fa8268&amp;dn=Max+Payne+3+Incl+3+DLC%27s+Repack+PC+%7C+Complete+Edition&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Menocjam","files":1,"time":1475678458,"description":"About This Game\r\nFor Max Payne, the tragedies that took his loved ones years ago are wounds that refuse to heal. No longer a cop, close to washed up and addicted to pain killers, Max takes a job in São Paulo, Brazil, protecting the family of wealthy real estate mogul Rodrigo Branco, in an effort to finally escape his troubled past. But as events spiral out of his control, Max Payne finds himself alone on the streets of an unfamiliar city, desperately searching for the truth and fighting for a way out. \r\n\r\nCombining cutting edge shooting mechanics with a dark and twisted story, Max Payne 3 is a seamless, highly detailed, cinematic experience from Rockstar Games.\r\n\r\nFEATURES:\r\n• Developed by Rockstar Games for a seamless, highly detailed, cinematic experience \r\n• Advanced Bullet Time® and Shootdodge™ and Final Kill-cam mechanics for stylish shooting action \r\n• Cutting edge aiming, targeting and animation processes for precise, fluid gunplay \r\n• A dark, twisted story chronicling the return of Max Payne, one of the most iconic characters in videogames \r\n• Tight integration between Natural Motion’s Euphoria Character Behavior System and a brand new iteration of the Rockstar Advanced Game Engine (RAGE) for lifelike movement and a new level of environmental awareness \r\n• A wide range of weapons rendered in incredible detail: hammers cock back, shells eject from the chamber and each bullet is individually modeled from the split second it’s fired to the moment of impact \r\n• Advanced particle physics and destructible environments set the stage for dramatic and chaotic gun fights \r\n• New to the series, a compelling and addictive multiplayer experience to match the dark and relentless atmosphere of the single-player game \r\n• Retired Feature: Online Multiplayer for Max Payne 3 on Mac will no longer be available in-game as of 5/31/14.\r\n\r\nSystem Requirements\r\nWindows Mac OS X\r\nOS: Windows 7 32/64 Service Pack 1, Windows Vista 32/64 Service Pack 2, Windows XP 32/64 Service Pack 3 \r\nProcessor: Intel Dual Core 2.4 GHZ -  i7 3930K 6 Core  x 3.06 GHZ / AMD Dual Core 2.6 GHZ - FX8150 8 Core x 3.6 GHZ \r\nMemory: 2GB - 16GB \r\nHard Disk Space: 35 Gigs \r\nVideo Card: NVIDIA® 8600 GT 512MB VRAM – NVIDIA® GeForce® GTX 680 2GB VRAM / Radeon HD 3400 512MB VRAM - Radeon HD 7970 3GB VRAM \r\nSound Card: 100% Direct X 9.0 compatible – Direct X 9.0 compatible supporting Dolby","torrent":{"xt":"urn:btih:5db9b777f294927693c2d50a3f569844a1fa8268","amp;dn":"Max+Payne+3+Incl+3+DLC%27s+Repack+PC+%7C+Complete+Edition","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5db9b777f294927693c2d50a3f569844a1fa8268","infoHashBuffer":{"type":"Buffer","data":[93,185,183,119,242,148,146,118,147,194,213,10,63,86,152,68,161,250,130,104]},"announce":[],"urlList":[]}}