{"title":"IDM UEStudio Pro 15.30 English","uid":12719039,"size":56140685,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:5ea6013b6779a24f8cf935e9465baf63779ee701&amp;dn=IDM+UEStudio+Pro+15.30+English&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"jovo_bih","files":1,"time":1446974355,"description":"******************************\r\nIDM UEStudio Pro 15.30 English\r\n******************************\r\n\r\nUEStudio offers all the text editing functionality of UltraEdit and includes an array of powerful development features to help accelerate your workflow across larger scale projects.\r\n\r\nWork in groups or teams? Using version control? Need to save time? Need more power?\r\nUEStudio delivers the storied reliablity, flexibility and power of UltraEdit with some serious enhancements for developers and power users – Intellitips, the ClassViewer, PHP and Ruby scripting support, compiling and building support, and Subversion, cvs and Git integration.\r\n\r\nBenefits of UEStudio vs. UltraEdit\r\n\r\nUEStudio web development tools\r\n\r\n- Integrated PHP Debugger: Integrated PHP Debugger (using XDebug) allows you to run your PHP scripts on a local webserver and debug them through UEStudio\r\n- PHP IntelliTips: IntelliTips for PHP-specific language elements\r\n- Integrated PHP scripting support: Integrated PHP functions allow you to parse and run your PHP scripts as well as check your PHP code\r\n- Integrated Ruby scripting support: Execute and check your Ruby code, or launch Ruby with specified command line options and run it on the active script \r\n\r\nUEStudio file handling tools\r\n\r\n- Project Manager: View project list, set backup, specify project locations, create batch builder list, track time spent on projects\r\n- Solutions Menu: Manage the way sets of related projects are configured, built, and deployed\r\n- SVN/CVS/Git Support (Version Control): Add and configure version control system accounts to track developmental changes to your files \r\n\r\nUEStudio file editing tools\r\n\r\n- Tabbed Output Window: Execute multiple functions and store the dynamically generated output of these functions separately for future reference (during the active editing session)\r\n- Intellitips: The power of language intelligence integrated with an intelligent auto complete tooltip for code elements of the current file. IntelliTips also provides a dialog-based popup that displays class/struct data members and functions. Some of this functionality is automatically triggered during the coding process while other items may be invoked from the IntelliTips toolbar\r\n\r\nUEStudio integrated development tools\r\n\r\n- Workspace Manager: Powerful tabbed interface that gives the user multiple methods of interacting with projects, solutions, files, resources, tags and much more\r\n- Build Project: Save the active document if needed and compile and link all project files\r\n- Resource Editor: Add, Remove, Browse resources as desired. Edit dialogs, string tables, menus and more. You can even configure UEStudio to edit bitmaps and icons via user-installed graphic editors\r\n- Project Converter: Convert projects from Visual Studio format to a format supported by UEStudio\r\n- Classviewer: Displays a parsed representation of the active project within the Workspace Manager. Quickly jump to definitions shown in this view\r\n- Compiler Support: With support for over 65 different compilers, UEStudio is equipped to natively support project configurations for many popular programming compilers and assemblers, including Microsoft Visual C++, Java, GNU C/C++, and much more. This powerful capability provides users truly advanced IDE operations from within UEStudio\r\n- Debug: Select a debugger and run it on the active file\r\n- Integrated Debugger: (requires WinDBG installation) Launch your application, then start, end or restart a dbugging session. Also execute your code one statement at a time, one line at a time, or through the remaining lines. Add or remove breakpoints\r\n- Batch Builder: Create lists of projects that are in one workspace and build them in one step \r\n\r\nHomepage http://www.ultraedit.com/products/uestudio.html","torrent":{"xt":"urn:btih:5ea6013b6779a24f8cf935e9465baf63779ee701","amp;dn":"IDM+UEStudio+Pro+15.30+English","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5ea6013b6779a24f8cf935e9465baf63779ee701","infoHashBuffer":{"type":"Buffer","data":[94,166,1,59,103,121,162,79,140,249,53,233,70,91,175,99,119,158,231,1]},"announce":[],"urlList":[]}}