{"title":"The Monuments Men","uid":10601669,"size":1980788312,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:5eb2b72ccdb420a6691432da26b800569780688c&amp;dn=The+Monuments+Men&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"fantom87","files":-1,"time":1405931573,"description":"Originally uploaded by YIFY, I've taken the liberty of removing the Cinavia copy protection for all to enjoy how they please!\n\nCowriter and director George Clooney adapts author Robert M. Edsel's book The Monuments Men: Allied Heroes, Nazi Thieves, and the Greatest Treasure Hunt in History to tell the incredible true story of the seven art historians and museum curators who went behind enemy lines during World War II on a mission to recover some of the world's greatest works of art. With war raging in Europe, the Nazis have managed to plunder some of the biggest art collections on the continent. As the Third Reich begins to topple, the German army receives explicit orders that in the event of Adolf Hitler's death, they are to destroy every work of art in their possession. Determined to prevent 1000 years of culture from going up in flames, American president Franklin D. Roosevelt approves a proposal by Frank Stokes (Clooney) to form a task force comprised entirely of art experts to enter Germany, recover the works of art, and ensure they are returned to their rightful owners. With little knowledge of modern weapons or warfare tactics, the ragtag squadron has their work cut out for them.\n\nResolution: 1920 x 800","torrent":{"xt":"urn:btih:5eb2b72ccdb420a6691432da26b800569780688c","amp;dn":"The+Monuments+Men","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5eb2b72ccdb420a6691432da26b800569780688c","infoHashBuffer":{"type":"Buffer","data":[94,178,183,44,205,180,32,166,105,20,50,218,38,184,0,86,151,128,104,140]},"announce":[],"urlList":[]}}