{"title":"Klub 17 ( all material from razyuli.org)","uid":9429439,"size":13111971853,"categoryP":"porn","categoryS":"games","magnet":"?xt=urn:btih:5ecfbe7b1db72068a61cafcc83df8d9767249478&amp;dn=Klub+17+%28+all+material+from+razyuli.org%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":4,"uploader":"Crowndemon","files":1,"time":1388764939,"description":"This is all Material from Razyuli.org that worked. I'm a old member that ripped everything I could when I found a way to enter the site when it was down. I got ricks mods as well before he took it away.\n\nI have had it since the site closed down, Now I want to share what i have in hope someone with programming knowledge start a new site and make sure to have their site and server on a place where Thrixx cant touch them.\n\n\nI want to be anonymous because Thrixx uses maffia methods to get what they want. \nAnd people should boycott them. Their 3D sexvilla 2 engine is worthless compare to this. You cant even change the body on the girls. Because, omg then you can create TOO young models! insanity... it's pixels, who cares! Japanese grown up girls look like a european 15 year old girl. So it's just stupid moral crap.  \n\nI will seed for 5 days.\n\nMake sure you to check the rar file i uploaded for viruses. I am not sure at all, because I just packed down what I had.\n\nI will upload a rpgmaker vx ace hentai game soon that is a picture based game with attacks and a story to follow a condemned soul to atone for his crimes.\n\nI personally recommend you drop movie creations. Takes WAY TO LONG and pictures can be equally good. Just look at some of the comics out there compare to movies. \n\nI will in the future upload models, like zelda,Samus,angels,demons ect ect.\n\nof course anonymous because the retribution from thrixx is NOT worth the extra fame. ","torrent":{"xt":"urn:btih:5ecfbe7b1db72068a61cafcc83df8d9767249478","amp;dn":"Klub+17+%28+all+material+from+razyuli.org%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5ecfbe7b1db72068a61cafcc83df8d9767249478","infoHashBuffer":{"type":"Buffer","data":[94,207,190,123,29,183,32,104,166,28,175,204,131,223,141,151,103,36,148,120]},"announce":[],"urlList":[]}}