{"title":"Freaky Families by Diana Wynne Jones (retail) {dwg}","uid":11312319,"size":11219984,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5ed062279e32e3b68be186d91d3234a5c73048f6&amp;dn=Freaky+Families+by+Diana+Wynne+Jones+%28retail%29+%7Bdwg%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"gratefuldawg77","files":6,"time":1414519381,"description":"THE FOUR GRANNIES. A boy and a girl are left alone for a couple of days, while their parents go away on a business trip. They have four very different grandmas - a mean one, a snobby one, an anxious one, and a delicate one. Erg (the boy) uses household objects to make an invention for his own amusement, but soon realises it does what he asks. He tries to make all the grannies leave him alone, but it turns them into one 'Super-Granny' - massive, and with traits from all of them. AUNTIE BEA'S DAY OUT. Annoying Auntie Bea always does things HER way. And when she decides to take the three children (Nancy, Debbie and Simon) to the seaside, despite what the signs say, she is determined that they will sit on the small, fenced off and isolated island. It turns out to be a magical island though, and whisks her &amp; the children (and dog) around to different places trying to get rid of them, until finally the children are able to escape when it lands near home, although Auntie Bea stays on and eventually ends up in the Bahamas, and is happy enough to stay","torrent":{"xt":"urn:btih:5ed062279e32e3b68be186d91d3234a5c73048f6","amp;dn":"Freaky+Families+by+Diana+Wynne+Jones+%28retail%29+%7Bdwg%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5ed062279e32e3b68be186d91d3234a5c73048f6","infoHashBuffer":{"type":"Buffer","data":[94,208,98,39,158,50,227,182,139,225,134,217,29,50,52,165,199,48,72,246]},"announce":[],"urlList":[]}}