{"title":"Oom Ferdinand en de toverdrank (1974) NLT-Release (DIVx) herplaa","uid":4685760,"size":916317002,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:5ed99515192993e426d82b3e3224fe0b01eec897&amp;dn=Oom+Ferdinand+en+de+toverdrank+%281974%29+NLT-Release+%28DIVx%29+herplaa&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"diddle783","files":4,"time":1233227752,"description":"De broers Marc en Robin hebben een speedbootje waarmee ze graag op de plassen varen. Daar leren ze Inge kennen, die logeert bij haar oom Ferdinand, een oude zeeman. Hij is bezig met het opruimen van de zolder van zijn landhuis, dat vol staat met souvenirs van zijn zeereizen. \nMarc en Robin helpen mee met het uitzoeken van de vele voorwerpen. In een oude kist vinden ze een rol perkament met daarop een spreuk. Volgens oom Ferdinand stond de kist al in het huis toen hij er kwam wonen, net als het schilderij van een jonge vrouw. Als het viertal de spreuk hardop voorleest stapt tot hun verbazing de dame uit het schilderij. \nZe blijkt freule Esmeralda te heten en zit al sinds 1538 gevangen in het schilderij. Omdat een gemene ridder haar dreigde te doden als ze niet met hem zou trouwen liet de vader van Esmeralda haar door een tovenaar opnemen in het schilderij. Dankzij de toverspreuk kan ze weer tot leven komen, maar slechts een uur per dag\nOom Ferdinand en de kinderen beloven haar om in de toverboeken die ook in de kist liggen te gaan zoeken naar een middel waarmee Esmeralda voorgoed uit het schilderij zou kunnen stappen. Het blijkt om een toverdrank te gaan, die iedereen die ervan drinkt onzichtbaar maakt. Tijdens het brouwen van de toverdrank wordt oom Ferdinand bespiedt door Otto en Gerrit, twee mannen die gek op taart zijn. \nZij zien in de toverdrank de ideale manier om ongestoord taart te eten in de taartenfabriek van meneer Faber. Om oom Ferdinand te dwingen de toverdrank aan hen te geven ontvoeren ze Inge. Dat leidt tot een grappige achtervolging, want de auto wordt bestuurd door een onzichtbare oom Ferdinand. \nMaar zonder resultaat, daarom krijgen Otto en Gerrit de toverdrank en wordt Inge vrijgelaten. Intussen heeft oom Ferdinand ontdekt dat het ook mogelijk is om Esmeralda uit het schilderij te bevrijden als er op haar lege plek een nieuw portret wordt geschilderd door een familielid van de tovenaar. Dat blijkt meneer Faber te zijn, van de taartenfabriek, waar op dat moment ook Otto en Gerrit hun slag zijn. \nUiteraard lukt het om Esmeralda definitief uit het schilderij te bevrijden, maar niet nadat oom Ferdinand, de kinderen, meneer Faber en zijn zoon Peter de onzichtbare taartdieven Otto en Gerrit hebben verslagen met een wedstrijd taartengooien. \n\nMet o.a Lex Goudsmit en Willeke Alberti\n\nVoor de nieuwste films en muziek ga je naar NLT.Ons-Forum het forum voor de Nederlands Ondertitelde/Gesproken Torrents:\n &lt;a href=&quot;\nhttp://www.nlt.ons-forum.nl&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.nlt.ons-forum.nl&lt;/a&gt; ","torrent":{"xt":"urn:btih:5ed99515192993e426d82b3e3224fe0b01eec897","amp;dn":"Oom+Ferdinand+en+de+toverdrank+%281974%29+NLT-Release+%28DIVx%29+herplaa","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5ed99515192993e426d82b3e3224fe0b01eec897","infoHashBuffer":{"type":"Buffer","data":[94,217,149,21,25,41,147,228,38,216,43,62,50,36,254,11,1,238,200,151]},"announce":[],"urlList":[]}}