{"title":"Sexually Broken--Beautiful blonde AJ Applegate stuck in stocks, ","uid":9781188,"size":1438801292,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:5eec100e1372810754378d6179157a640563c525&amp;dn=Sexually+Broken--Beautiful+blonde+AJ+Applegate+stuck+in+stocks%2C+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"merzedes","files":-1,"time":1395101910,"description":"\nBeautiful blonde AJ Applegate stuck in stocks, drilled down with brutal deepthroat, used hard! | AJ Applegate | Matt Williams\n\nMarch 17, 2014\n\n\nLow and High bitrate MP4 and iPod + Pics.\n\n \nAJ Applegate is a smoking hot piece of ass. Blonde, beautiful and fit, today we are going to take this fine piece of flesh and turn it into a blowjob machine. We do not need any part of her other then her mouth hole. We do not need her opinions or thoughts, just her throat meat. And all it takes to turn this athlete into a deep throat device is a set of wooden stocks. Once she is restrained in them, it is go time.\n\nWe are nothing is not nice however, and set up this face pussy on a sybian. Sybians are literally the most powerful vibrator in the world. They sound like a jet engine taking off and they have the ability to milk orgasm after orgasm out of a tired pussy long after it wants to quit and give up. Today we see just how well AJ can multitask. How well can she handle the dick when she is cumming her brains out? Particularly if nipple weights are added to the picture?\n\nThe rock hard cock steps right up and owns her face. We sink into to the hilt and make ourselves at home. If there is one thing this slut can do, and do well, it is suck dick. We hang out for a while and make ourselves at home. All the while, the sybian is working the magic between her restrained thighs. AJ sputters and gasps, unable to do a things about the waves of pleasure washing over her body or the dick lodged in her mouth.\n\nAJ is completely conquered by cock. The sybian, the orgasms, the cock owning her air, they all combine and send her plunging down the sexual rabbit hole. She is gone, checked out, finally made aware of the true meaning of Sexuallybroken. A few more thrusts and then we simply walk away, leaving the sybian to work its magic. It will never get tired or slow down, never need a break. AJ's moans can be heard echoing off of the walls. She is going to be here a while... \n \nScreens &lt;a href=&quot;\nhttp://sexuallybroken.com/sexual/bondage/2014/03_17aapplegate2/SexuallyBroken-AJ-Applegate-Matt-Williams-Beautiful-blonde-AJ-Applegate-stuck-in-stocks-drilled-down-with-brutal-deepthroat-used-hard.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://sexuallybroken.com/sexual/bondage/2014/03_17aapplegate2/SexuallyBroken-AJ-Applegate-Matt-Williams-Beautiful-blonde-AJ-Applegate-stuck-in-stocks-drilled-down-with-brutal-deepthroat-used-hard.php&lt;/a&gt;\n\n13 000 uploads and counting, 14k here we come :) And as usual, if you still like what Shallow2 and I upload, how about leaving us a nice comment below ? :)\n\n\nAny Questions ?? Read our FAQ!!\n &lt;a href=&quot;\nhttp://image.bayimg.com/eaea7e9e982a9a677d61e4f5aaf93b7643bd6eeb.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://image.bayimg.com/eaea7e9e982a9a677d61e4f5aaf93b7643bd6eeb.jpg&lt;/a&gt;\n\n\nCheers  :-)  \n\n\n\n\n","torrent":{"xt":"urn:btih:5eec100e1372810754378d6179157a640563c525","amp;dn":"Sexually+Broken--Beautiful+blonde+AJ+Applegate+stuck+in+stocks%2C+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5eec100e1372810754378d6179157a640563c525","infoHashBuffer":{"type":"Buffer","data":[94,236,16,14,19,114,129,7,84,55,141,97,121,21,122,100,5,99,197,37]},"announce":[],"urlList":[]}}