{"title":"MTV - The RW/RR Challenge S14 - The Island","uid":8007368,"size":7339287673,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:5fe222f7c83362b01745784244695d54797674c7&amp;dn=MTV+-+The+RW%2FRR+Challenge+S14+-+The+Island&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"zed1234","files":9,"time":1357921175,"description":"Somewhere off the coast of Panama, 20 former Real Worlders and Road Rulers are dropped into shark-infested waters. After swimming for safety, they come upon The Island. Here, veterans and rookies alike will compete for a share of a $300,000 buried treasure during the latest season of The Real World/Road Rules Challenge. \n\nBut this time around, say goodbye to weekly challenges because survival is the only challenge. Gone are the days when a comfy bed and a fully stocked bar greeted the contestants after a difficult day. On The Island, competitors will have to find their own food and shelter. Staying in the game won't be half as hard as staying alive in the harsh jungle wilderness. \n\nAnd, for the first time ever, there are no predetermined teams going into this Real World/Road Rules Challenge. That means it's up to the contestants to forge their own alliances -- or not. Who will be left out? Who will opt to be a loner? Which alliances will be torn apart by treachery? Only time will tell... \n\nOf course, the social aspect is only one facet of this complex competition. During their time on The Island, contestants must construct two boats that they will eventually use to reach a nearby island. On the other island, $300,000 in gold awaits the first four people to lay claim to it. How will they build these boats? Materials will be air-dropped in every few days, but it's up to the contestants to assemble the pieces and make sure their vessels are seaworthy. \n\nOnce the boats are complete, only eight key-holders will be allowed to board. In order to get a key, contestants must risk it all in a three-way face-off. Yup, each week three contestants do battle, and one leaves -- leaves for the other island, that is. After each face-off, the winner receives a key, and one of the losers is voted off The Island. Naturally, the rules can change at any time and no key-holder is ever completely safe. \n\nWhile friendships and alliances are extremely important in such a cutthroat game, romance just might trump them both. When old flames are reunited and new relationships emerge, anything can happen. Some contestants might let their hearts lead them right out of the game while others might try to charm their way to victory. But no matter what happens, drama is inevitable. \n\nAnything goes in this 20-person melee, but only four will emerge victorious. It's a race for buried treasure unlike any other, where staying alive is just as important as staying ahead of the game. Drama, heartbreak and treachery are all guaranteed, so just one question remains: who will conquer The Island?\n\n\nRelease Notes:\n\nEvery episode from this season of The Real World/Road Rules Challenge\n\nEpisodes on 640x360 and Reunion on 576x432","torrent":{"xt":"urn:btih:5fe222f7c83362b01745784244695d54797674c7","amp;dn":"MTV+-+The+RW%2FRR+Challenge+S14+-+The+Island","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5fe222f7c83362b01745784244695d54797674c7","infoHashBuffer":{"type":"Buffer","data":[95,226,34,247,200,51,98,176,23,69,120,66,68,105,93,84,121,118,116,199]},"announce":[],"urlList":[]}}