{"title":"ImTOO Video Joiner 2.0.1 Build 0111 Portable [ak]","uid":6412226,"size":23190457,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:600ab0e1e2f8277082ee648b949feeea71178098&amp;dn=ImTOO+Video+Joiner+2.0.1+Build+0111+Portable+%5Bak%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Anacondaz","files":-1,"time":1306037352,"description":"ImTOO Video Joiner 2.0.1 Build 0111 Portable\n\nImTOO Video Joiner is a powerful video joining and video merging software which can join or merge multiple video files into one new file as AVI joiner, MPEG joiner and H.264 joiner. This video joiner program supports a lot of video formats including AVI, MPEG, MP4, WMV, 3GP, H.264, MOV, ASF, SWF, DAT (the video format used in VCD).\n\nImTOO Video Joiner can help you join multiple files in the same or different formats into a large one and combine multiple video files into one. It supports joining AVI, MKV, MPEG, MP4, WMV, FLV, 3GP, H.264, MOV, ASF, DAT, HD video, etc.\n\nSince ImTOO Video Joiner supports previewing the original video file, setting video size, and frame rate to get the perfect quality, it becomes the ideal tool for both new and experienced users.\n\nWith high speed, high quality of output files and easy operation, you can enjoy your multimedia life. Free download ImTOO Video Joiner to joine video files perfectly.\n\nKey Features\n- You can add as many video files as possible to the list and freely rearrange their order if necessary.\n- When joining video files, you can adjust bit rate, frame rate, resolution to get the best quality for your videos.\n- The built-in player enables you to preview the video files and the output video after the process.\n- Auto implement one of after-done actions after video joining done to release you from waiting to the end.\n- Provide multilingual interfaces including English, German, Japanese and Chinese.\n\nHome Page - http://www.imtoo.com/\n\n","torrent":{"xt":"urn:btih:600ab0e1e2f8277082ee648b949feeea71178098","amp;dn":"ImTOO+Video+Joiner+2.0.1+Build+0111+Portable+%5Bak%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"600ab0e1e2f8277082ee648b949feeea71178098","infoHashBuffer":{"type":"Buffer","data":[96,10,176,225,226,248,39,112,130,238,100,139,148,159,238,234,113,23,128,152]},"announce":[],"urlList":[]}}