{"title":"What We Saw - Aaron Hartzler","uid":12649160,"size":920315,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:60bcec0e0621d08d03c8f5e56855ff750e7d1568&amp;dn=What+We+Saw+-+Aaron+Hartzler&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Mohammad_AT","files":3,"time":1446101395,"description":"Critically acclaimed memoirist Aaron Hartzler, author of Rapture Practice, takes an unflinching look at what happens to a small town when some of its residents commit a terrible crime. This honest, authentic debut novel—inspired by the events in the Steubenville rape case—will resonate with readers who've ever walked that razor-thin line between guilt and innocence that so often gets blurred, one hundred and forty characters at a time.\r\n\r\nThe party at John Doone's last Saturday night is a bit of a blur. Kate Weston can piece together most of the details: Stacey Stallard handing her shots, Ben Cody taking her keys and getting her home early. . . . But when a picture of Stacey passed out over Deacon Mills's shoulder appears online the next morning, Kate suspects she doesn't have all the details. When Stacey levels charges against four of Kate's classmates, the whole town erupts into controversy. Facts that can't be ignored begin to surface, and every answer Kate finds leads back to the same questions: Who witnessed what happened to Stacey? And what responsibility do they have to speak up about what they saw?\r\n\r\nNational Book Award finalist Deb Caletti calls What We Saw &quot;a smart, sensitive, and gripping story about the courage it takes to do what's right.&quot;","torrent":{"xt":"urn:btih:60bcec0e0621d08d03c8f5e56855ff750e7d1568","amp;dn":"What+We+Saw+-+Aaron+Hartzler","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"60bcec0e0621d08d03c8f5e56855ff750e7d1568","infoHashBuffer":{"type":"Buffer","data":[96,188,236,14,6,33,208,141,3,200,245,229,104,85,255,117,14,125,21,104]},"announce":[],"urlList":[]}}