{"title":"MSC Nastran 2013.1","uid":9605832,"size":2408163346,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:6115e78b612582af8459c87ea1efd81ac122b7f1&amp;dn=MSC+Nastran+2013.1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"wimpie999","files":4,"time":1392220213,"description":"MSC Software Corporation, the leader in multidiscipline simulation solutions that accelerate product innovation, announced the new release of MSC Nastran 2013.1, augmenting the groundbreaking capabilities like solver embedded fatigue, optimization for fatigue life and poroelastic material modeling introduced in the previous 2013 release. The new capabilities in 2013.1 provide engineers with faster performance for large models, ease of use, and nonlinear analysis improvements.\n\nRelease highlights of MSC Nastran:\n\nACMS Improvements for Faster Simulation Run Times\nAutomated Component Mode Synthesis (ACMS) in MSC Nastran has shown performance improvements over the past several releases to enable users to perform modal analysis of large models. The new release delivers further speed enhancements with 10% to 30% time reductions in the ACMS portion of large scale simulations reducing the time and cost of modal and automotive NVH simulations. In particular, overall run times dominated by I/O are mostly impacted.\n\nAxisymmetric Rotordynamics for Improved Accuracy\nGas turbine and aircraft engine manufacturers can achieve more accurate prediction of the rotordynamic performance of structures with rotating components with the help of the new axisymmetric harmonic elements. Users can model geometrically axisymmetric structures subjected to general non-axisymmetric loading represented by harmonics, allowing engineers to capture the effects of the complex geometry of the rotors, achieving better results.\n\nSupport of Large Models\nImproved integration has been achieved between MSC Nastran 2013 and SimXpert 2013 so very large models can be visualized.\n\nAdvanced Nonlinear Analysis Enhancements\nThe nonlinear analysis capabilities have been further improved to provide increased ease of use and flexibility to handle large models with efficiency.","torrent":{"xt":"urn:btih:6115e78b612582af8459c87ea1efd81ac122b7f1","amp;dn":"MSC+Nastran+2013.1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6115e78b612582af8459c87ea1efd81ac122b7f1","infoHashBuffer":{"type":"Buffer","data":[97,21,231,139,97,37,130,175,132,89,200,126,161,239,216,26,193,34,183,241]},"announce":[],"urlList":[]}}