{"title":"Geothermal Energy - Renewable Energy and the Environment","uid":12007876,"size":13136805,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6139705c942e25781171d80b08dbb5d2cb35f028&amp;dn=Geothermal+Energy+-+Renewable+Energy+and+the+Environment&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1433996460,"description":"ISBN 9781420075700\n\nHistorically, cost effective, reliable, sustainable, and environmentally friendly, use of geothermal energy has been limited to areas where obvious surface features pointed to the presence of a shallow local heat source, such as hot springs and volcanoes. However, recent technological advances have dramatically expanded the range and size of viable resources, especially for applications such as modular power generation, home heating, and other applications that can use heat directly. These recent developments have greatly expanded opportunities for utilizing geothermal energy. Reflecting current interest in alternative energy, Geothermal Energy: Renewable Energy and the Environment explores where geothermal energy comes from and how to find it, how it can be accessed, successful applications, and improvements for future uses.\n\nThe author reviews the background, theory, power generation, applications, strengths, weaknesses, and practical techniques for implementing geothermal energy projects. He stresses the links between acquisition and consumption and the environment. Packed with real world case studies and practical implementation steps, the book covers geosciences principles, exploration concepts and methods, drilling operations and techniques, equipment needs, and economic and environmental topics. Each chapter includes an annotated list of key sources that provide useful information beyond that contained in the text.\n\nThe minor environmental impacts caused by geothermal energy gives it the potential to play an important role in the transition from fossil fuels to more sustainable fuels. Successful deployment, however, requires that the resource be matched to the application being developed. Rigorously covering all aspects of geothermal energy, this book provides up-to-date scientific information that can be used to discern applications and regions best suited for geothermal energy","torrent":{"xt":"urn:btih:6139705c942e25781171d80b08dbb5d2cb35f028","amp;dn":"Geothermal+Energy+-+Renewable+Energy+and+the+Environment","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6139705c942e25781171d80b08dbb5d2cb35f028","infoHashBuffer":{"type":"Buffer","data":[97,57,112,92,148,46,37,120,17,113,216,11,8,219,181,210,203,53,240,40]},"announce":[],"urlList":[]}}