{"title":"Mack The Life ","uid":8859589,"size":4376658,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6318cbbeb6864757fad8d3bdc73c74511a6da0bc&amp;dn=Mack+The+Life+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"livhre","files":-1,"time":1377740706,"description":"Have you ever wondered where comedians come from? Why is it that one person is a funny bloke down the pub while another actually makes a living by standing up in front of an audience telling jokes? And where does all that material come from? Well, young Lee McKillop used to wonder that too.\n\n\n\nGrowing up in his parents' pub, small and wiry in a world of bigger and chunkier specimens, Lee quickly learned that cracking jokes was a way to get attention. After a somewhat random series of jobs, which included being Red Rum's stableboy and a bingo hall barman, it was as a Great Yarmouth holiday camp entertainer that he had his first crack at telling jokes on stage. It got him some laughs, the sack and a punch in the face.*\n\n\n\nNow, as Lee Mack, he's one of our best loved and most successful comedians, both as a live stand-up and on television. In Mack the Life, Lee tells the story of how he got there and gives extraordinary insight into what really makes comics tick. Hilarious and brilliant, it's the kind of book which reminds you why you learned to read in the first place.\n\n\n\n*Nearly.\n","torrent":{"xt":"urn:btih:6318cbbeb6864757fad8d3bdc73c74511a6da0bc","amp;dn":"Mack+The+Life+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6318cbbeb6864757fad8d3bdc73c74511a6da0bc","infoHashBuffer":{"type":"Buffer","data":[99,24,203,190,182,134,71,87,250,216,211,189,199,60,116,81,26,109,160,188]},"announce":[],"urlList":[]}}