{"title":"Metamaterials for Perfect Absorption - Young Pak Lee et al.","uid":15209415,"size":10391362,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:631bb299c5650ac20704d807aff02299031ad166&amp;dn=Metamaterials+for+Perfect+Absorption+-+Young+Pak+Lee+et+al.&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1467655638,"description":"Metamaterials for Perfect Absorption - Young Pak Lee et al. (Springer, 2016).pdf\r\n\r\nISBN 978-981-10-0103-1\r\n\r\nThis book provides a comprehensive overview of the theory and practical development of metamaterial-based perfect absorbers (MMPAs). It begins with a brief history of MMPAs which reviews the various theoretical and experimental milestones in their development. The theoretical background and fundamental working principles of MMPAs are then discussed, providing the necessary background on how MMPAs work and are constructed. There then follows a section describing how different MMPAs are designed and built according to the operating frequency of the electromagnetic wave, and how their behavior is changed. Methods of fabricating and characterizing MMPAs are then presented.\r\n\r\nThe book elaborates on the performance and characteristics of MMPAs, including electromagnetically-induced transparency (EIT). It also covers recent advances in MMPAs and their applications, including multi-band, broadband, tunability, polarization independence and incidence independence.\r\n\r\nSuitable for graduate students in optical sciences and electronic engineering, it will also serve as a valuable reference for active researchers in these fields","torrent":{"xt":"urn:btih:631bb299c5650ac20704d807aff02299031ad166","amp;dn":"Metamaterials+for+Perfect+Absorption+-+Young+Pak+Lee+et+al.","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"631bb299c5650ac20704d807aff02299031ad166","infoHashBuffer":{"type":"Buffer","data":[99,27,178,153,197,101,10,194,7,4,216,7,175,240,34,153,3,26,209,102]},"announce":[],"urlList":[]}}