{"title":"Glen Campbell - Wichita Lineman","uid":4545216,"size":125636612,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:63afd902bbd7a8899f6595ed2e08b8c7cd7c814d&amp;dn=Glen+Campbell+-+Wichita+Lineman&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":-1,"time":1228098990,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 256 kbps\n\n\n&quot;Wichita Lineman&quot; is a popular song written by Jimmy Webb in 1968, first recorded by Glen Campbell and widely covered by other artists. Campbell&amp;#039;s version, which appeared on his 1968 album of the same name, reached #3 on the U.S. pop chart, remaining in the Top 100 for 15 weeks. In addition, the song also topped the American country music chart for two weeks, and the adult contemporary chart for six weeks. In 2004, Rolling Stone magazine&amp;#039;s list of the &quot;500 Greatest Songs of All Time&quot; ranked &quot;Wichita Lineman&quot; at #192. It has been referred to as &amp;#039;the first existential country song&amp;#039;.\n\nWebb was inspired to write the lyrics when he saw a solitary lineman in rural northern Oklahoma. The lyric describes the longing that a lonely telephone or electric power lineman feels for an absent lover who he imagines he can hear &quot;singing in the wire&quot; that he is working on. Such a sonic vibration is commonly induced by wind blowing across small conductors. There is uncertainty as to which &quot;Wichita&quot; is intended; Wichita, Kansas, Wichita County, Kansas (which is over 250 road miles away), Wichita Falls, Texas, and Wichita County, Texas have all been suggested as possibilities, and others believe that Webb had entitled the song &quot;Ouachita Lineman,&quot; but that Campbell later changed that title to its present form.\n\n&quot;Wichita Lineman&quot; has been recorded by a diverse range of artists; from Ray Charles, Johnny Cash, Sammy Davis, Jr. and Dwight Yoakam to Kool and the Gang, Bobby Broom and Urge Overkill.\n\nJames Taylor recorded the song on his album, &quot;Covers&quot;, released in September 2008. Taylor includes the soulful rendition in the first set of his current U.S. tour.\n\n&quot;Wichita Lineman&quot; was selected as one of the greatest songs of the 20th century by Mojo magazine in 1997 and by Blender in 2001.\n\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:63afd902bbd7a8899f6595ed2e08b8c7cd7c814d","amp;dn":"Glen+Campbell+-+Wichita+Lineman","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"63afd902bbd7a8899f6595ed2e08b8c7cd7c814d","infoHashBuffer":{"type":"Buffer","data":[99,175,217,2,187,215,168,137,159,101,149,237,46,8,184,199,205,124,129,77]},"announce":[],"urlList":[]}}