{"title":"Rainbow - Bent Out Of Shape [1983][320KBPS][JAPANSHM-CD]","uid":11779525,"size":131468084,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:647307864b08ee67f2643319c34f516800d174c5&amp;dn=Rainbow+-+Bent+Out+Of+Shape+%5B1983%5D%5B320KBPS%5D%5BJAPANSHM-CD%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"LameDuck69","files":31,"time":1427510377,"description":"Rainbow - Bent Out Of Shape [1983][SHM-CD Japanese UICY-93625]\n\n\n\n01. Stranded     \n02. Can't Let You Go    \n03. Fool For The Night      \n04. Fire Dance     \n05. Anybody There      \n06. Desperate Heart      \n07. Street Of Dreams     \n08. Drinking With The Devil      \n09. Snowman      \n10. Make Your Move\n---------------------------\n**320 KBPS CBR\n**Cover Art\n---------------------------\nRainbow (also known as Ritchie Blackmore's Rainbow or Blackmore's Rainbow) were a British rock band led by guitarist Ritchie Blackmore from 1975 to 1984 and 1993 to 1997. They were originally established with American rock band Elf's members, but Blackmore fired all the members except Ronnie James Dio who would leave in 1979. Three British musicians joined in 1979, singer Graham Bonnet, keyboardist Don Airey, former Deep Purple bassist Roger Glover, and this line-up gave the band their commercial breakthrough with the single &quot;Since You Been Gone&quot;. Over the years Rainbow went through many line-up changes with no two studio albums featuring the same line-up. Other lead singers Joe Lynn Turner and Doogie White would follow, and the project consisted of numerous backing musicians. The band started out combining mystical lyric themes with neoclassical metal, but went in a more streamlined commercial style following Dio's departure from the group.\n\nRainbow were ranked No. 90 on VH1's 100 Greatest Artists of Hard Rock. The band has sold over 28 million albums worldwide and 4 million albums in the United States.\n--------------------------------------------------------------------------------\nBent Out of Shape was the seventh studio album released by the British hard rock band Rainbow. It was originally released in 1983 as an LP and cassette. The cassette featured several longer edits compared to the vinyl version. It was recorded at Sweet Silence Studios in Copenhagen in about 7 weeks.\n\nA remastered CD reissue was released in May 1999, which restored the artwork of the original release. This has two tracks of a longer duration than on the first US CD issue.\n\nThis album is generally referred to by critics and fans as a commercial effort, with the band attempting to repeat the success of the song &quot;Stone Cold&quot; and the album Straight Between the Eyes. As a result, some of the songs, like the first single released from this album, &quot;Street of Dreams&quot;, are usually considered to be more in the album-oriented rock style, instead of the hard rock sound of earlier Rainbow albums. The album was particularly aimed at the US market: the title is an American idiom rather than a British one.\n\nThe music video for &quot;Can't Let You Go&quot;, directed by Dominic Orlando, was filmed in New York City (1984) and inspired by the 1920 silent b/w film The Cabinet of Dr. Caligari. Along with &quot;Street of Dreams&quot;, directed by Storm Thorgerson, it became a part of Rainbow's home video collection The Final Cut (1985). The music video for &quot;Street of Dreams&quot; was banned by MTV for its supposedly controversial hypnotic clip.\n\nThe song &quot;Street of Dreams&quot; has been re-recorded in two versions by Blackmore's Night in 2006 for their fifth studio album, The Village Lanterne. The version featured on a regular album was sung by Candice Night. The other version, a bonus track on a special edition of the album, was performed in a duet by Night and former Rainbow singer Joe Lynn Turner.\n--------------------------------------------------------------------------------\n\nRainbow:\n\nRitchie Blackmore: guitar\n\nRoger Glover: bass, percussion, producer\n\nJoe Lynn Turner: vocals\n\nDavid Rosenthal: keyboard\n\nChuck Burgi: drums","torrent":{"xt":"urn:btih:647307864b08ee67f2643319c34f516800d174c5","amp;dn":"Rainbow+-+Bent+Out+Of+Shape+%5B1983%5D%5B320KBPS%5D%5BJAPANSHM-CD%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"647307864b08ee67f2643319c34f516800d174c5","infoHashBuffer":{"type":"Buffer","data":[100,115,7,134,75,8,238,103,242,100,51,25,195,79,81,104,0,209,116,197]},"announce":[],"urlList":[]}}