{"title":"Spearmint - A Week Away [1999]","uid":9431749,"size":309351672,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:64f8bd680a6b4a3c8d611f075e9cb26de18ce6f6&amp;dn=Spearmint+-+A+Week+Away+%5B1999%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"GenXRock","files":-1,"time":1388822687,"description":"Spearmint are a London-based indie pop band, founded in 1995. Their founding members were Shirley Lee (lead vocals, guitar), Simon Calnan (vocals, keyboards), Martin Talbot (bass), and Ronan Larvor (drums). Talbot left soon afterward, to be replaced by James Parsons. Dickon Edwards later ended up joining as second guitarist, though leaving in 2000 to form Fosca. Parsons then took over second guitar duties, with Andy Lewis joining on bass.\nShirley Lee (usually referred to in the press as Mr. Shirley Lee to clear up the ambiguous gender of his name) had been a member of Laverne &amp; Shirlie before uniting the members of Spearmint in the southeast of London in 1995. In the band he sang and played guitar while Simon Calnan played keyboard and provided backing vocals, Ronan Larvor played drums, and Martin Talbot played bass. Forming their own label called hitBack, they released their earliest songs as vinyl white labels. When bass player Talbot left, they found his replacement, James Parsons, through a classified ad placed in the magazine Melody Maker. Parsons was also a graphic artist, and he went on to design the album covers and sleeves for the rest of the band's career.\nWork on their ambitious first album took three years, and in 1998, before they had finished it, several of their early singles became surprisingly popular in Japan. Taking advantage of the moment, they compiled their earlier material together instead and released this as their debut album, &quot;Songs for the Colour Yellow&quot;, before heading out on a tour of Japan. In 1999 they released &quot;A Week Away&quot;, the album that they had planned to debut with. A concept album about a weeklong holiday representing the sum of a person's life, it proved less popular overseas but earned them fans within Britain.\n\nAMG: 4.5/5","torrent":{"xt":"urn:btih:64f8bd680a6b4a3c8d611f075e9cb26de18ce6f6","amp;dn":"Spearmint+-+A+Week+Away+%5B1999%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"64f8bd680a6b4a3c8d611f075e9cb26de18ce6f6","infoHashBuffer":{"type":"Buffer","data":[100,248,189,104,10,107,74,60,141,97,31,7,94,156,178,109,225,140,230,246]},"announce":[],"urlList":[]}}