{"title":"Femina India - 8 May 2016 (gnv64)","uid":14544326,"size":19821804,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:67280ea96159fc22c9ce131940b19cf1e9e20444&amp;dn=Femina+India+-+8+May+2016+%28gnv64%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"gnv65","files":4,"time":1462559718,"description":"Femina India - 8 May 2016\r\nEnglish | 74 pages | True PDF | 18.9 mb\r\n\r\nThe story of Femina, India's first and most read women's English magazine, unfolds much like the story of the urban Indian woman. For over 50 years now, Femina has been capturing the essence of the modern woman and how she has been evolving. Over the years, Femina's readership has grown steadily, with over 60% of its English edition readers being in the age group of 25-45 years. Today, our reader is not 'just' a homemaker or 'just' a professional, but she is both and more.\r\n\r\nIt covers a huge bandwidth of topics including fashion, relationships, beauty, buzz, health, and food, and columns like Your Space and Spotlight make it a one-stop-destination for women. Also features user-generated content in the form of tips, communities, forums, polls, contests and other interactive content which add to the experience of the end user.\r\n\r\nSpoilt for choice this holiday season? Let the latest issue of Femina be your vacation guide to all things exciting and worth exploring this season. Take cues from the Big Story and navigate uncharted territories to create memories that will last a lifetime. The fashion section has all the deets on the hottest styles for the perfect sun-kissed vacay. Finally, head to the beauty section for a master class in creating two holiday looks with just five products. Also don’t forget to catch up with cover girl Vartika Singh who spills her beauty and style secrets, Aamir Khan who tells us about his plans and Karan Johar who dishes out delicious secrets, the way he only can!\r\n\r\nALL ABOUT YOU\r\n14 Love ARE YOU DATING UP? Studies say that over time, partners can end up looking like each other, and behaving in similar ways. Make sure that you are with someone who makes you a better person\r\n16 Love KISS AND TELL Our readers share stories of their first smooch\r\n17 Passion GAMES FOR TWO Spice up your sex life with games designed to help you score\r\n18 Celeb cheat sheet HOW TO OWN YOUR BODY LIKE DEMI LOVATO She has battled eating disorders and learnt to love her body\r\n19 Lifeline ARE YOU THE JEALOUS FRIEND? Don’t let the green-eyed monster stop you from celebrating your\r\nfriend’s achievements\r\n20 Life 5 STEPS TO HANDLING A PANIC ATTACK Take a deep breathe and read on to get your cool back\r\n22 Money HOW TO BE A MILLIONAIRE BY 30 Some prudent spending and clever investing can make this a reality\r\n\r\nFASHION\r\n24 Front row TROPIC THUNDER Take your swimgear island-hopping\r\n25 AQUA GIRL Race to the finish line in a sports-inspired wardrobe\r\n26 DARK DEPTHS A palette of black, white and metallic will turn up the heat\r\n27 Conversation HAPPY TRAVELLER Designer Anupama Dayal creates picture postcards through her clothes\r\n29 Debut LESS IS MORE Meet the new crop of contemporary accessories designers\r\n30 Fashion by numbers BIKINI HOPPING Your style guide to the perfect, sun-kissed vacation wardrobe\r\n\r\nBEAUTY\r\n38 Masterclass GET THE LOOK We show you how to create two holiday looks with just five products\r\n40 Trial-a-trend CANDY IS DANDY Mix pink with red to look and feel delicious\r\n41 Makeup Mantra BLACK MAGIC Dia Mirza shows us how a swipe of kajal can lift any look\r\n42 Nail edit CORAL PUNCH Nothing offsets a glowing tan better than a coat of coral nail polish\r\n46 Health documentary BATTERY LOW, PLEASE RECHARGE Learnt how to log out and refresh yourself\r\n50 Fitness Bulletin VACAY WORKOUT Stay fit even on your holiday with these five easy workouts\r\n\r\nREALITY\r\n52 Cover girl KEEPING IT COOL We get personal with Miss Grand International 2015 second runner-up Vartika Singh\r\n55 On my own FIT FOR THE MARKET There’s no excuse for staying out of shape once you download Neha Motwani’s fitness app, Fitternity\r\n56 The life and times of… MR NICE GUY Shashi Kapoor was more than just a filmstar, the 77-year-old actor has promoted experimental theatre, niche cinema and has starred in over a hundred films\r\n60 Man we love PLAYING TO WIN Model Gaurav Arora is all set to take Bollywood by storm\r\n\r\nLIVING\r\n64 Food GETTING CHEESY Chef Sandeep Pande of the Renaissance Mumbai Convention Centre Hotel teaches us how to whip up some cheesy European classics\r\n67 Interiors COTTAGE RETREAT With the right accents, you can turn your city home into your favourite rural retreat\r\n\r\nTHIS JUST IN\r\n70 5 questions with… KARAN JOHAR The filmmaker dishes about the new season of Koffee With Karan and being an emotional anchor for heartbroken friends\r\n72 Insider OUT ON VACATION! These celeb Instagram accounts will have you packing your bags\r\n74 The buzzmakers AAMIR KHAN ON SHIFTING SHAPES The actor tells us how he lost all the weight after shooting for Dangal and his best birthday gift\r\n\r\nIN EVERY ISSUE\r\n2 EDITOR’S LETTER\r\n3 TOMBSTONE\r\n6 INBOX\r\n43 BEAUTY MANDATE\r\n \nhttps://s32.postimg.org/gru9v5xhh/Femina_India_8_May_2016.jpg","torrent":{"xt":"urn:btih:67280ea96159fc22c9ce131940b19cf1e9e20444","amp;dn":"Femina+India+-+8+May+2016+%28gnv64%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"67280ea96159fc22c9ce131940b19cf1e9e20444","infoHashBuffer":{"type":"Buffer","data":[103,40,14,169,97,89,252,34,201,206,19,25,64,177,156,241,233,226,4,68]},"announce":[],"urlList":[]}}