{"title":"The Illustrated Encyclopedia of Warfare by DK Publishing [PDF]","uid":12135621,"size":66616172,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:67930152267afe9095e7f047dff712dad469c599&amp;dn=The+Illustrated+Encyclopedia+of+Warfare+by+DK+Publishing+%5BPDF%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Hawzerstar","files":1,"time":1437169821,"description":"Book name: The Illustrated Encyclopedia of Warfare\n\nBook author: DK Publishing\n\nBook description: The most wide-ranging and visually arresting history of wars and warfare ever published, The Illustrated Encyclopedia of Warfare documents every major war or significant period of conflict in over 5000 years of human history.\n\nA must-have reference gift for military enthusiasts and general readers alike, no other book about warfare contains such a diverse selection of imagery including contemporary paintings and photographs, objects and artifacts, and specially commissioned artworks, maps, and diagrams.\n\nThe Illustrated Encyclopedia of Warfare includes a comprehensive directory of every major war, thematic spreads examining broader topics within the history of warfare, from the role of mercenaries, communications, and the treatment of wounded soldiers, and personal accounts and objects from soldiers and civilians that bring to life the human experience of battle.\n\nFrom the earliest known Wars in Sumeria and Ancient Egypt War to the occupation of Iraq, The Illustrated Encyclopedia of Warfare combines a coherent and compelling spread-by-spread historical narrative with a wealth of supporting features to recount the epic 5000-year story of warfare and combat through the ages.\n\nNumber of pages: 512\n\nPublisher: DK\n\nPublication date: April 16, 2012\n\nISBN10: 0756695481\n\nISBN13: 9780756695484\n\nFormat: PDF","torrent":{"xt":"urn:btih:67930152267afe9095e7f047dff712dad469c599","amp;dn":"The+Illustrated+Encyclopedia+of+Warfare+by+DK+Publishing+%5BPDF%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"67930152267afe9095e7f047dff712dad469c599","infoHashBuffer":{"type":"Buffer","data":[103,147,1,82,38,122,254,144,149,231,240,71,223,247,18,218,212,105,197,153]},"announce":[],"urlList":[]}}