{"title":"Joan Jett &amp; The Blackhearts - Cherry Bomb (2nafish)","uid":5729221,"size":116772868,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:686c6e744b64bbe9a5b043d6a2c4bd79d8dadc51&amp;dn=Joan+Jett+%26+The+Blackhearts+-+Cherry+Bomb+%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":-1,"time":1280584760,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nFlashback is a compilation album of outtakes and rare songs released by Joan Jett and the Blackhearts. The album was initially released in late 1993 and was reissued in 1998 with a slightly different track listing. The 1998 version dropped five tracks from the 1993 release: &quot;Summertime Blues&quot;; &quot;Louie, Louie&quot;; &quot;Star Star&quot;; &quot;Stand Up For Yourself&quot;; and &quot;Call Me Lightning&quot; and replaced them with &quot;Real Wild Child (Wild One)&quot;; a live version of &quot;Bad Reputation&quot;; and &quot;Right 'Til The End&quot; which was only available on the cassette version of the 1993 release. &quot;Call Me Lightning&quot; and &quot;Summertime Blues&quot; were later added as bonus tracks on the reissue of Bad Reputation and &quot;Louie, Louie&quot; became a bonus track on the reissue of I Love Rock 'N Roll. &quot;Star Star&quot; was included on the initial 1983 pressing of Album but was deleted from some subsequent pressings. The song was restored on the CD release.\n\nJoan Jett (born Joan Marie Larkin; September 22, 1958) is an American rock guitarist, singer, songwriter, producer and actress.\n\nShe is best known for her work with Joan Jett &amp; the Blackhearts including their hit cover &quot;I Love Rock 'n' Roll&quot;, which was #1 on the Billboard charts from March 20 to May 1, 1982, as well as for their other popular recordings including &quot;Crimson and Clover,&quot; &quot;I Hate Myself for Loving You,&quot; &quot;Do You Want to Touch Me,&quot; &quot;Light of Day,&quot; &quot;Love Is All Around,&quot; &quot;Bad Reputation,&quot; and &quot;Little Liar.&quot;\n\nHer musical and songwriting approach is heavily influenced by the hard-edged, hard beat-driven rhythms common to many rock bands of her native Philadelphia, often featuring lyrics surrounding themes of lost love, criticisms of insincerity, the quest for authenticity, the struggles and resolutions of the American middle class.\n\nCherry Bomb is a 1976 punk-influenced hard rock song by the all-girl band The Runaways off of their self-titled debut album. Although it was not released as a single, the song is regarded by many as the band's signature song. Cherry Bomb was also ranked 52nd on VH1's 100 Greatest Hard Rock Songs.\nThe song was also used in the cult classic film Dazed and Confused, and was featured on the soundtrack. It can also be heard as a partial cover song by Jojo in the movie &quot;RV&quot; and was covered by Dakota Fanning and Kristen Stewart, who played Cherie Currie and Joan Jett, for the 2010 biopic film.\nThe song will be re-recorded by the band and featured in the video game Guitar Hero: Warriors of Rock.\n\nJett is a founding member of The Runaways along with drummer Sandy West. Micki Steele (who was later replaced), Jackie Fox, Lita Ford, and Cherie Currie completed the line-up. While Currie initially fronted the band, Jett shared some lead vocals, played rhythm guitar and wrote or co-wrote a lot of the band's material along with Ford, West and Currie. The band recorded five LPs, with Live In Japan  becoming one of the biggest-selling imports in U.S. and U.K. history. The band toured around the world and some of their opening acts included Cheap Trick, Rush, Van Halen and Tom Petty and the Heartbreakers. They found success abroad, especially in Japan.\n\nWhile The Runaways were popular in Europe, Asia, Australia, Canada and South America, they could not garner the same level of success in the U.S. After Currie and Fox left the band (to be replaced by bassist Vicki Blue and later, Laurie McAllister), the band released two more albums: Waitin' for the Night and And Now... The Runaways. Altogether they produced five albums from 1975 until they disbanded in spring of 1979.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:686c6e744b64bbe9a5b043d6a2c4bd79d8dadc51","amp;dn":"Joan+Jett+%26+The+Blackhearts+-+Cherry+Bomb+%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"686c6e744b64bbe9a5b043d6a2c4bd79d8dadc51","infoHashBuffer":{"type":"Buffer","data":[104,108,110,116,75,100,187,233,165,176,67,214,162,196,189,121,216,218,220,81]},"announce":[],"urlList":[]}}