{"title":"EnigmaT Set Rips { Cuts } - October 24th, 2013","uid":9091271,"size":457925724,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:69e8f78bd17e6067d3f945fb62e6d3838713a14d&amp;dn=EnigmaT+Set+Rips+%7B+Cuts+%7D+-+October+24th%2C+2013&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"EnigmaT","files":50,"time":1382601664,"description":"1Touch pres. Lemon Shaker - Chavala (After Meridian Remix) (Cut From Feel Set)-enTc.mp3\nAlexander Borisov - The Epoch of Trance (Original Mix) (Cut From Feel Set)-enTc.mp3\nAlpha Force vs. DJ Cesar - Utopia (Original Mix) (Cut From El Jay Set)-enTc.mp3\nAmir Afargan - Dawn Of Paradise (Cut From Ferry Set)-enTc.mp3\nAnthony Salvate - Lavallette Beach (Cut From Palagano Set)-enTc.mp3\nAPD - Dimension (Hypaethrame Remix) (Cut From Angel Set)-enTc.mp3\nB.Exp - Anrage (Original Mix) (Cut From Anderson Set)-enTc.mp3\nCarl Nunes feat. Jonny Rose - Live Forever (Original Mix) (Cut From Anderson Set)-enTc.mp3\nCon Phillips - Bogota (Ikerya Project Remix) (Cut From Iker Set)-enTc.mp3\nCris Peacock - Andrea (Cut From Palagano Set)-enTc.mp3\nDJ Rap - Freefalling (Nick The Kid Remix) (Cut From Anderson Set)-enTc.mp3\nDominik von Francois - Panorama (Pizz@dox Remix) (Cut From Feel Set)-enTc.mp3\nDreamy &amp; Ikerya Project - Bahamut (Original Mix) (Cut From Iker Set)-enTc.mp3\nEDX &amp; Leventina - The Tempest (Extended Mix) (Cut From Ferry Set)-enTc.mp3\nErick Strong &amp; Eskova - Another Day Of Life (Alekzander Remix) (Cut From Feel Set)-enTc.mp3\nEssonita feat. Irina Makosh - Letter To Angel (Spark7 Dub Mix) (Cut From Anderson Set)-enTc.mp3\nFatboy Slim - Praise You (Ferry Corsten Bootleg) (Cut From Ferry Set)-enTc.mp3\nFrench Skies - Across The World (Original Mix) (Cut From a'ndY Set)-enTc.mp3\nGal Abutbul - Reflected (Original Mix) (Cut From Anderson Set)-enTc.mp3\nGal Abutbul - Sunset (Original Mix) (Cut From Anderson Set)-enTc.mp3\nGelardi &amp; Thomas N - Aquamento (Original Mix) (Cut From Anderson Set)-enTc.mp3\nHassen B - Land Of Happiness (Jesper Olesen's Shredded Remix) (Cut From El Jay Set)-enTc.mp3\nHassen B - Land Of Happiness (Sky Flight Epic Take) (Cut From Saux Set)-enTc.mp3\nIkerya Project - Night To Remember (Cut From Iker Set)-enTc.mp3\nJay Redcourt - Siri (GreenHouse Fnkrz Remix) (Cut From Pit Set)-enTc.mp3\nJoe Garston Feat. Andrew Farr - Happy Ending (Froxic Remix) (Cut From Shiver Set)-enTc.mp3\nJohn Newall - Time Will Tell (Original Mix) (Cut From Saux Set)-enTc.mp3\nLange Feat. Ilseviolin - Violin's Revenge (Cut From Lange Set)-enTc.mp3\nLeama - Requiem For A Dream (Quivver Remix) (Cut From Ronde Set)-enTc.mp3\nMaksim Palmaxs - Red Alert (Original Mix) (Cut From Anderson Set)-enTc.mp3\nMatt Eray - Resistance (Cut From Palagano Set)-enTc.mp3\nMike Lockin &amp; Mart De Schmidt - Allure (Original Mix) (Cut From Anderson Set)-enTc.mp3\nMorvan - And She Smiles (Original Mix) (Cut From Anderson Set)-enTc.mp3\nMorvan - And She Smiles (Solid Stone Remix) (Cut From Feel Set)-enTc.mp3\nNaden - Haunted Skies (Cut From Ronde Set)-enTc.mp3\nNarayana - We Are The People From Bogo City (Original Mix) (Cut From Super8 Set)-enTc.mp3\nNick Wolanski and Nick Muir - Bedrock Enemies (Cut From Pit Set)-enTc.mp3\nPhilippe El Sisi &amp; Ahmed Romel - Gloria (Original Mix) (Cut From Romel Set)-enTc.mp3\nPurple Stories feat. Ian Standerwick - Perfect Love (Cut From Ronde Set)-enTc.mp3\nRoman Messer feat. Kate Walsh - Come Home (Two &amp; One Remix) (Cut From Two&amp;One Set)-enTc.mp3\nSean Tyas &amp; Noah Neiman - Lose My Logic (Melodic Mix) (Cut From Lange Set)-enTc.mp3\nSecond Life - The Prophece (Original Mix) (Cut From Ex-Driver Set)-enTc.mp3\nSimple Art - The Miracle (Original Mix) (Cut From Romel Set)-enTc.mp3\nSpark - A Better World (Cut From Palagano Set)-enTc.mp3\nSunset &amp; Puma Scorz - Solina (Original Mix) (Cut From Romel Set)-enTc.mp3\nSunset &amp; Puma Scorz - Solina (Original Mix) (Cut From Saux Set)-enTc.mp3\nTrancEye - No Signal (TrancEye's Remastered Original Mix) (Cut From El Jay Set)-enTc.mp3\nTwo &amp; One with Denis Kenzo feat. Steva B - Sitorya (Original Mix) (Cut From Two&amp;One Set)-enTc.mp3\nUCast - Klia (Original Mix) (Cut From Saux Set)-enTc.mp3\nVictor Orange vs Iversoon &amp; Alex Daf - The Day Before Tomorrow (Andrew Stets Remix) (Cut From Pit Set)-enTc.mp3\n","torrent":{"xt":"urn:btih:69e8f78bd17e6067d3f945fb62e6d3838713a14d","amp;dn":"EnigmaT+Set+Rips+%7B+Cuts+%7D+-+October+24th%2C+2013","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"69e8f78bd17e6067d3f945fb62e6d3838713a14d","infoHashBuffer":{"type":"Buffer","data":[105,232,247,139,209,126,96,103,211,249,69,251,98,230,211,131,135,19,161,77]},"announce":[],"urlList":[]}}