{"title":"Friends into Lovers","uid":7748293,"size":480135905,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6a45db2ee6a3a41c88d92984586884a0845e6fc3&amp;dn=Friends+into+Lovers&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"7a094b44","files":7,"time":1350834310,"description":"\nWho is Eric Edgemont and What is &quot;Friends Into Lovers&quot;\nIf you are a guy who has been stuck in the &quot;friend zone&quot; with a girl that you like (or maybe are in love with) then you have no doubt thought about how to get yourself out of the friend zone. Well, this guy Eric Edgemont became a top dating expert after an experience that he had being stuck DEEP in the friend zone with a girl that he really liked.\n\nEric created and has recently updated a program he calls &quot;Friends Into Lovers that teaches guys all of the steps that they need to take to go from friends to lovers with a woman.\n\nIn this article I'm going to be lookiing at Eric's program and sharing my thoughts on the validity of his system.\nBackground on Eric Edgemont's story...\nEric Edgemont's story is really something else. I had seen a couple of his other programs in the past, but it wasn't until I went to his website and watched his video about going from friends to lovers that I really got a sense of what drove him to become such an expert on women and dating.\n\nYou see, Eric is a guy who was in a very serious &quot;friend zone&quot; situation back when he was in high school. He was totally in love with this girl and he was tortured by the fact that she only saw him as a friend while she went out and dated all of these other guys. I won't give you his whole story because you will get a lot more out of hearing it from him himself (crazy story!) but yeah... This guy was in a tough spot, but he became like a super friend zone escape artist ninja, and created a system to help guys bail out of the friend zone. And that's this Friends Into Lovers system.\nOverview Of The Friends Into Lovers Course...\nEric Edgemont actually came out with the first version of his friends into lovers course a few years ago and has since been working on other projects. This course has widely been considered the &quot;go to&quot; system for guys who are stuck in the friends zone with women and it has helped thousands of guys all over the world. Eric shares many of these success stories and then are pretty darn impressive. It seems like guys really appreciate the help that they have gotten from him...\n\nAnyhow, Eric recently rerecorded this program and added a bunch of new content, bonuses etc... So I got a copy and actually listened to the entires 18 CD audio course. Yeah, the course is crazy-long, but if you are trying to take things to the lover level with a woman I think that you will appreciate the fact that this program is so comprehensive.\n\nI'm not sure how Top Secret eric wants to keep this program, so i'm not going to be sharing anything TOO detailed but here's a breakdown of what you learn:\n\n- Intro: Eric shares his story and gives you vbackground on this whole friend zone situation.\n- Why you're just friends 3 tracks explain WHY this has happened... This is pretty deep stuff IMHO\n- How To Cut It OFF: Talking about &quot;defusing the bomb&quot; and moving on - a first step.\n- Step 2 the personal make-over, surface tweaks, perspectives, mental role models, your presence, killing neediness\n- Step 3 secret stuff...\n- Step 4 this is basically about how to hook up with her, all the techniques for talking to her etc...\n- Conclusion, success stories, etc... This is the wrap up.\n\nSo this content is spread over the 18 tracks which I believ comes out to roughly 9 hours of audio content. After listening to this in it entirity I must say that it covered everything I ever wanted to know about going from friends to lovers with a girl.\n\nThe thing I liked best is that Eric has laid everything out for you in an easy to follow way, so you know what to do from start to finish. From the lame situation of being her &quot;buddy&quot; to being the man she wants to be with and pursues.\n\nMy girlfriend tried to put me in the friend zone when i first met her, and the way that i got her is a lot like what Eric talks about in this program. Luckily I didn't allow myself to fall in too deep, but if I had, I trust that this info would have helped me to drag myself out.\n\nBut let's cut to the chase and answer the question I bet you've got... Is Friends Into Lovers something worth listening to for 9 hours? (plus more bonus audios...)\n\nI say, if you are in the friends zone then heck yeah it is!\n\nI mean really, to get a chance to get with that girl you've been crushing on for so long? Dude when I am in that position with a girl i'd donate plasma to get with her.\n\nbut that's me, i'm passionate about the women I like...\n\nSo i hope you've found this useful. for more check out friendsintolovers.com\nIt's time to stop being her friend and start being her LOVER! ","torrent":{"xt":"urn:btih:6a45db2ee6a3a41c88d92984586884a0845e6fc3","amp;dn":"Friends+into+Lovers","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6a45db2ee6a3a41c88d92984586884a0845e6fc3","infoHashBuffer":{"type":"Buffer","data":[106,69,219,46,230,163,164,28,136,217,41,132,88,104,132,160,132,94,111,195]},"announce":[],"urlList":[]}}