{"title":"Engineering for Sustainability - A Practical Guide for Sustainab","uid":14612671,"size":2546530,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6a56205bfdb64b45fc9c4c6942cba31474887863&amp;dn=Engineering+for+Sustainability+-+A+Practical+Guide+for+Sustainab&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1463170143,"description":"Engineering for Sustainability - A Practical Guide for Sustainable Design - Gerald Jonker, ‎Jan Harmsen (Elsevier, 2012).pdf\r\n\r\nISBN 9780444538468\r\n\r\nThis book provides engineers with the necessary information to design sustainable processes, products and value chains. It describes the current consensus on sustainable development for four context levels: Planet, Society, Business, and Engineers. It also presents all required design steps: from problem definition, via synthesis of potential solutions, analysis of solutions, improvements to the final solution evaluation. For each design step, methods and guidelines are provided in relation to the goal of obtaining a sustainable solution; a solution that meets both the needs of people and all specific context constraints with regard to the planet and prosperity.\r\n\r\nProvides information on the current consensus on sustainable development for four context levels: Planet, Society, Business and Engineers\r\nOffers guidelines for analyzing problems and identifying the best solution for each problem as applicable to a specific situation\r\nProvides clear design procedures for implementation of a particular solution\r\nHelps engineers to come up with profitable designs which meet environmental constraints\r\nPresents the information that engineers need to meet energy, water, food, health, and other basic human needs","torrent":{"xt":"urn:btih:6a56205bfdb64b45fc9c4c6942cba31474887863","amp;dn":"Engineering+for+Sustainability+-+A+Practical+Guide+for+Sustainab","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6a56205bfdb64b45fc9c4c6942cba31474887863","infoHashBuffer":{"type":"Buffer","data":[106,86,32,91,253,182,75,69,252,156,76,105,66,203,163,20,116,136,120,99]},"announce":[],"urlList":[]}}