{"title":"MST3K Godzilla vs Megalon DVD - Untouched, out of print","uid":10024127,"size":4057958400,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:6ad8db17ac76619d23705d3fd1020fcbd2e9f100&amp;dn=MST3K+Godzilla+vs+Megalon+DVD+-+Untouched%2C+out+of+print&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Zoticus","files":18,"time":1398247246,"description":"Finally finally FINALLY, here it is, the hard-to-find DVD release of Mystery Science Theater 3000's riffing of Godzilla vs. Megalon. This is one of the absolute hardest DVD episodes of MST3K to find, because it is one of the ONLY episodes to have been released and then later recalled.\n\nThe episode originally was released on Volume 10 of the MST3K collection, but then Volume 10 was discontinued and a &quot;Volume 10.2&quot; was released soon after, with this movie replaced with another (Giant Gila Monster). There's never been any official word as to why, but at the time Toho, the company that 100% for sure owns the rights to Godzilla, was shutting down a lot of releases of other Godzilla movies by companies that thought they had the rights, but actually didn't.  It's widely believed that whoever sold Best Brains the version of Godzilla vs Megalon used in this episode was one of those &quot;quasi-legal&quot; companies.\n\n\nThis is an UNTOUCHED COPY of the original NTSC DVD.  The only changes made were CSS/copy protection removal.  Everything else is as-is with no alterations.  This is as close to a master copy as you can probably find anywhere.","torrent":{"xt":"urn:btih:6ad8db17ac76619d23705d3fd1020fcbd2e9f100","amp;dn":"MST3K+Godzilla+vs+Megalon+DVD+-+Untouched%2C+out+of+print","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6ad8db17ac76619d23705d3fd1020fcbd2e9f100","infoHashBuffer":{"type":"Buffer","data":[106,216,219,23,172,118,97,157,35,112,93,63,209,2,15,203,210,233,241,0]},"announce":[],"urlList":[]}}