{"title":"Nixon In China Nonsuch DVD thac0","uid":8313536,"size":4681428992,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:6af566154f18b82588923401a078df380356706f&amp;dn=Nixon+In+China+Nonsuch+DVD+thac0&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"adnd2e","files":1,"time":1364529643,"description":"Nixon in China is an opera in three acts by John Adams, with a libretto by Alice Goodman. Adams' first opera, it was inspired by U.S. President Richard Nixon's visit to China in 1972. The work premiered at the Houston Grand Opera on October 22, 1987, in a production by Peter Sellars with choreography by Mark Morris. When Sellars approached Adams with the idea for the opera in 1985, Adams was initially reluctant, but eventually decided that the work could be a study in how myths come to be, and accepted the project. Goodman's libretto was the result of considerable research into Nixon's visit, though she disregarded most sources published after 1972.\n\nTo create the sounds he sought, Adams augmented the orchestra with a large saxophone section, additional percussion, and electronic synthesizer. Although sometimes described as &quot;minimalist&quot;, the score displays a variety of musical styles, embracing minimalism after the manner of Philip Glass alongside passages echoing 19th-century composers such as Wagner and Johann Strauss. With these ingredients, Adams mixes Stravinskian 20th-century neoclassicism, jazz references, and big band sounds reminiscent of Nixon's youth in the 1930s. The combination of these elements varies frequently, to reflect changes in the onstage action.\n\nFollowing the 1987 premiere, the opera received mixed reviews; some critics dismissed the work, predicting it would soon vanish. However, it has been presented on many occasions since, in both Europe and North America, and has been recorded twice. In 2011, the opera received its Metropolitan Opera debut, a production based on the original sets, and in the same year was given an abstract production in Toronto by the Canadian Opera Company. Recent critical opinion has tended to recognize the work as a significant and lasting contribution to American opera.","torrent":{"xt":"urn:btih:6af566154f18b82588923401a078df380356706f","amp;dn":"Nixon+In+China+Nonsuch+DVD+thac0","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6af566154f18b82588923401a078df380356706f","infoHashBuffer":{"type":"Buffer","data":[106,245,102,21,79,24,184,37,136,146,52,1,160,120,223,56,3,86,112,111]},"announce":[],"urlList":[]}}