{"title":"Guess Who's Coming to Dinner (Spencer Tracy, Katharine Hepburn)","uid":7025864,"size":733818880,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:6b5685ead396ffcc6ec388f0f7ab39b00aac9337&amp;dn=Guess+Who%5C%27s+Coming+to+Dinner+%28Spencer+Tracy%2C+Katharine+Hepburn%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"alien99","files":-1,"time":1328998127,"description":"A great movie then and now    when movies where fun\n\nby all means no high quality here but maybe some day they'll make a better one\nfor a great movie\n\nStoryline\n\nJoey Drayton brings her fiancÃƒÂ©, Dr. John Prentice, home to sunny San Francisco to meet her affluent parents. Their liberal persuasions are now put to the test, for although the young man is an ideal choice (he's highly and internationally respected in the medical field, and he's impeccably mannered, handsome, well dressed and of a respectable California family), he's black. The film, which covers one busy day in the Drayton home, is essentially a drawing-room comedy, a series of cross-conversations between the young doctor and the girl's parents, and finally between all sets of parents and offspring. A simple dinner is extended to include the doctor's parents, who fly up from Los Angeles for the evening, and the crusty but benevolent old Irish priest, a friend of the family. Thus, the title of the film . \n\nUser review\n\nAlthough made in 1967, I was surprised how much I loved this movie, from the beginning to the end. This is a kind of a comedy I haven't seen maybe for years.\n\nI felt the characters and the situation so alive and close to me, it is incredible. It remembered me when I had to make that first visit at a girlfriends house, meet the parents, be friendly to some completely unknown people, act as an adult, as a man, when there are four parents around... And there are scenes with a flip I will never forget, like Spencer Tracy eating his ice cream and changing his mind over it, Hilary being fired or the two fathers settling about the situation as 'the only reasonable people in the boat'.\n\nThe film also started me to think over how I would react as a parent in such a situation. Today, marriage between races is not that shocking, but I can easily imagine for my future daughter someone, who would shock me with his proposal. It easy to see others on screen struggling to break down their own walls and prejudices, but in real life it is so much harder. It is so true, what Mahatma Ghandi said - 'You must be the change you wish to see in the world'.\n\nIt's just a funny twist from life, that I've seen 'Kinsey' a few days ago, where Katharine Houghton also appears as Mrs. Spaulding, almost 40 years later (2005).\n\nThis movie became one of my favorites - 10/10. ","torrent":{"xt":"urn:btih:6b5685ead396ffcc6ec388f0f7ab39b00aac9337","amp;dn":"Guess+Who%5C%27s+Coming+to+Dinner+%28Spencer+Tracy%2C+Katharine+Hepburn%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6b5685ead396ffcc6ec388f0f7ab39b00aac9337","infoHashBuffer":{"type":"Buffer","data":[107,86,133,234,211,150,255,204,110,195,136,240,247,171,57,176,10,172,147,55]},"announce":[],"urlList":[]}}