{"title":"Chuck Brodsky - Last of the Old Time [2000][EAC,log,cue. FLAC]","uid":8925376,"size":290624235,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:6cbe98466e10f2ff1b6c727132982a4e9fa76837&amp;dn=Chuck+Brodsky+-+Last+of+the+Old+Time+%5B2000%5D%5BEAC%2Clog%2Ccue.+FLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dickspic","files":13,"time":1379353160,"description":"Artist:Chuck Brodsky\nRelease:Last of the Old Time\nReleased: 2000\nLabel: Red House Records\nCatalog#: RHR CD 141\nFormat: FLAC / Lossless / Log (100%) / Cue\nCountry: USA\nStyle: folk\n\n\n1. Take It Out Back (3:11)\n2. Boys in the Back Room (3:48)\n3. Gone to Heaven (5:30)\n4. He Came to Our Town (3:43)\n5. In the Country (2:56)\n6. 3rd Dead Cat (4:05)\n7. Restless Kid (4:06)\n8. Bonehead Merkle (4:35)\n9. How Beautiful She Looks (3:16)\n10. Schmoozing (4:59)\n11. 40 Years (3:17)\n\nChuck Brodsky retains his usual sharp wit and his usual interests on his fourth album, Last of the Old Time. He sings in a friendly wheeze over easy-rolling folk-country arrangements played by a sympathetic band of pickers. His familiar folk-based melodies are simple and rudimentary, and the entire musical effort wouldn't count for much on its own if it didn't act to support all those clever words. Brodsky is very much a student of Bob Dylan, who earns a name check in &quot;He Came to Our Town&quot; and is nearly quoted in &quot;40 Years.&quot; But Brodsky has his own viewpoint, one that he expresses in broad, sarcastic humor that has no room for subtlety. &quot;Take It out Back,&quot; the leadoff track, presents a rural approach to garbage disposal that is all too accurate, but it displays a light touch compared with the following song, &quot;The Boys in the Back Room,&quot; an indictment of governmental corruption that pulls no punches. Brodsky is equally critical of politicians in &quot;He Came to Our Town,&quot; and, no surprise, expresses extreme disapproval of &quot;Schmoozing.&quot; But, as anyone who has heard him before knows, as much as he despises political hypocrisy, he loves baseball to distraction, and there are two more examples of that devotion, &quot;Gone to Heaven,&quot; a biography of &quot;The Clown Prince of Baseball,&quot; Max Patkin, and a complete account of the notorious game between the New York Giants and the Chicago Cubs in 1908 that birthed the legend of &quot;Bonehead Merkle.&quot; The affectionate country humor of &quot;Take It out Back&quot; is repeated in the generalized observations of &quot;In the Country&quot; and in the specific -- and absurd -- customized directions of &quot;3rd Dead Cat&quot; (&quot;It's just past the third dead cat/Just past the one that's especially flat&quot;). In such songs, the comedy is as reminiscent of Mark Twain as of the early Dylan, and just as welcome.","torrent":{"xt":"urn:btih:6cbe98466e10f2ff1b6c727132982a4e9fa76837","amp;dn":"Chuck+Brodsky+-+Last+of+the+Old+Time+%5B2000%5D%5BEAC%2Clog%2Ccue.+FLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6cbe98466e10f2ff1b6c727132982a4e9fa76837","infoHashBuffer":{"type":"Buffer","data":[108,190,152,70,110,16,242,255,27,108,114,113,50,152,42,78,159,167,104,55]},"announce":[],"urlList":[]}}