{"title":"Pacific Rim (2013) Supplements (Rus, Eng SDH Subs) BDRip 720p","uid":9216448,"size":2249835869,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:6cee39e0dc930784acb194f9ec9cf7cf908e5f7a&amp;dn=Pacific+Rim+%282013%29+Supplements+%28Rus%2C+Eng+SDH+Subs%29+BDRip+720p&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ivannap","files":6,"time":1384822082,"description":"\nFocus Points (Disc 1, HD, 62 minutes): Further exploring Pacific Rim are thirteen Focus Point featurettes, available individually or with a Play All icon/option. Far more candid than typical promotional EPKs, del Toro's Focus Points reveal the passion, obsession and commitment of the director and his production team and cast while delving into the amazing detail and design that went into each element and scene. Featurettes include:\n\n    A Film by Guillermo del Toro (4:47)\n    A Primer on Kaijus &amp; Jaegers (4:09)\n    Intricacy of Robot Design (4:53)\n    Honoring the Kaiju Tradition (4:30)\n    The Importance of Mass and Scale (5:45)\n    Shatterdome Ranger Roll Call (5:39)\n    Jaegers Echo Human Grace (4:01)\n    Inside the Drift (4:36)\n    Goth-Tech (4:39)\n    Mega Sized Sets (8:54)\n    Baby Kaiju Set Visit (3:07)\n    Tokyo Alley Set Visit (3:17)\n    Orchestral Sounds from the Anteverse (4:04)\n\nThe Director's Notebook (Disc 2, HD): An interactive presentation of del Toro's Pacific Rim notebook. Clickable pages access interview pods, image scans and notes created during the film's pre-production. Also featured is a Magnify Mode that translates the director's Spanish text and activates exclusive galleries. The interface is a bit cumbersome and overdone, but the six video featurettes contained within are well worth watching. If nothing else, scan through the pages for the corresponding video icons and enjoy the additional Focus Points.\nThe Digital Artistry of Pacific Rim (Disc 2, HD, 17 minutes): From the mind of the director to ILM's computer-generated Jaegers, Kaiju and devastated cityscapes, track the creative process behind the film's visual effects. The best bits involve behind the scenes footage of del Toro explaining his vision to the FX crew.\n\nThe Shatterdome (Disc 2, HD): Welcome to the Shatterdome, an archive of the film's key design art. Video and still galleries offer a streamlined, manageable presentation of the assets created during the three phases of production. Video pods include exclusive looks at never before seen animatics, maquettes and concept art.\n\nDeleted Scenes (Disc 2, HD, 4 minutes): Four decent but brief deleted and extended scenes are available: &quot;The Wall of Life/Rations,&quot; &quot;Excuse Me,&quot; &quot;Theft&quot; and &quot;Catch You in the Drift, Dad.&quot;\n\nDrift Space (Disc 2, HD, 5 minutes): A breakdown of the film's four Drift sequences.\n\nBlooper Reel (Disc 2, HD, 4 minutes): Outtakes, mainly by way of Charlie Day and Ron Perlman.","torrent":{"xt":"urn:btih:6cee39e0dc930784acb194f9ec9cf7cf908e5f7a","amp;dn":"Pacific+Rim+%282013%29+Supplements+%28Rus%2C+Eng+SDH+Subs%29+BDRip+720p","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6cee39e0dc930784acb194f9ec9cf7cf908e5f7a","infoHashBuffer":{"type":"Buffer","data":[108,238,57,224,220,147,7,132,172,177,148,249,236,156,247,207,144,142,95,122]},"announce":[],"urlList":[]}}