{"title":"WORLD WAR HULK - FL","uid":7487686,"size":1082147479,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:6d12a7962fb00f44a5ff6c19800b3dec5bcaf387&amp;dn=WORLD+WAR+HULK+-+FL&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"my_friend_we007","files":-1,"time":1343645820,"description":"\n\nPlanet Hulk\n&quot;Planet Hulk&quot; is a Marvel Comics storyline that ran primarily through issues of The Incredible Hulk started in 2006.\nIt dealt primarily with the Marvel heroes' decision to send the Hulk away, his acclimation to and conquest of the\nplanet where he landed, and his efforts to return to Earth to take his revenge.\nThere was also a special Planet Hulk: Gladiator Guidebook publication by Anthony Flamini and the storyline's main writer Greg Pak,\nsimilar to the Official Handbook of the Marvel Universe detailing the characters, races and cultures within the storyline.\n\n\nWorld War Hulk\n\nWhen the Illuminati sent the Hulk to the planet Sakaar, his anger fueled his desire to survive and return to Earth and seek revenge.\nEventually he learned to enjoy his time on Sakaar and bonded with those whom he would call friends, even making a sacred pact with them as Warbound.\nLeading a rebellion against the Red KingÂ’s army, the Hulk overthrows the Red King as ruler of Sakaar.\nTaking Caiera as his queen, the Hulk finally finds acceptance and is at peace.\nThat is until the warp core of the spaceship that brought the Hulk to Sakaar explodes, nearly destroying the entire planet and killing his queen and their unborn child.\nDistraught with no fight left in him, the Hulk is ready to give up all hope.\nThat is until the Warbound remind him that he has something to live forÂ… vengeance!\nNow on his way back to Earth the Hulk prepares for war with the planet he once called home and nothing will stop him from seeking revenge on those that murdered his family.\nFilled with anger, Hulk only has two classic words on his mind intended for the Illuminati\n\nWWH-Aftersmash\n\nThe Warbound featured in their own miniseries, entitled World War Hulk Aftersmash: Warbound, in which the Warbound evaded S.H.I.E.L.D. capture only to be teleported\nto New Mexico by the Leader, who used Hiroim's tectonic power to activate a Gamma-powered shield over a large portion of the desert. They were being chased by S.H.I.E.L.D,\nusing information given by an incapacitated and incarcerated Miek to Shield Agent Kate Waynesboro. Trapped inside Gammaworld, the Warbound joined forces with a local\nUS Army company to save a nearby town from irradiated (and thus huge) insects, and began to feel the effects of the gamma radiation themselves.\nUsing Hiroim's Oldstrong power, the group managed to dispel some of the radiation, opening a gap in the Gammaworld dome through which the civilians could escape.\nHowever, they were interrupted by the arrival of a huge, gamma-powered gestalt being composed of numerous townsfolk and a dog fused together by the radiation.\nThe creature, known as Horde, attempted to destroy everyone who tried to leave, but was fended off by Agent Waynesboro. As the Warbound attacked the Leader,\nHiroim told Korg to kill him in order to destroy the dome. Korg shattered Hiroim and the dome dissipated; however Hiroim reformed, as did the dome.\nThe group were then attacked by S.H.I.E.L.D. sentry robots, which had been placed under the Leader's control. In the ensuing battle, Elloe stabbed the Leader in the chest.\nThe Leader then absorbed the Dome's power, turning into a gray skinned giant. Hiroim stopped him, killing himself in the process. Before dying, he passed on his\nOldstrong power to Kate, who protected the remaining people from an attacking monster.","torrent":{"xt":"urn:btih:6d12a7962fb00f44a5ff6c19800b3dec5bcaf387","amp;dn":"WORLD+WAR+HULK+-+FL","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6d12a7962fb00f44a5ff6c19800b3dec5bcaf387","infoHashBuffer":{"type":"Buffer","data":[109,18,167,150,47,176,15,68,165,255,108,25,128,11,61,236,91,202,243,135]},"announce":[],"urlList":[]}}