{"title":"Missing Persons - I Can't Think About Dancin' [promo].VOB","uid":9587650,"size":304480256,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:6dcae5b7f17f913edac6e61dff822abc3bdda8da&amp;dn=Missing+Persons+-+I+Can%27t+Think+About+Dancin%27+%5Bpromo%5D.VOB&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"SgtRlee","files":-1,"time":1391841373,"description":"Missing Persons - I Can't Think About Dancin' [promo].VOB\n\n\nHQ very rare promo music video from a promo DVD.  &quot;I Can't Think About Dancin'&quot; is a song from  Color in Your Life, the third and final album by American new wave band Missing Persons, released in 1986 \n\nMissing Persons is an American band that plays a blend of New Wave and pop rock. The band was founded in 1980 in Los Angeles by guitarist Warren Cuccurullo, vocalist Dale Bozzio, and drummer Terry Bozzio. They went on to add bassist Patrick O'Hearn and keyboardist Chuck Wild.\n\nDale and Terry Bozzio met while working with Frank Zappa, and they married in 1979. Cuccurullo encountered the pair while contributing to the Zappa album Joe's Garage. O'Hearn was also a former member of Zappa's touring band, and Wild had played with a variety of bands before joining.\n\nIn 1980 the band made its first record, a 4-song EP entitled Missing Persons, in Zappa's brand-new Utility Muffin Research Kitchen studios; the recording was financed by Cuccurullo's father. The band toured, promoted the EP, appeared in the movie Lunch Wagon, and became a must-see band among the Los Angeles live music crowd. &quot;Mental Hopscotch&quot; was a No. 1 record on local radio station KROQ-FM, and the self-promoted EP sold 7,000 copies.\n\nTwo years of hard work led up to a signing with Capitol Records in 1982. With label support, the re-released EP sold another 250,000 units, and the new full-length album Spring Session M (an anagram of &quot;Missing Persons&quot;) went gold.\n\nThe singles &quot;Mental Hopscotch&quot;, &quot;Surrender Your Heart&quot; (1984), &quot;Destination Unknown,&quot; &quot;Words,&quot; &quot;Walking in L.A.,&quot; and &quot;Windows&quot; met with varying success, especially in the local markets of Los Angeles, New York, and San Francisco. The visual effects used in the music video for &quot;Words&quot; were unusual for the time, making it popular on the fledgling cable TV channel MTV.\n\nMissing Persons appeared at a three-day Southern California concert known as the US Festival in May 1983, along with Berlin, David Bowie, The Pretenders, U2, and other performers.\n\nDale's quirky voice and heavy makeup made the band a favorite on MTV in the early 1980s. Her revealing outfits played a pivotal role in moving the culture of music videos towards that of overt sexual exhibitionism.\n(video does not have any logos)\n\n\n    &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Color_in_Your_Life&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Color_in_Your_Life&lt;/a&gt; \n      &lt;a href=&quot;\nhttp://bayimg.com/caIdJaafC&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/caIdJaafC&lt;/a&gt; \n   \n\n\nFile properties info using Media Player Classic: \n   Video: MPEG2 Video 720x480 (4:3) 29.97fps 8000kbps\n   Audio: LPCM 48000Hz stereo 1536kbps [DVD, 16 bit]\n   Duration: 00:04:12\n\n\n\n\n*Install the &quot;Media Player Classic&quot; player if you can't play this file, \nor for better visual and audio quality playback of all your videos. \nIt's 100% free to download and use. Latest stable build is v1.7.3\n\n\n*Media Player Classic Home Cinema*  &lt;a href=&quot;\nhttp://mpc-hc.sourceforge.net/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://mpc-hc.sourceforge.net/&lt;/a&gt; \n\n\nSgtRlee (Sgt.R.Lee) \n\t","torrent":{"xt":"urn:btih:6dcae5b7f17f913edac6e61dff822abc3bdda8da","amp;dn":"Missing+Persons+-+I+Can%27t+Think+About+Dancin%27+%5Bpromo%5D.VOB","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6dcae5b7f17f913edac6e61dff822abc3bdda8da","infoHashBuffer":{"type":"Buffer","data":[109,202,229,183,241,127,145,62,218,198,230,29,255,130,42,188,59,221,168,218]},"announce":[],"urlList":[]}}