{"title":"Oblivion - HD Bluray Rip X264 English - AC3 Audio (2013)","uid":8887233,"size":3805213889,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:7013eca8ddb7b0310772d81257c14672c8d23db4&amp;dn=Oblivion+-+HD+Bluray+Rip+X264+English+-+AC3+Audio+%282013%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"KidAtomic","files":-1,"time":1378490247,"description":"Oblivion - Very High Quality HD Bluray Rip X264 English - AC3 Audio with English subtitles. (2013)\n\n2077: Jack Harper (Cruise) serves as a security repairmen stationed on an evacuated Earth. Part of a massive operation to extract vital resources after decades of war with a terrifying alien threat who still scavenges what's left of our planet, Jack's mission is almost complete. In a matter of two weeks, he will join the remaining survivors on a lunar colony far from the war-torn world he has long called home.\n\nLiving in and patrolling the breathtaking skies from thousands of feet above, Jack's soaring existence is brought crashing down after he rescues a beautiful stranger from a downed spacecraft. Drawn to Jack through a connection that transcends logic, her arrival triggers a chain of events that forces him to question everything he thought he knew. With a reality that is shattered as he discovers shocking truths that connect him to Earth of the past, Jack will be pushed to a heroism he didn't know he contained within. The fate of humanity now rests solely in the hands of a man who believed our world was soon to be lost forever.\n\nA veteran assigned to extract Earth's remaining resources begins to question what he knows about his mission and himself.\n\nDirector:\nJoseph Kosinski\n\nWriters:\nKarl Gajdusek (screenplay), Michael Arndt (screenplay), 1 more credit Â»\n\nStars:\nTom Cruise, Morgan Freeman, Andrea Riseborough ","torrent":{"xt":"urn:btih:7013eca8ddb7b0310772d81257c14672c8d23db4","amp;dn":"Oblivion+-+HD+Bluray+Rip+X264+English+-+AC3+Audio+%282013%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7013eca8ddb7b0310772d81257c14672c8d23db4","infoHashBuffer":{"type":"Buffer","data":[112,19,236,168,221,183,176,49,7,114,216,18,87,193,70,114,200,210,61,180]},"announce":[],"urlList":[]}}