{"title":"Green Hornet (001 - 042 &amp; extras) (2010 - 2013) (complete) (","uid":9248710,"size":1265293104,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:710f554215370ff7903b7c4765a8a2770c630957&amp;dn=Green+Hornet+%28001+-+042+%26amp%3B+extras%29+%282010+-+2013%29+%28complete%29+%28&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"nemesis43","files":46,"time":1385424766,"description":"Green Hornet is a comic book series from Dynamite that revamps the classic character for a modern day audience.\n\nAfter the murder of his father, Britt Reid finds himself thrust into a world that his father kept hidden for his entire life. Assisted by Kato's daughter Mulan as the &quot;new Kato&quot; and gadget-guru/all-around mechanic Clutch, Britt must try to juggle running The Sentinel while also fighting crime. Can Britt hold up to the responsibilities that his father left behind?\n\nThe series was originally intended to only be a 12-issue limited series with Kevin Smith writing all of the issues. As the run continued, Smith's availability started becoming shaky, as his other comic obligations ( Batman: The Widening Gyre) and film endeavors ( Red State) began taking up more time. Strong sales for the series made Dynamite decide to turn the series into an ongoing run. Kevin Smith did the writing for the first ten issues, while Phil Hester picked up on Green Hornet #11. Just as well, Alex Ross' covers and Jonathan Lau's artwork have become synonymous with the series.\n\nThe title was changed to Green Hornet: Legacy at issue #34, probably due to the release of a new Green Hornet series at the same time featuring the original Britt Reid as the Hornet.","torrent":{"xt":"urn:btih:710f554215370ff7903b7c4765a8a2770c630957","amp;dn":"Green+Hornet+%28001+-+042+%26amp%3B+extras%29+%282010+-+2013%29+%28complete%29+%28","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"710f554215370ff7903b7c4765a8a2770c630957","infoHashBuffer":{"type":"Buffer","data":[113,15,85,66,21,55,15,247,144,59,124,71,101,168,162,119,12,99,9,87]},"announce":[],"urlList":[]}}