{"title":"Seven Pounds DVDRip ( A Commission-kvcd by empire)","uid":4727750,"size":841396302,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:715bf7d46c6a3c350ee198e6c9428e15194b71f6&amp;dn=Seven+Pounds+DVDRip+%28+A+Commission-kvcd+by+empire%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"porno6","files":4,"time":1234836774,"description":"Seven Pounds Dvdrip(A Commission-kvcd by empire)\n\n\n\nstory : Once, Tim Thomas (Will Smith) was a gifted aerospace engineer with a beautiful wife and a lovely beach house. Then, while using his cell phone while driving, his car wandered across lanes and he became responsible for the deaths of 7 others, including his beloved wife. Unable to forgive himself or raise the dead, Tim sets out to give &quot;pounds of flesh&quot; that will give new life to seven deserving individuals to make up for the seven lives he destroyed. Just as Antonio would have to die to pay Shylock the &quot;pound of flesh&quot; he demands, Tim intends to kill himself to atone for his sins. His brother Ben (Michael Ealy), who works for the IRS, is deeply concerned about his state of mind. Tim steals his brother's IRS ID to access the IRS database and to find and meet people who he believes worthy of his gifts which includes body organs and material possessions. Holly Apelgren (Judyann Elder), Ezra Turner (Woody Harrelson), Connie Tepos (Elpidia Carrillo) and Emily Posa (Rosario Dawson) are among those whom he identifies to help. Furthermore, Tim assumes his brother's identity of &quot;Ben Thomas&quot; to personally investigate these people and verify that they are indeed the right people he should help. He has a plan for when he identifies his 7 beneficiaries that requires his best friend Dan (Barry Pepper) to see that his wishes are carried out after he is dead. Tim's plan threatens to unravel when he begins to fall in love with one of the people he is trying to help.\n\nWe are looking for encoders  www.the-commission.com  www.reputation-resource.com\n\nas we are a good group of guys just out to have funn and share our ways :D","torrent":{"xt":"urn:btih:715bf7d46c6a3c350ee198e6c9428e15194b71f6","amp;dn":"Seven+Pounds+DVDRip+%28+A+Commission-kvcd+by+empire%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"715bf7d46c6a3c350ee198e6c9428e15194b71f6","infoHashBuffer":{"type":"Buffer","data":[113,91,247,212,108,106,60,53,14,225,152,230,201,66,142,21,25,75,113,246]},"announce":[],"urlList":[]}}