{"title":"The Most Evil Men/Women In History","uid":4196804,"size":2432106137,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:71842c00982c05b75039039a52c13f0ce6ce4ee8&amp;dn=The+Most+Evil+Men%2FWomen+In+History&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":3,"uploader":"cooolway","files":17,"time":1211272608,"description":"It took me a year to get the whole collection so please, comment on this release.\n\nThis series of programme scrutinises some of the most infamous figures in world history and the lives they led.\n\nSpecification\nVideo\nFormat : AVI\nCodec : XviD\nBit rate : 682 Kbps\nWidth : 684 pixels\nHeight : 386 pixels\nDisplay Aspect ratio : 16/9\nFrame rate : 23.976 fps\nInterlacement : Progressive\n\nAudio\nCodec : MPEG-1 Audio layer 3\nBit rate : 190 Kbps\nBit rate mode : CBR\nChannel(s) : 2 channels\nSampling rate : 48 KHz\nResolution : 16 bits\n\n\n\n\nThe Most Evil Men in History - Torquemada\nTorquemada tortured &amp; burned thousands of innocent Spaniards &amp; expelled Spains Jewish population. ?The Hammer of the Heretics? ?The Black Legend? Thomas De Torquemada was head of the Spanish inquisition and was renowned for his cruelty. As well as the atrocities of the inquisition his hatred and persecution of Spains Jews has been described as a mini-holocaust.\n\nThe Most Evil Men in History - Francisco Pizarro\nFrancisco Pizarro was one of the European explorers who went to South America to colonize it and had natives murdered so he could plunder their &quot;gold and silver.&quot;Pizarro and his men arrived at Cajamarca (in 1533), where they captured Atahuallpa, the 13th and last emperor of the Incas. Atahuallpa had just won a civil war against his half-brother (Hu?scar), and had executed Hu?scar and his family. Atahuallpa had invited Pizarro to a celebratory feast, thinking that the Spanish were not much of a threat. Pizarro ambushed Atahuallpa and killed thousands of his men. Atahuallpa offered a huge ransom for his own release, but Pizarro took the treasure and had Atahuallpa strangled on Aug. 29, 1533; this was the end of the Incan empire. After looting and generally destroying the Incan capital of Cusco, Pizarro founded Lima. Pizarro was assassinated in Lima, Peru, in 1541, by followers of Pedro de Almagro (Cortes&amp;#039; captain) who wanted to seize Lima for its riches.\n\nThe Most Evil Men in History - Caligula\nThe Roman emperor&amp;#039;s reign is a legendary frenzy of lunacy, murder, and perverse sexuality.\n\nThe Most Evil Men in History - Hitler\nAdolf Hitler tried to mould Germany and a large portion of the 20th century into his own twisted design.\n\nThe Most Evil Men in History - Pol Pot\nResponsible for the Killing Fields and Year Zero Pol Pot waged a gruesome war on his own population.\n\nThe Most Evil Men in History - Nero\nHe brought the entire Roman Empire to the brink of Collapse with his legendary excess &amp; cruelty.\n\nThe Most Evil Men in History - Idi Amin\nIdi Amin rose to become a brutal &amp; utterly ruthless Dictator who comitted atrocities on his people.\n\nThe Most Evil Men in History - Joseph Stalin\nPerhaps 7 million or more were shot with a total suppression of about 50 million under uncle Joe Stalin.\n\nThe Most Evil Men in History - Attila The Hun\nAttila was Khan of the Huns. He is remembered as the epitome of cruelty and rapacity.He passed unhindered through Austria and Germany, across the Rhine into Gaul, plundering and devastating all in his path with a ferocity unparalleled in the records of barbarian invasions and compelling those he overcame to augment his mighty army.\n\nThe Most Evil Men in History - Rasputin\nHe was an uneducated peasant who gained a reputation as a faith healer. His strange behavior and incredible influence over the imperial family made him notorious his death made him a legend. Gregory Rasputin dominated the final years of imperial Russia. The mysterious monk who enjoyed the favor of the Czar was rumored to be a Holy Devil, who preached the word of God but practiced every form of corruption.\n\nThe Most Evil Men in History - Vlad the Impaler\nVlad is best known for the legends of the exceedingly cruel punishments he imposed during his reign and for serving as the primary inspiration for the vampire main character in Bram Stoker?s popular Dracula novel.\n\nThe Most Evil Men in History - Ivan the Terrible\nIvan IV of Russia, also know as Ivan the Terrible, was the Grand Duke of Muscovy from 1533 to 1547 and was the first ruler of Russia to assume the title of Tsar. With his orders, between 500 and 1000 people were gathered every day by the troops, then tortured and killed in front of Ivan and his son. In 1581, Ivan beat his pregnant daughter-in-law for wearing immodest clothing, causing a miscarriage. His son, also named Ivan, upon learning of this, engaged in a heated argument with his father, which resulted in Ivan striking his son in the head with his pointed staff, causing his son?s (accidental) death.\n\nThe Most Evil Men in History - Bad King John\nHe murdered his nephew, inspired the legend of Robin Hood &amp; caused the creation of Magna Carta.\n\nThe Most Evil Women in History - Bloody Mary Tudor\nMary was the only child of Henry VIII and Catherine of Aragon to live past infancy. By her orders, many prominent Protestants were burned alive for their beliefs leading to the moniker ?Bloody Mary?. Fearing the gallows a further 800 Protestants left the country, unable to return until her death.\n\nThe Most Evil Women in History - lse Koch\nDie Hexe von Buchenwald? the Witch of Buchenwald, or ?Buchenw?lder Schlampe? the Bitch of Buchenwald was the wife of Karl Koch, commandant of the concentration camps Buchenwald from 1937 to 1941, and Majdanek from 1941 to 1943. Drunk on the absolute power rendered by her husband, she reveled in torture and obscenity.\n\nThe Most Evil Women in History - Countess Dracula\nCountess Elizabeth Bathory is considered the most infamous serial killer in Hungarian/Slovak history. Rumors had circulated for years about missing peasant girls; offered well paid work at the castle, they were never seen again.","torrent":{"xt":"urn:btih:71842c00982c05b75039039a52c13f0ce6ce4ee8","amp;dn":"The+Most+Evil+Men%2FWomen+In+History","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"71842c00982c05b75039039a52c13f0ce6ce4ee8","infoHashBuffer":{"type":"Buffer","data":[113,132,44,0,152,44,5,183,80,57,3,154,82,193,63,12,230,206,78,232]},"announce":[],"urlList":[]}}