{"title":"A Guide to the World Bank, Second Edition","uid":8260032,"size":4713084,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:71a200873c7d732584a09a0e0fcfe0afc0905c2b&amp;dn=A+Guide+to+the+World+Bank%2C+Second+Edition&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"mdusanjay","files":-1,"time":1363362139,"description":"World Bank, &quot;A Guide to the World Bank, Second Edition&quot;\nEnglish | 2007-06-19 | ISBN: 0821366947 | 268 pages | PDF | 4.5 mb\n\nThe World Bank Group is a vital source of financial and technical assistance to developing countries around the world. Its focus is on helping the poorest people in the poorest countries by using its financial resources, staff, and extensive experience to aid countries in reducing poverty, increasing economic growth, and improving quality of life. In partnership with more than 100 developing countries, the Bank Group is striving to improve health and education, fight corruption, boost agricultural support, build roads and ports, and protect the environment. Other projects are aimed at rebuilding war-torn countries or regions, providing basic services such as access to clean water, and encouraging investments that create jobs. In addition to this critical groundwork around the world, various parts of the World Bank Group are involved in activities ranging from conducting economic research and analysis to providing financial and advisory services to governments and private enterprises. These activities reflect the emphasis the institution places on sharing development knowledge, which is gleaned not only from decades of experience. This completely revised and updated second edition provides an accessible and straightforward overview of the World Bank Group's history, organization, mission, and purpose. Additionally, for those wishing to delve further into subjects of particular interest, the book guides readers to sources containing more detailed information, including annual reports, Web sites, publications, and e-mail addresses for various departments. It also provides information on how to work for or do business with the World Bank. A good introduction for anyone interested in understanding what the World Bank Group does and how it does it, this book shows readers who want to learn more where to begin.","torrent":{"xt":"urn:btih:71a200873c7d732584a09a0e0fcfe0afc0905c2b","amp;dn":"A+Guide+to+the+World+Bank%2C+Second+Edition","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"71a200873c7d732584a09a0e0fcfe0afc0905c2b","infoHashBuffer":{"type":"Buffer","data":[113,162,0,135,60,125,115,37,132,160,154,14,15,207,224,175,192,144,92,43]},"announce":[],"urlList":[]}}