{"title":"Stars 2.60i","uid":9515201,"size":5844301,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:71bfb1b9c092132f48bdf49cbfb39957a242f33f&amp;dn=Stars+2.60i&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Rafeweisz","files":57,"time":1390508426,"description":"The game was originally developed in 1995, with version 2.0 released early in 1996. Later that year the newsgroup rec.games.computer.stars became active, facilitating public discussion of tactics and allowing players to find new games. By the end of 1996 shareware version 2.60 had been released, and the game has remained essentially unchanged ever since, although there have been numerous updates. Version 2.70 is also available; version 2.70 is the retail version, whilst version 2.60 is the shareware version. The only difference between the versions is that the retail version has sounds during battles. The most recent patch version, 2.60j RC4 (release candidate 4) was released in December 2000. Versions 2.60 and 2.70 are compatible as long as the minor version letter is the same (e.g.: 2.60i can play with 2.70i players).\n\n-------------------------------------\n\nModes of play\n\nThe game is well adapted to the Play-By-Email (PBEM) style of multiplayer gaming. One player takes on duties as host, and the other players send their instructions (turn files) by email to the host. The host then generates the results of those instructions and emails back the results.\n\nAn alternative to play-by-email is to use an online system such as the Stars! AutoHost. This system automates most of the hosting duties, and can handle a large number of games simultaneously.\n\nMany games are run at a rate of 1 turn per calendar day, giving plenty of time for strategic thinking. In large games this can be quite necessary, with turn generation dropping to only 3 times per week in cases, due to the complexity of the game and the level of micro-management required to effectively control a large empire competitively.\n\nThere is also a reasonably competent artificial intelligence (AI) that can take part in the game. The player can opt to play against AIs only (up to 15 of them), and this is the way that new players typically get to learn the game mechanics before launching into multi-player games. A well-regarded tutorial helps with getting started.\n\nAnother style of play is referred to as a Blitz game. In these games, turns are played every 15 minutes or so, and all players must be at their computers at the same time. Blitz games are generally more tactical and less political in nature, due to the time constraints involved.\n\nRecently, the duel has become more popular. These are similar to regular turn-a-day games but are between two players only. Again, with only two players involved there is no political side to these games.\n\n-------------------------------------\n\nGraphics\n\nThe graphics in the game are rudimentary. It is entirely 2D, and the graphics consist of the main map view and static pictures of planets, ship hulls and components. Even battles consist of moving static icons around a grid. This has the advantage of allowing the game to run on almost any computer.\n\n-------------------------------------\n\nCompatibility\n\nStars can be run on most versions of Windows from Windows 3.1 up. It can even be run on Linux systems through the Wine system. However, under Wine, version 2.70 crashes during combat if combat sounds are enabled. Stars! does not run directly on the 64-bit version of Windows XP, Windows Vista or Windows 7, which cannot run 16-bit software. However, it can be played on a virtual machine like Virtual Windows XP on Windows 7, or in VirtualPC on earlier 64 bit versions of windows. Another alternative is VirtualBox.\n\n-------------------------------------\n\nGameplay\n\nStarting with a small fleet of ships and one or two planets, players develop their empire, meet other races and conquer the galaxy. Stars! games begin with race design, choosing one of 10 different primary racial traits, a selection of lesser racial traits, habitability, growth, economic and technology settings.\n\nPlayers initially send scouts out to scan for suitable planets which may be later colonized and developed, enlarging the player's empire and providing additional resources. As a player's empire expands the player must balance the management of population, minerals, research and ship/infrastructure constructions. When other players' races are encountered, a variety of diplomacy options allow for alliances, trading mineral resources or technology, large-scale wars, and even the complete destruction of other races. If the random events game option is enabled, players will also have to contend with (or take advantage of) the Mystery Trader, comet strikes, wormholes and environmental changes.\n\nBecause of the high level of micromanagement and diplomacy requirements many games take place over a period of months between players spread across the globe.","torrent":{"xt":"urn:btih:71bfb1b9c092132f48bdf49cbfb39957a242f33f","amp;dn":"Stars+2.60i","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"71bfb1b9c092132f48bdf49cbfb39957a242f33f","infoHashBuffer":{"type":"Buffer","data":[113,191,177,185,192,146,19,47,72,189,244,156,191,179,153,87,162,66,243,63]},"announce":[],"urlList":[]}}