{"title":"Fastball - Keep Your Wig On [2004]","uid":9690822,"size":296157176,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:72eb343118dc0f15f65374d9231f6642e0de18d6&amp;dn=Fastball+-+Keep+Your+Wig+On+%5B2004%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"GenXRock","files":-1,"time":1393860308,"description":"Review by Rick Anderson\nIn 1998, Fastball scored a hit single with &quot;The Way,&quot; which propelled its album All the Pain Money Can Buy to platinum sales. The resulting pressure proved too much for the Austin-based power pop trio, and they took a few years off before returning to the scene with this, their debut album for the respected Rykodisc label. The time off seems to have worked as a tonic; on Keep Your Wig On, Fastball's sound is tight, sharp, sometimes humorous, and always supremely well-crafted, despite the group's carefully cultivated garage sensibility. But then that's not really any significant departure for a band that has always placed far more value on musical pleasure than on hipness. There's certainly nothing hip about the soulful and Beatlesque &quot;I Get High&quot; (complete with prominent piano and 1960s-style vocal compression), the honky tonk strut and wry politics of &quot;Mercenary Girl,&quot; or the faintly Freedy Johnston-ish folk-rock of &quot;Perfect World.&quot; They even quote themselves, stylistically anyway, on the Latin-tinged &quot;Red Light,&quot; a song that harks back explicitly to that fateful hit single of six years ago. Derivativeness is easy to forgive -- to celebrate, even -- in a band that provides this much musical pleasure. (4/5)","torrent":{"xt":"urn:btih:72eb343118dc0f15f65374d9231f6642e0de18d6","amp;dn":"Fastball+-+Keep+Your+Wig+On+%5B2004%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"72eb343118dc0f15f65374d9231f6642e0de18d6","infoHashBuffer":{"type":"Buffer","data":[114,235,52,49,24,220,15,21,246,83,116,217,35,31,102,66,224,222,24,214]},"announce":[],"urlList":[]}}