{"title":"Advances in Fischer-Tropsch Synthesis, Catalysts, and Catalysis","uid":12072132,"size":9305994,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7350b03869f6016a31b8539b109a51b5d1019498&amp;dn=Advances+in+Fischer-Tropsch+Synthesis%2C+Catalysts%2C+and+Catalysis&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1435535723,"description":"Advances in Fischer-Tropsch Synthesis, Catalysts, and Catalysis (Chemical Industries Volume 128) (CRC, 2010).pdf\n\nISBN 978-1-4200-6256-4\n\nRising oil costs have stimulated significant interest in the Fischer-Tropsch synthesis (FTS) as a method for producing a synthetic petroleum substitute. Drawn from the proceedings at a symposium held during the 236th meeting of the American Chemical Society in Philadelphia in August 2008, Advances in Fischer-Tropsch Synthesis, Catalysts, and Catalysis explores the recent developments in Fischer-Tropsch technology, which holds great promise in the area of renewable resources.\n\nExpert contributors explore a range of issues\n\nThe book focuses on three main themes: catalyst preparation and activation, reaction mechanism, and process-related topics. A panel of expert contributors discusses synthesis of catalysts, carbon nanomaterials, nitric oxide calcinations, the influence of carbon, catalytic performance issues, chelating agents, and Cu and alkali promoters. They also explore Co/silica catalysts, thermodynamic control, the Two Alpha model, co-feeding experiments, internal diffusion limitations, Fe-LTFT selectivity, and the effect of co-fed water. Lastly, the book examines cross-flow filtration, kinetic studies, reduction of CO2 emissions, syncrude, and low-temperature water-gas shift.\n\nAttaining the maximum catalytic activity and catalyst life\n\nThe themes explored in the book demonstrate that while the Fischer-Tropsch synthesis (FTS) has advanced in maturity, many issues remain concerning the preparation of increasingly active catalysts and the method of activation to attain the maximum catalytic activity and catalyst life. The book includes coverage of the structural features, their changes, and the application of increasingly sophisticated characterization techniques, shedding light on the reaction mechanism and providing a glimpse into the processes and reaction rates under realistic commercial process conditions","torrent":{"xt":"urn:btih:7350b03869f6016a31b8539b109a51b5d1019498","amp;dn":"Advances+in+Fischer-Tropsch+Synthesis%2C+Catalysts%2C+and+Catalysis","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7350b03869f6016a31b8539b109a51b5d1019498","infoHashBuffer":{"type":"Buffer","data":[115,80,176,56,105,246,1,106,49,184,83,155,16,154,81,181,209,1,148,152]},"announce":[],"urlList":[]}}