{"title":"God Revelation Authority (6 Volumes) - Carl F H Henry (PDF)","uid":8694984,"size":12774635,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:74280505b221c723057dd5e8f5d4103dcd1e424e&amp;dn=God+Revelation+Authority+%286+Volumes%29+-+Carl+F+H+Henry+%28PDF%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"jeanbonno","files":1,"time":1373955576,"description":"God Revelation Authority (6 Volumes) - Carl F H Henry\n\nPDF\n\n\n&quot;God, Revelation and Authority by Carl Henry is one of the most important evangelical theological works of the twentieth century. Published between 1976 and 1983, it shaped the evangelical movement in countless ways and is still widely read, studied, and appreciated as a clear statement of evangelical beliefs contra liberalism and neo-orthodoxy.\n\nWhat you need to know is that God, Revelation and Authority is a key resource for understanding, teaching and defending many doctrines central to evangelicalism, including biblical inerrancy. It's no accident that the list of endorsers for these books reads like a Who's Who of evangelical Christianity.\n\nIf you want to have a better grasp of evangelical theology and its formation, there's no better place to begin than God, Revelation and Authority.\n\nCarl F. H. Henry was a central religious figure of the 20th century. In a 2004 article, Christianity Today stated that Carl Henry, along with Billy Graham and Boston pastor Harold John Ockenga, &quot;practically invented what later became known as evangelicalism.&quot; He also helped found and served as the first editor for Christianity Today.\n\nGod, Revelation and Authority is Henry's magnum opus. It contains the developed ideas of this prominent thinker on topics that include infallibility and inerrancy, divine revelation in nature, historical criticism, the Holy Spirit, the Church, and biblical history. It also includes the &quot;Chicago Statement on Biblical Inerrancy&quot; which for many years within evangelical circles has been an authoritative declaration regarding inerrancy.\n\nLater in life, Carl Henry spent a great deal of time considering the related concepts of religious knowledge and the doctrine of God. He concluded that, &quot;if we humans say anything authentic about God, we can do so only on the basis of divine self-revelation; all other God-talk is conjectural.&quot; This basic premise underlies the entirety of God, Revelation and Authority.\n\nAs you read God, Revelation and Authority you will see how many of the ideas in these six volumes have been enormously influential in shaping the beliefs and &quot;distinctives&quot; shared by evangelicals all over the world.&quot;","torrent":{"xt":"urn:btih:74280505b221c723057dd5e8f5d4103dcd1e424e","amp;dn":"God+Revelation+Authority+%286+Volumes%29+-+Carl+F+H+Henry+%28PDF%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"74280505b221c723057dd5e8f5d4103dcd1e424e","infoHashBuffer":{"type":"Buffer","data":[116,40,5,5,178,33,199,35,5,125,213,232,245,212,16,61,205,30,66,78]},"announce":[],"urlList":[]}}