{"title":"iuVCR: 4.12.0.375 (24/08/2006)","uid":3520193,"size":3284277,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:74af870d306c56a760a96aeb5cdc811dddf34343&amp;dn=iuVCR%3A+4.12.0.375+%2824%2F08%2F2006%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"envnort","files":1,"time":1157556239,"description":" &lt;a href=&quot;http://www.iulabs.com/iuvcr/download.shtml&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.iulabs.com/iuvcr/download.shtml&lt;/a&gt;\n\niuVCR is a Windows 2000/XP intended universal video recording program. Have a TV tuner or a video capture card installed on your Windows 2000 or XP system? Now you can easily record your favorite TV programs and videos in *.AVI or *.WMV format. iuVCR has got a simple and plain interface, allows to capture video of any format, resolution and duration, can automatically start when scheduled and has a number of other useful features.\n\nThere is a number of video capture programs in the world but the most of them work quite poorly in Windows 2000/XP, as a brand new multimedia technology called DirectShow is used there. The programs not using DirectShow give a rather middling result. iuVCR is a video recording DirectShow-based application. It uses the newest multimedia technologies developed by Microsoft corporation and ensures that you are getting the most from your video capture card.\n\nAs any DirectShow application, iuVCR allows to record *.AVI files of any size, overriding a file size limitation of 2GB inherent to old video capture programs. Using Windows 2000/XP and NTFS file system, you can record *.AVI files of size, limited only by your harddisk capacity. So, using iuVCR in conjunction with recommended hardware, you will be able to record with no frame loss long-lasting videos in any resolution with ease.\n\nRich filters set for realtime video processing:\n\n    * TimeStamp filter\n    * Motion detector filter\n    * Deinterlace filter\n    * Crop filter\n    * Histogram filter\n    * ImagePlus logo overlay filter by ECP-Soft company \n\nand others.\n\nSince version 4.8.5.335 the Alparysoft Deinterlace filter by Alparysoft R&amp;D company included into the native filters set.\n\nMain features of iuVCR:\n\n    * IEEE 1394 devices support.\n    * TV channels tuning.\n    * Video capturing with frame size up to 768x576.\n    * Arbitrary choice frame size.\n    * Microsoft Windows Media Format support and Windows Media Encoder integration.\n    * Matroska format support\n    * Video stream preview during capture without frame size limitations.\n    * Most settings autostored in system registry.\n    * Integration with Windows scheduler.\n    * Splitting captured video stream to several files.\n    * Continuous capturing across several disk partitions.\n    * API for third-party remote control applications.\n    * Support for DirectShow filters for realtime video processing. \n\nSystem requirements:\n\n    * Windows 2000 or Windows XP (Windows 98 and Windows ME also supported but not recommended).\n    * DirectX 7 or higher.\n    * Microsoft Windows Media Encoder if Windows Media Format is needed.\n    * Processor: Pentium II or higher (600Mhz PIII or higher recommended).\n    * 128Mb RAM.\n    * DirectX compatible sound card.\n    * DirectX compatible graphics adapter card.\n    * Video capture PCI card or IEEE-1394 controller with WDM-drivers installed (bt848/bt878-based cards recommended as a good tested device).\n    * Free HDD space: 2 Mb for program files; 0,05-60 Gb for video clips. A 7200rpm IDE harddrive and an UDMA66-UDMA100 IDE controller such as Promise or HotRod recommended","torrent":{"xt":"urn:btih:74af870d306c56a760a96aeb5cdc811dddf34343","amp;dn":"iuVCR%3A+4.12.0.375+%2824%2F08%2F2006%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"74af870d306c56a760a96aeb5cdc811dddf34343","infoHashBuffer":{"type":"Buffer","data":[116,175,135,13,48,108,86,167,96,169,106,235,92,220,129,29,221,243,67,67]},"announce":[],"urlList":[]}}