{"title":"Horace Silver - 2004 - The United States of Mind FLAC","uid":8403911,"size":790846070,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:755e990a2988f31710514c110e7ef06cb006ab6f&amp;dn=Horace+Silver+-+2004+-+The+United+States+of+Mind+FLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"eika256","files":-1,"time":1366756126,"description":"Horace Silver - 2004 - The United States of Mind\n\nReleased on CD as part of the limited-edition Blue Note Connoisseur series, United States of Mind represents pianist and composer Horace Silver's sprawling trilogy of thematically linked albums recorded between 1970 and '72: That Healin' Feelin', Total Response, and All. To say that these albums were misunderstood is to understate the case. Silver had been one of Blue Note's most reliable and steady hard- and post-bop artists since the late 1950s. There was nothing in his catalog that prepared listeners for this adventurous undertaking that linked spiritual concepts and social consciousness to modern jazz as it encountered soul, funk, and pop at the dawn of a new decade. For starters, there are vocals on all three albums by Andy or Salome Bey and Gail Nelson, Jackie Verdell, and even Silver himself, either individually or collectively. Next is Silver using an electric piano, electric bass, and on the latter two records, an electric guitar. Elements of the signature Silver sound remain; how could they not? The tunes are all tight, beautifully arranged and expertly played, but they sound like pop records being made by a jazz band. (And what a jazz band: Mickey Roker or Idris Muhammad on drums, saxophonists Houston Person, George Coleman, Harold Vick, bassists Bob Cranshaw or Jimmy Lewis, and trumpeters Cecil Bridgewater and Randy Brecker et all.) Thematically they discuss everything from cosmic consciousness to &quot;peace,&quot; love, and understanding with breezy, optimistic melodies that reply on group execution rather than solo interplay. And what's more, many of these tunes could have been played on the formatless FM radio at the time -- and some indeed were. That Healin' Feelin' is the &quot;straightest&quot; of the bunch, it relies less on funk and more on jazz melodies and harmonies, and with Andy Bey's elegant singing holding forth with plenty of emotion and smooth soul as its starting point. One lone holdover, &quot;Peace&quot; was given fresh treatment here with lyrics and a killer performance by Bey -- Norah Jones later recorded this version for her Blue Note demo. Total Response and All are another matter. These are thoroughly electric records, they use distorted wah wah guitars, fuzzed up funk basses, they indulge and engage pop song forms with abandon and, while thoroughly being jazz records, they attempt to dissolve the artificial dividing line between genres. There were singles issued from each successive platter and the tune &quot;All&quot; became a hit -- as Silver's debut vocal performance! Other songs form these recordings such as &quot;The Happy Medium&quot; were recorded and played by performers like Charles Earland in his live set. Marlena Shaw covered both &quot;Wipe Away the Evil&quot; and &quot;The Show Has Begun.&quot; And while it's true that songs such as &quot;Acid, Pot &amp; Pills,&quot; &quot;Won't You Open up Your Senses,&quot; and &quot;Soul Searchin'&quot; have seemingly dated lyrical contents, their rhythmic and groove elements have been employed by DJs of later generations in clubs and on dancefloors across the United States and Europe. Ultimately, these records deserve a new hearing. Perhaps Silver's traditional fans who worship the hard bop material still won't get them, and that's fine. But those investigating jazz funk, '70s soul, or seeking out lost grooves from back in the day would do well to listen hard because the reward is bountiful. The quality and vision of the music here is unquestionable, and the bigger message found on these albums is as timely and eternal. (AllMusic)\n\nTrack list:\nDisc One:\n&quot;That Healin' Feelin&quot; - 3:54\n&quot;The Happy Medium&quot; - 4:58\n&quot;The Show Has Begun&quot; - 4:11\n&quot;Love Vibrations&quot; - 4:03\n&quot;Peace&quot; - 3:26\n&quot;Permit Me to Introduce You to Yourself&quot; - 3:13\n&quot;Wipe Away the Evil&quot; - 4:15\n&quot;Nobody Knows&quot; - 4:12\n&quot;There's Too Much to Be Done&quot; - 4:11\n&quot;Acid, Pot or Pills&quot; - 4:26\n&quot;What Kind of Animal Am I&quot; - 3:38\n&quot;Won't You Open up Your Senses&quot; - 3:56\n&quot;I've Had a Little Talk&quot; - 3:46\n&quot;Soul Searching&quot; - 4:15\nDisc Two:\n&quot;Big Business&quot; - 5:22\n&quot;I'm Aware of the Animals Within Me&quot; - 3:45\n&quot;Old Mother Nature Calls&quot; - 6:17\n&quot;Total Response&quot; - 5:22\n&quot;The Merger of the Minds&quot; - 4:47\n&quot;Cause and Effect&quot; - 4:14\n&quot;Forever Is a Long Long Time&quot; - 3:50\n&quot;My Soul Is My Computer&quot; - 4:38\n&quot;How Much Does Matter Really Matter&quot; - 3:09\n&quot;Horn of Life&quot; - 6:27\n&quot;Who Has the Answer&quot; - 3:42\n&quot;From the Heart Through the Mind&quot; - 3:28\n&quot;All&quot; - 5:39\n&quot;Summary&quot; - 2:35\n\nRecorded at Van Gelder Studio, Englewood Cliffs, NJ on April 8, 1970 (Disc One tracks 1-5), June 18, 1970 (Disc One tracks 6-9), November 15, 1970 (Disc One tracks 10 &amp; 11, Disc Two tracks 1 &amp; 4), January 29, 1971 (Disc One tracks 12-14, Disc Two track 2 &amp; 3), January 17, 1972 (Disc Two tracks 6, 7, 9, 11 &amp; 12) and February 14, 1972 (Disc Two tracks 5, 9, 10, 13 &amp; 14).\n\nPersonnel:\nHorace Silver - piano, electric piano, vocals\nRandy Brecker - trumpet, flugelhorn (Disc One tracks 1-9)\nCecil Bridgewater - trumpet, flugelhorn (Disc One tracks 10-14, Disc Two tracks 1-5, 8, 10 &amp; 14)\nGeorge Coleman - tenor saxophone (Disc One tracks 1-5)\nHouston Person - tenor saxophone (Disc One tracks 6-9)\nHarold Vick - tenor saxophone (Disc One tracks 10-14, Disc Two tracks 1-5, 8, 10 &amp; 14)\nRichie Resnicoff - guitar (Disc One tracks 10-14, Disc Two tracks 1-5 &amp; 14)\nBob Cranshaw - electric bass (Disc One tracks 1-5 &amp; 10-14, Disc Two tracks 1-8 &amp; 10-14)\nJimmy Lewis - electric bass (Disc One tracks 6-9)\nMickey Roker - drums (Disc One tracks 1-5 &amp; 10-14, Disc Two tracks 1-8 &amp; 10-14)\nIdris Muhammad - drums (Disc One tracks 6-9)\nAndy Bey - vocals (Disc One tracks 1, 3-5, 12 &amp; 13, Disc Two tracks 4-6 &amp; 11-14)\nGail Nelson - vocals (Disc One track 6, Disc Two tracks 5, 9, 13 &amp; 14)\nJackie Verdell - vocals (Disc One tracks 7-9)\nSalome Bey - vocals (Disc One tracks 10, 11 &amp; 14, Disc Two tracks 1, 2, 4, 5, 7, 13 &amp; 14)\n\nEnjoy and share! ","torrent":{"xt":"urn:btih:755e990a2988f31710514c110e7ef06cb006ab6f","amp;dn":"Horace+Silver+-+2004+-+The+United+States+of+Mind+FLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"755e990a2988f31710514c110e7ef06cb006ab6f","infoHashBuffer":{"type":"Buffer","data":[117,94,153,10,41,136,243,23,16,81,76,17,14,126,240,108,176,6,171,111]},"announce":[],"urlList":[]}}