{"title":"Starslayer","uid":4496063,"size":264888491,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:779a75eb10d296661f2530173621aff09406bcc0&amp;dn=Starslayer&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"gilgamesh07","files":36,"time":1226198760,"description":"This Torrent contains Mike Grell's Starslayer through the complete run of the regular title.\n\nStarslayer was an American comic book series created by Mike Grell.\n\nGrell originally created Starslayer for DC Comics, but plans to publish it were halted after the mass cancellation of titles known as the DC Implosion. Instead, he offered it to Pacific Comics, who released it as a six issued limited series in 1982.[1] In August 1983 First Comics continued the series, starting with issue #7. Grell left the series after issue #8,[2] and was replaced by writer John Ostrander and artist Lenin Delsol. Later contributors to the series were Tim Truman, Hilary Barta, and Tom Sutton. The final issue, #34, came out November 1985.\n\n[b]In issue #10, the character GrimJack was introduced as a backup feature; he would later receive his own title.[/b] [b]Grimjack fans will want to take note that Tim Truman performed the art chores on a number of issues in this series and issue 18 included Grimjack in a co-starring role in the title feature.[/b] Another character that appeared as backup feature was Groo the Wanderer, who also later received his own title at Pacific.\n\nThe first six issue limited series introduces the main character Torin MacQuillon, a Celtic warrior from the time of the Roman Empire. Just before he is killed while fighting a group of Roman soldiers, he is pulled into the distant future by Tamara, a descendant of his wife after she remarried. Torin is asked to join the crew of the spaceship Jolly Roger in their fight against the oppressive regime that is ruling the Earth. Torin agrees, and he and his his new shipmates successfully save the Earth's dying sun by the end of the first series.\n\nWhen First Comics restarted the series, Torin and his crewmates travel throughout the galaxy and end up in Cynosure, the nexus of all realities for First Comics, and gain a crew of pirates. At some point Torin travels back to the solar system with a device that can cause a star to implode into a black hole. He uses this weapon on the sun in the course of battle to destroy his enemies. Just at the point of implosion Torin speaks the name of the Celtic goddess of death, Morrigan, effectively sacrificing the star to her, which brings her back into existence. She proclaims Torin to be her avatar and orders him to go into the galaxy and kill in her name. Torin rebels, which is the basis of the remainder of the title's run.\n\nThanks to the scanners and to a couple of good friends who made these available to me.\n\nPlease seed. Please enjoy.","torrent":{"xt":"urn:btih:779a75eb10d296661f2530173621aff09406bcc0","amp;dn":"Starslayer","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"779a75eb10d296661f2530173621aff09406bcc0","infoHashBuffer":{"type":"Buffer","data":[119,154,117,235,16,210,150,102,31,37,48,23,54,33,175,240,148,6,188,192]},"announce":[],"urlList":[]}}