{"title":"Thai Herbal Medicine: Traditional Recipes for Health","uid":12534720,"size":19447389,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:77cb0052719bfdbf14bc91002887c769abbbb391&amp;dn=Thai+Herbal+Medicine%3A+Traditional+Recipes+for+Health&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mdusanjay","files":1,"time":1444308346,"description":"Thai Herbal Medicine: Traditional Recipes for Health and Harmony by Nephyr Jacobsen, C Pierce Salguero\r\n\r\nOverview: Thai herbs are part of a vibrant culture of healing that has been practiced and preserved over the centuries in traditional medicine schools, Buddhist monasteries, and village homes all over Thailand. Many quite ancient herbal traditions continue to be practiced throughout Thailand to this day, and some of these have now been recognized by the Ministry of Public Health as an important facet of the country’s national healthcare system. This revised and updated edition provides an overview of traditional Thai medicineincluding both the theory and the practical application of Thai cuisine, bodywork, and herbal medicine. Of interest to herbalist, massage therapists, and practitioners of other alternative healthcare systems, the book introduces the basic principles of Thai herbal healing in simple and clear terms, and it includes a detailed compendium of individual herbs. Best of all, this book is fun, offering easy recipes for home remedies, healthcare products, and cuisine that will make the world of Thai tradition come alive in your home","torrent":{"xt":"urn:btih:77cb0052719bfdbf14bc91002887c769abbbb391","amp;dn":"Thai+Herbal+Medicine%3A+Traditional+Recipes+for+Health","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"77cb0052719bfdbf14bc91002887c769abbbb391","infoHashBuffer":{"type":"Buffer","data":[119,203,0,82,113,155,253,191,20,188,145,0,40,135,199,105,171,187,179,145]},"announce":[],"urlList":[]}}