{"title":"It's About Time","uid":15396798,"size":17504054714,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:78082d765b0ce341343ad009f58871bb3299b8e1&amp;dn=It%27s+About+Time&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":3,"uploader":"Psychodad149","files":37,"time":1469404342,"description":"It's About Time\r\n\r\n&quot;It's about time, it's about space, \r\nAbout two men in the strangest place. \r\nIt's about time, it's about flight -- \r\nTraveling faster than the speed of light. \r\n\r\nThis is the tale of the brave crew \r\nAs through the barrier of time they flew.\r\n \r\nPast a fighting minuteman, \r\nPast an armored knight, \r\nPast a Roman warrior, \r\nTo this ancient site. \r\n\r\nIt's about caves, cavemen too, \r\nAbout a time when the earth was new. \r\nWait'll they see what is in sight! \r\nIs it good luck or is it good night?\r\n. . . &quot; \r\n\r\nCAST:\r\n\r\nFrank Aletter ............. Mac\r\nJack Mullaney ............. Hector\r\nJoe E. Ross ............... Gronk\r\nImogene Coca .............. Shad\r\nMary Grace ................ Mlor\r\nPat Cardi ................. Breer\r\nCliff Norton .............. Boss\r\nKathleen Freeman .......... Mrs. Boss\r\nMike Mazurki .............. Clon\r\nFrank Wilcox .............. General Morley\r\nJan Arvan ................. Dr. Hamilton\r\nAlan DeWitt ............... Tyler\r\n\r\n&quot;It's About Time&quot; was a single-season science fiction comedy airing on CBS, from September 11, 1966 to April 2, 1967. It was produced by Sherwood Schwartz, most famous for his other comedy, &quot;Gilligan's Island.&quot; \r\n\r\n&quot;It's About Time&quot; can be fairly characterized as a sci-fi take on &quot;Gilligan's Island.&quot; Right from the opening theme, which likewise lays out the series premise in the lyrics, and is sung by the same vocal combo. Jack Mullaney, as Hector, plays his role as a slightly less-goofy Gilligan; Frank Aletter, as mission commander Mac, plays it somewhat more seriously than &quot;The Skipper.&quot; Much of the scenery, including the famous lagoon, was also borrowed from Gilligan's Isle, however, the astronauts' capsule had made an appearance in the early &quot;Lost In Space&quot; episode, &quot;Welcome, Stranger.&quot; \r\n\r\nFriends to the astronauts are caveman Gronk and his wife Shad, played by comedy legends Joe E. Ross and Imogene Coca. Ross was probably best known for his role in &quot;Car 54, Where Are You?&quot; (co-starring with the other legend, Fred Gwynne), where his trademark &quot;Ooh! Ooh!&quot; became famous; here, it is particularly suited to his caveman character. Rounding out the cave family were son Breer and daughter Mlor: Mlor being the requisite busty blond, after the  manner of Elly May Clampett and Marilyn Munster.\r\n\r\nChief antagonists are the tribal chief, known simply as &quot;Boss&quot;, and Boss' muscle, Clon. Many episodes revolve around Boss being convinced that Mac and Hec are evil spirits or wizards, and wanting them dead, others entail the the astronauts trying to introduce some innovation from &quot;the other side of the hill&quot; (as they claim their origin to be) and wreaking havoc. Often the astronauts use some bit of technology to awe the cavemen and keep their lives. Repairing the space capsule also supplies plot movement.\r\n\r\nMake no mistake, this is the past of fantasy, and dinosaurs share the world with cavemen and astronauts! The dinosaur effects are rather low-budget, and shots consist of stop-motion stock footage, often repeated. \r\n\r\nUnlike the ill-fated &quot;Minnow&quot; crew, Mac and Hec do succeed in repairing their ship, and the last part of the series has them lift off with their cave family aboard, and returns all to the 20th century, where the culture shock motif is reversed and bearskin wearing cave people try to adjust to modern city life -- which they still think is on &quot;the other side of the hill.&quot; This twist was not enough to keep the ratings up and the series going, though, and a single season is all there was. \r\n\r\nThis release differs slightly from what you will find elsewhere, if you can find it at all. Virtually every collection has a few of the later episodes mislabeled; I believe I have given both the correct titles and broadcast order -- with one exception. The very last episode aired was out of order. Called &quot;The Stowaway&quot;, it shows Mlor hiding in the capsule and ruining a test launch back in the prehistoric era. Evidently, the original airing of this episode was pre-empted due to a football game (Superbowl I, in fact), and only shown at the end of the run. I have restored it to its original place in the lineup, and the last episode in this collection was the actual final episode.\r\n\r\nAll in all, this is a short but fun series. Despite its weaknesses, it does have some brilliant moments, and is well worth watching.\r\n\r\n\r\nHere are a few links to other &quot;It's About Time&quot; resources: \r\n\r\nTV Party: http://www.tvparty.com/recits.html\r\nIMDB: http://www.imdb.com/title/tt0059997/\r\n\r\nList of episodes and air dates:\r\n\r\n&quot;And Then I Wrote &quot;Happy Birthday to You&quot; (9/11/1966)\r\n&quot;The Copper Caper&quot; (9/18/1966 )\r\n&quot;The Initiation&quot; (9/25/1966)\r\n&quot;Tailor Made Hero&quot; (10/2/1966)\r\n&quot;The Rainmakers&quot; (10/9/1966)\r\n&quot;Me Caveman - You Woman&quot; (10/16/1966)\r\n&quot;The Champ&quot; (10/23/1966)\r\n&quot;Mark Your Ballets&quot; (10/30/1966)\r\n&quot;Have I Got A Girl for You&quot; (11/6/1966)\r\n&quot;Cave Movies&quot; (11/13/1966 )\r\n&quot;Androcles and Clon&quot; (11/20/1966 )\r\n&quot;Love Me, Love My Gnook&quot; (11/27/1966)\r\n&quot;The Broken Idol&quot; (12/4/1966)\r\n&quot;The Sacrifice&quot; (12/11/1966)\r\n&quot;King Hec&quot; (12/18/1966)\r\n&quot;The Mother-in-law&quot; (12/25/1966)\r\n&quot;Which Doctor's Witch?&quot; (1/1/1967)\r\n&quot;To Catch a Thief&quot; (1/8/1967)\r\n&quot;20th Century Here We Come&quot; (1/22/1967)\r\n&quot;Shad Rack and Other Tortures&quot; (1/29/1967)\r\n&quot;The Cave Family Swingers&quot; (2/5/1967)\r\n&quot;To Sign or Not to Sign&quot; (2/19/1967)\r\n&quot;School Days, School Days&quot; (2/26/1967)\r\n&quot;Our Brothers' Keepers&quot; (3/5/1967)\r\n&quot;The Stone Age Diplomats&quot; (3/12/1967)\r\n&quot;The Stowaway&quot; (4/2/1967)*\r\n*See note above","torrent":{"xt":"urn:btih:78082d765b0ce341343ad009f58871bb3299b8e1","amp;dn":"It%27s+About+Time","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"78082d765b0ce341343ad009f58871bb3299b8e1","infoHashBuffer":{"type":"Buffer","data":[120,8,45,118,91,12,227,65,52,58,208,9,245,136,113,187,50,153,184,225]},"announce":[],"urlList":[]}}