{"title":"Neil Gaiman - Il cimitero senza lapidi e altre storie nere","uid":12919496,"size":617273,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:796ab9b49f01e10e46313f28b6d1294788b68050&amp;dn=Neil+Gaiman+-+Il+cimitero+senza+lapidi+e+altre+storie+nere&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"vitolanz","files":2,"time":1449400320,"description":"Neil Gaiman - Il cimitero senza lapidi e altre storie nere [Pdf Epub - Ita][TNTVillage]\r\n--------------------------------------------------------------------------------\r\n.: Dettagli :.\r\n\r\nAutore: Neil Gaiman\r\nTitolo: Il cimitero senza lapidi e altre storie nere\r\nAnno: 2009\r\nLingua: Italiana\r\nGenere: Narrativa horror e del terrore \r\nDimensione del file: 478 KB (PDF), 124 KB (Epub)\r\nFormato del file: PDF + Epub\r\n--------------------------------------------------------------------------------\r\n.: Trama :.\r\n\r\nNobody Owens cade dal melo ai confini del cimitero, nel terreno sconsacrato dove sono sepolti i malvagi, e decide di donare una lapide alla strega che lo soccorre. Jack incontra un troll sotto il ponte della ferrovia e da quel momento la sua vita sarà legata a un terribile patto di morte. Un nobile cavaliere trova il Santo Graal nel salotto di una vecchina che non ha alcuna intenzione di spostarlo dal suo grazioso caminetto. Tra l'horror, il fantasy e il giallo hard boiled, undici racconti per rabbrividire e sorridere. Racconti che, come scrive lo stesso Gaiman, sono &quot;viaggi fino all'estremo opposto dell'universo che puoi fare con la certezza di essere di ritorno per l'ora di cena&quot;\r\n--------------------------------------------------------------------------------\r\n.: Biografia dell'autore :.\r\n\r\nNato in Inghilterra, vive negli Stati Uniti. Scrittore, fumettista, giornalista e sceneggiatore televisivo e radiofonico è legato al mondo del rock.\r\nÈ autore di graphic novel come quelli della serie The Sandman. \r\nTra i romanzi pubblicati si ricorda American Gods, Stardust, Il figlio del cimitero.\r\nLa sua opere più celebre è Coraline (edita in Italia da Mondadori nel 2003) da cui il film d'animazione del 2009 diretto da Henry Selick (il regista di Nightmare Before Christmas) e realizzato in stop-motion.\r\nHa ricevuto numerosi premi letterari, tra i quli ricordiamo: Premio Bram Stoker al romanzo 2001 con American Gods, Premio Hugo per il miglior romanzo 2002 con American Gods, Premio Nebula e Premio Hugo per il miglior romanzo breve 2003 con Coraline, Premio Hugo per il miglior racconto breve 2004 con Uno studio in smeraldo, Premio Hugo per il miglior romanzo 2009 con The Graveyard Book, Carnegie Medal 2010 con The Graveyard Book","torrent":{"xt":"urn:btih:796ab9b49f01e10e46313f28b6d1294788b68050","amp;dn":"Neil+Gaiman+-+Il+cimitero+senza+lapidi+e+altre+storie+nere","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"796ab9b49f01e10e46313f28b6d1294788b68050","infoHashBuffer":{"type":"Buffer","data":[121,106,185,180,159,1,225,14,70,49,63,40,182,209,41,71,136,182,128,80]},"announce":[],"urlList":[]}}