{"title":"DDF Busty - Sensual Jane","uid":13677505,"size":952798175,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:79941010812ad95bd8b1328758f52e8a97612586&amp;dn=DDF+Busty+-+Sensual+Jane&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"hunter534","files":1,"time":1456442892,"description":"Sensual Jane proves she’s got an abundance of titty to go around as she gives herself to the studly Kid Jamaica. Enjoying some champagne with Jane in a bedroom leads to the Kid quickly cupping her 36DDs in his hands, right through her dress. What is it about images of gals being fondled through their clothes that’s so damn sexy? You get some nice shots of that here, but of course the clothes come off so that the Kid can glom onto one of her globes while Jane sucks the other one simultaneously! Getting out of her duds pronto, Jane squats in front of Mr. Jamaica and blows his huge dick while Denys DeFrancesco and his camera crews capture the action from many angles, all to bring whatever fantasies you have in your head to vivid life! Jane gets on the bed so the Kid can suck her cunny, and then fuck it spoon-style. Leaning over on her knees, she takes his tool doggie style while her bells swing back and forth across the red satin spread. Jug-fucking and cowgirl-riding follow with the lucky cocksman enjoying her box and boobs at the same time, until finally she guides him over her tatas for one last cleavage-cramming so the Kid can squirt his sauce all over the tittie territory. What a gooey mess! But Sensual Jane, true to her name, shows us in the final frames exactly how it should be licked up...\r\n\r\nSize: 908.66 MiB\r\nTime: 00:27:05\r\nFormat: MP4\r\n\r\nCOVER+SCEENSHOT:\r\n \nhttp://photo-up.info/img-56cf7fb192e43.html \r\n \nhttp://photo-up.info/img-56cf7fc1b210d.html","torrent":{"xt":"urn:btih:79941010812ad95bd8b1328758f52e8a97612586","amp;dn":"DDF+Busty+-+Sensual+Jane","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"79941010812ad95bd8b1328758f52e8a97612586","infoHashBuffer":{"type":"Buffer","data":[121,148,16,16,129,42,217,91,216,177,50,135,88,245,46,138,151,97,37,134]},"announce":[],"urlList":[]}}