{"title":"Explaining the Six Pillars Of Faith In Islam","uid":6555592,"size":4360052794,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:7a87e395ad95a1395d35660a7b7c62de57d55158&amp;dn=Explaining+the+Six+Pillars+Of+Faith+In+Islam&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"iSky","files":11,"time":1311280918,"description":"\n                                                   \n                      ||   .                 || /| | ||\n      o_____|_____\\ __|| |   |_____o_____\\ __||  |_|_||  o______w_|\n     /   &quot;         /     |___|            /             /        .\n\n\nALL praise is due to Allah, the Lord of the Worlds, the Most\nMerciful, the Beneficent, and the Master of the Day of\nJudgment. O Allah! Have Your Salat and Salam (peace) and\nblessing upon Your slave and Messenger Muhammad and\nupon all of his companions.\n\n\n\n\nQSEP.COm PRESENTS\n\nAn Exclusive Video Series\n\n==============================================\nExplanation of the Pillars of Faith in Islam\n==============================================\n\nOver 6 hours of Video Lectures\n\nConcise eye-catching sub-titles\n\nAttractive graphical illustrations\n\n=========================\nTechnical Specifications\n=========================\n\nVideo Format:.........:H.264, 638X480, Millions\nAudio Format:.........:AAC, Mono, 44.100 kHz\nMovie FPS:............:25.00\n\nThe video is in the mp4 format. To play it use the VLC player ( http://www.videolan.org/vlc/ )\n\nor quicktime player ( http://www.apple.com/quicktime/download/ )\n\n=============\nIntroduction\n=============\n\nThe Islamic Aqeedah (faith) is as essential for man as air and water.\n\nWithout this Aqeedah, he is lost and confused. Who is our Creator? What are His Names and Attributes?\n\nWhy did He create us? What is our relationship to the Creator? Who are Angels? What is their role in human life?\n\nHow should we believe in the Angels? What was the message of all the Prophet and Messengers?\n\nWhat happens after death? What are the signs of the Hour? What does it mean to believe in Predestination?\n\nIs everything including the actions of the slaves pre-decreed by Allah? Does man have freedom of choice?\n\nOnly by studying the Aqeedah based purely upon the Quran and the Sunnah can one correctly answer these\n\nessential questions. The Prophet (sallallahu alaihe wa-sallam) said, &quot;Knowledge is acquired by studying.&quot;\n\n[Silsilatul-Ahaadeeth as-Saheehah]\n\n\nWith this video lecture series, you will study the basics of your Aqeedah with Shaikh (Dr.) Abdullah al-Farsi,\n\nwho has studied many books under senior students from the Islamic University of Madeenah, and has been encouraged\n\nby them to teach the books of Aqeedah in English. Amongst the major scholars who know him are\n\nShaikh Saaleh aal-Shaikh and Shaikh Saleh ibn al-Fawzan. He was known to Shaikh Ibn Baaz (rahimahullah) and\n\nhas an honorary tazkeeyah (recommendation) from Shaikh Badiuddin Shah Sindhi (rahimahullah).\n\nShaikh (Dr.) Abdullah al-Farsi has been active in the field of dawah since 1980, mostly in America\n\nand Europe, and he has taught many Aqeedah books in Kuwait. He has an extensive personal research on books of Tafseer,\n\nexplanations of Hadith and the writings of Shaikh ul-Islaam Ibn Taymiyyah (rahimahullah).\n\nThis set of four DVDs contains over six hours of video lectures explaining the six pillars of faith. Each lecture\n\nis made more interesting and informative with attractive graphical illustrations and concise eye-catching sub-titles\n\nthat keep you focused on the subject under discussion.\n\n\n  Dear Non-muslim Brothers and Sisters Please Watch These Clips Carefully You Will Find The Straight Path ( Inshallah )... For More Islamic Books And Others Please Visit www.islamhouse.com and www.qsep.com For Finding The Straight Path...Thanks\n\n","torrent":{"xt":"urn:btih:7a87e395ad95a1395d35660a7b7c62de57d55158","amp;dn":"Explaining+the+Six+Pillars+Of+Faith+In+Islam","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7a87e395ad95a1395d35660a7b7c62de57d55158","infoHashBuffer":{"type":"Buffer","data":[122,135,227,149,173,149,161,57,93,53,102,10,123,124,98,222,87,213,81,88]},"announce":[],"urlList":[]}}