{"title":"Lecture: The World as Will and Representation by Schopenhauer","uid":4903363,"size":37521660,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:7c8edc2cfc3effbd44e1e8bc636a458559c85700&amp;dn=Lecture%3A+The+World+as+Will+and+Representation+by+Schopenhauer&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ill88eagle","files":-1,"time":1242766036,"description":"A short (40 minutes) lecture on Schopenhauer's central work: The World as Will and Representation, with excerpts, resumÃƒÂ© and discussion.\n\nwiki: &quot;The World as Will and Representation (Die Welt als Wille und Vorstellung) is the central work of German philosopher Arthur Schopenhauer. It was published in December 1818.\nThe main body of the work states at the beginning that it assumes prior knowledge of Immanuel Kant's theories[2], and Schopenhauer is regarded by some as remaining more faithful to Kant's metaphysical system of transcendental idealism than any of the other later German Idealists. However, the book contains an appendix entitled Criticism of the Kantian Philosophy, in which Schopenhauer rejects most of Kant's ethics and significant parts of his epistemology and aesthetics.\nSchopenhauer believed that Kant had ignored inner experience, as intuited through the will, which was the most important form of experience. Schopenhauer saw the human will as our one window to the world behind the representation; the Kantian thing-in-itself. He believed, therefore, that we could gain knowledge about the thing-in-itself, something Kant said was impossible, since the rest of the relationship between representation and thing-in-itself could be understood by analogy to the relationship between human will and human body. According to Schopenhauer, the entire world is the representation of a single Will, of which our individual wills are phenomena. In this way, Schopenhauer's metaphysics go beyond the limits that Kant had set, but do not go so far as the rationalist system-builders that preceded Kant. Other important differences are Schopenhauer's rejection of eleven of Kant's twelve categories, arguing that only causality was important. Matter and causality were both seen as a union of time and space and thus being equal to each other.\nSchopenhauer also frequently acknowledges drawing on Plato in the development of his theories and, particularly in the context of aesthetics, speaks of the Platonic forms as existing on an intermediate ontological level between the representation and the Will.&quot;\n &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/The_World_as_Will_and_Representation&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/The_World_as_Will_and_Representation&lt;/a&gt;\n","torrent":{"xt":"urn:btih:7c8edc2cfc3effbd44e1e8bc636a458559c85700","amp;dn":"Lecture%3A+The+World+as+Will+and+Representation+by+Schopenhauer","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7c8edc2cfc3effbd44e1e8bc636a458559c85700","infoHashBuffer":{"type":"Buffer","data":[124,142,220,44,252,62,255,189,68,225,232,188,99,106,69,133,89,200,87,0]},"announce":[],"urlList":[]}}