{"title":"Enterprise JavaBeans","uid":6550721,"size":2926423,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7cb0e4ddb05697d59f98cb01bb5f6a221c6c0aa2&amp;dn=Enterprise+JavaBeans&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"_F1_","files":-1,"time":1311065364,"description":"Richard Monson-Haefel, &quot;Enterprise JavaBeans&quot;\n Publisher: O'Reilly | 1999 | ISBN: 1565926056 | EPUB | 336 pages | 2.8 MB\n\n Enterprise JavaBeans (EJB) is a major new technology for server-side application development in Java. It offers a component architecture for developing distributed, multitiered enterprise applications. This model allows you to build complex, mission-critical systems using simple snap-together pieces that model individual business objects and processes. EJB greatly simplifies the process of development by automatically taking care of system issues like object persistence and transaction management.\n\n This book provides a thorough introduction to EJB for the enterprise software developer. It shows you how to develop enterprise Beans to model your business objects and processes. It also shows you how to develop client applications that use the Beans to perform useful work. One powerful advantage of the EJB architecture is that it allows you to partition work appropriately between different parts of the system: the database provides persistence, your Beans model various business entities and the interactions between them, and your client application provides a user interface, but incorporates minimal business logic. The end result is a highly flexible system built from components that can easily be reused, and that can be changed to suit your needs without upsetting other parts of the system. Enterprise JavaBeans teaches you how to take advantage of the flexibility and simplicity that this powerful new architecture provides.\n\n This book covers:\n\n Developing entity Beans (Beans that model business objects) and session Beans (Beans that model business processes)\n Deploying Beans in an EJB server\n Using the client-side API to use enterprise Beans\n Bean-managed persistence\n\n Appendices show in detail how to deploy Beans with the most popular EJB servers.","torrent":{"xt":"urn:btih:7cb0e4ddb05697d59f98cb01bb5f6a221c6c0aa2","amp;dn":"Enterprise+JavaBeans","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7cb0e4ddb05697d59f98cb01bb5f6a221c6c0aa2","infoHashBuffer":{"type":"Buffer","data":[124,176,228,221,176,86,151,213,159,152,203,1,187,95,106,34,28,108,10,162]},"announce":[],"urlList":[]}}