{"title":"Disk Explorer Professional 3","uid":5385672,"size":3588060,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:7cda533ec1c3a0eff95024e7d2938b558594456f&amp;dn=Disk+Explorer+Professional+3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"funth0m","files":1,"time":1266884171,"description":"Organize all your files on CDs/DVDs: photo and video, music... and browse your collection offline!\n\nThis application is a powerful tool for catalogizing all CDs, DVDs, floppies, ZIP disks, or other removable media, hard drives, network drives, or even FTP servers on the Internet (they are called volumes). Entire structure of volumes can be catalogized as well as internal structure of various archive files (ZIP, 7-ZIP, RAR, ARJ, LZH, CAB, TAR/GZIP, ACE, JAR and others) including self-extracting installers (EXE).\n\nThe application can automatically include contents of various commonly used files (such as readme.txt, file_id.diz) entirely or just in part into a catalog (called a database). Files can be processed by filters that can extract file summary or even create a thumbnail of the file. The current version is equipped with 18 filters which can extract for example song/interpreter/album name from MP3, WMA, OGG, FLAC, WAV or VQF files; size, bit-depth, format and even thumbnail from images of over 40 file formats (JPG, GIF, TIF, PNG, BMP, PCX, CDR etc.); properties of various sound files; obtain title, keywords, author, statistics from office documents (such as MS Word and Excel); title from HTML documents; or just copyright holder, name and version from executables. Comments can be added to any volume or folder. All filters are fully configurable, different file types can be associated to any filter.\n\nThe application can work with any type of files, be it programs from the Internet, CD magazines, music collections, photo-albums, or anything else.\n\nFiles and folders can be searched in the database even if the original media (or Internet connection for FTP servers) is not currently available and this works really fast. Using an average computer, you can find your file even faster than you would insert a CD disc into a drive. Searching can be done using various criteria, such as file name wildcards, substring, regular expression, date, time, file attributes. Comments generated by filters can be searched as well.\n","torrent":{"xt":"urn:btih:7cda533ec1c3a0eff95024e7d2938b558594456f","amp;dn":"Disk+Explorer+Professional+3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7cda533ec1c3a0eff95024e7d2938b558594456f","infoHashBuffer":{"type":"Buffer","data":[124,218,83,62,193,195,160,239,249,80,36,231,210,147,139,85,133,148,69,111]},"announce":[],"urlList":[]}}