{"title":"Brenda Lee - Anthology 1956-1980 (1991) (2 CDs)","uid":8431304,"size":644543761,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:7d9223cd8b6e558d82d7b52a3a2ce80e87fd8153&amp;dn=Brenda+Lee+-+Anthology+1956-1980+%281991%29+%282+CDs%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Coltbear50","files":69,"time":1367504958,"description":"This is the same torrent that was uploaded to Demonoid in November 2008.\n\n\nBrenda Lee - Anthology 1956-1980 (1991) (2 CDs)\n &lt;a href=&quot;\nhttp://ecx.images-amazon.com/images/I/51K75NX0d2L._SL500_AA240_.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://ecx.images-amazon.com/images/I/51K75NX0d2L._SL500_AA240_.jpg&lt;/a&gt;\n\nIncludes:\nFiles by track, ripped at FLAC 8 using Easy CD-DA Extractor (www.poikosoft.com)\nDVD-ROM: LG GDR816B\nTracks have full tags (including embedded thumbnail).\nAll artwork in jpgs at 300 d.p.i. Rotated and cropped losslessly using jpegcrop. (Includes two 16 page booklets.)\nAMG Bio.txt\nAMG Review.txt\nNotes.txt (which is simply these notes included in the torrent)\n\nBio Excerpt from All Music:\n\nOne of the biggest pop stars of the early '60s, Brenda Lee hasn't attracted as much critical respect as she deserves. She is sometimes inaccurately characterized as one of the few female teen idols. More crucially, the credit for achieving success with pop-country crossovers usually goes to Patsy Cline, although Lee's efforts in this era were arguably of equal importance. While she made few recordings of note after the mid-'60s, the best of her first decade is fine indeed, encompassing not just the pop ballads that were her biggest hits, but straight country and some surprisingly fierce rockabilly.\n\nLee was a child prodigy, appearing on national television by the age of ten, and making her first recordings for Decca the following year (1956). Her first few Decca singles, in fact, make a pretty fair bid for the best preteen rock &amp; roll performances this side of Michael Jackson. &quot;BIGELOW 6-200,&quot; &quot;Dynamite,&quot; and &quot;Little Jonah&quot; are all exceptionally powerful rockabilly performances, with robust vocals and white-hot backing from the cream of Nashville's session musicians (including Owen Bradley, Grady Martin, Hank Garland, and Floyd Cramer). Lee would not have her first big hits until 1960, when she tempered the rockabilly with teen idol pop on &quot;Sweet Nothin's,&quot; which went to the Top Five. ...\n\nTo read the entire bio: &lt;a href=&quot;\nhttp://www.allmusic.com/cg/amg.dll?p=amg&amp;sql=11:jjfexqy5ldke~T1&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.allmusic.com/cg/amg.dll?p=amg&amp;sql=11:jjfexqy5ldke~T1&lt;/a&gt;\n\nAll Music Album Review:\n\nBrenda Lee hasn't been treated well by reissue culture -- no remastered albums -- and, excepting the Bear Family box set she deserved (and received), only a few compilations, like this two-disc set from MCA. Fortunately, Anthology, Vols. 1 &amp; 2 (1956-1980) is all most fans will need to appreciate why Lee was one of the most intense performing personalities recording in Nashville, just behind Elvis Presley. But Lee had more power than Presley, and more control as well, and the two ranked nearly even in delivery. (Of course, Elvis received song material of a much higher quality than she did.) Her first hit, &quot;Dynamite,&quot; along with &quot;Sweet Nothin's,&quot; and &quot;Bill Bailey Won't You Please Come Home&quot; rank with the best country/pop/rockabilly performances of the era. Lee could pull off bright novelties such as &quot;Let's Jump the Broomstick&quot; or &quot;Dum Dum&quot; with no problem, and add something new to a well-worn standard, like her bluesy, swinging version of Leiber &amp; Stoller's &quot;Kansas City,&quot; or the vocal jazz chestnut &quot;You Can Depend on Me.&quot; As the later material here proves, Lee also excelled in the melodramatic countrypolitan mode; moving from teenaged exuberance to middle-aged reflection and resignation -- in character, of course; she only turned 30 in 1974 -- to bring across moving country heartbreakers &quot;Johnny One Time,&quot; &quot;As Usual,&quot; and &quot;Emotions.&quot; The track selection is excellent, touching on every major performance of her career, as well as those she's best known for in rock circles: &quot;Rockin' Around the Christmas Tree&quot; and &quot;Is It True?,&quot; the latter a 1964 rock &amp; roll hit recorded in London with Jimmy Page on guitar.\n\nTaken from: &lt;a href=&quot; http://www.allmusic.com/cg/amg.dll?p=amg&amp;sql=10:fjfixqq5ldte&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.allmusic.com/cg/amg.dll?p=amg&amp;sql=10:fjfixqq5ldte&lt;/a&gt;\n\nReviews and for sale here: &lt;a href=&quot; http://www.amazon.com/dp/B000002OHP&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.amazon.com/dp/B000002OHP&lt;/a&gt;\n\nTrack List:\n\nDisc 1:\n\n01. Jambalaya (On The Bayou)\n02. Bigelow 6-200\n03. One Step At A Time\n04. Dynamite\n05. Little Jonah (Rock On Your Steel Guitar)\n06. Let's Jump The Broomstick\n07. Rockin' Around The Christmas Tree\n08. Bill Bailey, Won't You Please Come Home\n09. Sweet Nothin's\n10. Weep No More My Baby\n11. I Want To Be Wanted (Per Tutta La Vita)\n12. That's All You Gotta Do\n13. I'm Sorry\n14. Emotions\n15. If You Love Me (Really Love Me)\n16. You Can Depend On Me\n17. Kansas City\n18. Dum Dum\n19. Fool #1\n20. So Deep\n\nDisc 2:\n\n01. Break It To Me Gently\n02. Everybody Loves Me But You\n03. Heart In Hand\n04. Someday You'll Want Me To Want You\n05. All Alone Am I\n06. My Coloring Book\n07. Losing You\n08. I Wonder\n09. The Grass Is Greener\n10. My Whole World Is Falling Down\n11. As Usual\n12. Is It True\n13. Too Many Rivers\n14. Coming On Strong\n15. Johnny One Time\n16. Nobody Wins\n17. Big Four Poster Bed\n18. Rock On Baby\n19. Tell Me What It's Like\n20. Broken Trust\n","torrent":{"xt":"urn:btih:7d9223cd8b6e558d82d7b52a3a2ce80e87fd8153","amp;dn":"Brenda+Lee+-+Anthology+1956-1980+%281991%29+%282+CDs%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7d9223cd8b6e558d82d7b52a3a2ce80e87fd8153","infoHashBuffer":{"type":"Buffer","data":[125,146,35,205,139,110,85,141,130,215,181,42,58,44,232,14,135,253,129,83]},"announce":[],"urlList":[]}}