{"title":"Witch Hunts in the Western World","uid":5979590,"size":3664799,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7e450dec93e6aeff40986d05ae234fff143ed79d&amp;dn=Witch+Hunts+in+the+Western+World&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bookzilla","files":1,"time":1290546700,"description":"Witch Hunts in the Western World: Persecution and Punishment from the Inquisition through the Salem Trials \n\nThis in-depth and comprehensive resource explores the intersection of religion, politics, and the supernatural that spawned the notorious witch hunts in Europe and the New World. Witch Hunts in the Western World traces the evolution of Western attitudes toward magic, demons, and religious nonconformity from the Roman Empire through the Age of Enlightenment, placing these chilling events into a wider social and historical context. Brian A. Pavlac discusses witch hunts in fascinating detail by region, highlighting the cultural differences of the people who incited them as well as the key reforms, social upheavals, and intellectual debates that shaped European thought. Vivid accounts of trials and excerpts from the writings of both witch hunters and defenders throughout the Holy Roman Empire, France, theIsles and colonies, Southern Europe, Scandinavia, and Eastern Europe bring to life one of the most intriguing and shocking issues in Western history. \n \nAccessible narrative chapters make this a fascinating volume for general readers while offering a wealth of historical information for students and scholars. Features include a complete glossary of terms, a timeline of major events, recommended reading selections, an index, and illustrations.\n\nPaperback: 272 pages \nPublisher: Bison Books (November 1, 2010) \nLanguage: English \n \n","torrent":{"xt":"urn:btih:7e450dec93e6aeff40986d05ae234fff143ed79d","amp;dn":"Witch+Hunts+in+the+Western+World","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7e450dec93e6aeff40986d05ae234fff143ed79d","infoHashBuffer":{"type":"Buffer","data":[126,69,13,236,147,230,174,255,64,152,109,5,174,35,79,255,20,62,215,157]},"announce":[],"urlList":[]}}