{"title":"Game of Thrones 4º temporada Dublado hd 720p","uid":14026436,"size":4680233816,"categoryP":"games","categoryS":"other","magnet":"?xt=urn:btih:7e48831153ca4c628f6940cd6068b708cdabe451&amp;dn=Game+of+Thrones+4%26ordm%3B+temporada+Dublado+hd+720p&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":1,"time":1458923479,"description":"Joffrey Baratheon continua o mala de sempre. Ele se casa com a Margaery Tyrell e, na festa de casamento, morre envenenado. Esse plano foi arquitetado por Olenna Tyrell (vó de Margaery) e Petyr Baelish, o Mindinho. Com isso, seu irmão mais novo, Tommem Baratheon vira o novo Rei.\r\n\r\nTyrion Lannister, o anão, é Mestre da Moeda e esposo de Sansa Stark. Ele ama a prostituta Shae, mas tem medo dela ser morta por seu pai, Tywin. Por isso, ele a renega e a manda embora de Porto Real. Cersei o acusa de assassinar Joffrey e ele é julgado. Basicamente todo mundo aparece para falar mal dele e, de surpresa, Shae dá um testemunho contra Tyrion! O anão fica bravo com o testemunho e pede um julgamento por combate. Como Jaime não pode ser seu campeão na luta, quem se oferece pra representá-lo é Oberyn Martell!\r\n\r\nO combate acontece: Oberyn é morto e Tyrion sentenciado à morte. Jaime o liberta, mas antes de fugir Tyrion passa no quarto do pai e encontra Shae em sua cama. Ele enforca a ex-amante e assassina Tywin enquanto este fazia o número 2 (!). Antes de morrer Tywin fala que Tyrion &quot;nunca foi seu filho&quot;. Após isso, o anão foge com a ajuda de Varys.\r\n\r\nCersei Lannister está chateada com Jaime por ele ter demorado tanto pra voltar e o relacionamento dos dois passa por altos e baixos. No fim das contas ela decide contar para Tywin, seu pai, que os boatos de incesto são reais e que ela não vai casar com o Loras - caso ele insistisse, ela contaria para todo mundo que seus filhos não são de Robert, mas do irmão. Como Joffrey tinha humilhado Tyrion no casamento, Cersei acredita que o anão é o culpado pelo assassinato e faz o que pode para prejudicá-lo. \r\n\r\nJaime Lannister ganha uma mão de ouro para substituir a que perdeu. Depois que Sansa foge, como um símbolo de confiança, ele dá uma espada de aço valiriano à Brienne e pede para ela encontrar a jovem. No meio do julgamento de Tyrion, Jaime vai até o pai pedir pra que deixe o irmão viver e promete que se ele fizer isso ele deixará a Guarda Real e voltará ao Rochedo Casterly para casar e coisa e tal (sonho do velho Lannister). Tywin topa e fala que Tyrion será julgado culpado, mas que vai mandá-lo para a Patrulha da Noite. O anão acaba falando besteira no julgamento e desanda todo o plano. Jaime liberta o irmão na noite anterior à execução","torrent":{"xt":"urn:btih:7e48831153ca4c628f6940cd6068b708cdabe451","amp;dn":"Game+of+Thrones+4%26ordm%3B+temporada+Dublado+hd+720p","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7e48831153ca4c628f6940cd6068b708cdabe451","infoHashBuffer":{"type":"Buffer","data":[126,72,131,17,83,202,76,98,143,105,64,205,96,104,183,8,205,171,228,81]},"announce":[],"urlList":[]}}