{"title":"Sexually Broken--Chanel Preston tagteamed by dick, ragdoll fucke","uid":9991873,"size":1681996016,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:7ee0eea9f271049470cb92c731057cf0a22996f1&amp;dn=Sexually+Broken--Chanel+Preston+tagteamed+by+dick%2C+ragdoll+fucke&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"merzedes","files":-1,"time":1397860539,"description":"Chanel Preston tagteamed by dick, ragdoll fucked while straightjacketed, brutal epic deepthroat! | Chanel Preston | Matt Williams\n\nApril 18, 2014\n\n\niPod, Low and High bitrate MP4 + Pics.\n\n\nToday we have the lush and sexy Chanel Preston back to grace the Sexuallybroken stage. We do not have just anyone back, it takes a certain type of stamina and enthusiasm to be invited back for another round. Chanel brings the sort of hunger that makes you want her back. Plus she has never been in a straightjacket before. Let's take her straightjacket virginity and see what happens, shall we?\n\nWe buckle Chanel up in the straightjacket, and once she has been throughly immobilized, throw her down on our well-used fuck bed and bind her legs open wide. Her head hangs over the edge, opening up her throathole perfectly for the dick. We walk right up and make immediate use of her facepussy. We are nothing if not generous however, and make use to apply a vibrator between Chanel's spread open thighs. Her pussy is on a hair trigger and she cums almost immediately, the rock hard cock wedged down past her tonsils the whole time.\n\nUntying her legs so that we can properly ragdoll fuck her, we pick up the pace. The goal is both ends plowed, simultaneously, relentlessly and without mercy. It is a total destruction by dick.The cock owns her throat and pussy.She cums over and over, she can not help herself. We flip her around every which way, using whichever end at whatever angle we so desire. Chanel's eyes roll up into the back of her head as the overwhelming sensations wash over her bound body.\n\nIt is time for the finishing touch and we use our fingers to milk a squirting orgasm out of that well-used pussy. Fingerblasting pussy is an art, and once you know the skill you can unlock the key over and over again. To seal the deal we add a neck rope to provide just the right amount of pressure for our cumdrunk starlet. They always like the neckrope. Straightjacketed, neck tied off and rolling around in a sex stoned puddle of flesh is a look that Chanel wears well... \n \nScreens &lt;a href=&quot;\nhttp://sexuallybroken.com/sexual/bondage/2014/04_18cpreston6/SexuallyBroken-Chanel-Preston-Matt-Williams-Chanel-Preston-tagteamed-by-dick-ragdoll-fucked-while-straightjacketed-brutal-epic-deepthroat.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://sexuallybroken.com/sexual/bondage/2014/04_18cpreston6/SexuallyBroken-Chanel-Preston-Matt-Williams-Chanel-Preston-tagteamed-by-dick-ragdoll-fucked-while-straightjacketed-brutal-epic-deepthroat.php&lt;/a&gt;\n\n14 000 down, but how much more to come ?? You decide ;) \n\nThe more you appreciate it, the more we want to do it. Can we get to 15k ??? \n\nWell, if you still like what Shallow2 and I upload, how about leaving us a nice comment below ? :)\n\n\nAny Questions ?? Read our FAQ!!\n &lt;a href=&quot;\nhttp://image.bayimg.com/eaea7e9e982a9a677d61e4f5aaf93b7643bd6eeb.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://image.bayimg.com/eaea7e9e982a9a677d61e4f5aaf93b7643bd6eeb.jpg&lt;/a&gt;\n\n\nCheers  :-)  \n\n\n\n","torrent":{"xt":"urn:btih:7ee0eea9f271049470cb92c731057cf0a22996f1","amp;dn":"Sexually+Broken--Chanel+Preston+tagteamed+by+dick%2C+ragdoll+fucke","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7ee0eea9f271049470cb92c731057cf0a22996f1","infoHashBuffer":{"type":"Buffer","data":[126,224,238,169,242,113,4,148,112,203,146,199,49,5,124,240,162,41,150,241]},"announce":[],"urlList":[]}}