{"title":"Drug Discovery: From Bedside to Wall Street","uid":4729027,"size":1097902,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7ef903f39f17e380ba89b97858261ba5195ea1c5&amp;dn=Drug+Discovery%3A+From+Bedside+to+Wall+Street&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"VasiaZozulia","files":1,"time":1234903220,"description":"Everyone expects something from the drug industry. Physicians and patients, investors, regulators and administrators all have an active interest. Everyone wants to know what makes drugs 'work' medically and economically. Why are drugs so expensive? Is it the drug companies or investors who demand high profits? What governs the pharmacoeconomics? Why are so few diseases treatable?\n\nThis book opens the windows and doors of the industry telling the story of drug development by using real stories from inside the process.\n\n* Co-written by Graham Lees and Tamas Bartfai who has been involved in the development of drugs taken by more that 20 million people every day\n* Opens the windows and doors of the most regulated industry in the world, the pharmaceutical industry\n* Tells the story of drug development by using real examples based on current research and events\n* Provides an objective, lucid account of the successes and failures, shortcomings and constraints of the pharmaceutical and biotech industries\n* Gives insights into the development of new drugs to combat multiple conditions including cancer and pain\n* Balanced, unbiased account of how better to translate basic science into drug discovery","torrent":{"xt":"urn:btih:7ef903f39f17e380ba89b97858261ba5195ea1c5","amp;dn":"Drug+Discovery%3A+From+Bedside+to+Wall+Street","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7ef903f39f17e380ba89b97858261ba5195ea1c5","infoHashBuffer":{"type":"Buffer","data":[126,249,3,243,159,23,227,128,186,137,185,120,88,38,27,165,25,94,161,197]},"announce":[],"urlList":[]}}