{"title":"My dinner with Andre (720 X 480) DivX French Spanish subs","uid":5145535,"size":730347114,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:7f6f7ca500f575de1ba99fc21f803e36a2d0a8e5&amp;dn=My+dinner+with+Andre+%28720+X+480%29+DivX+French+Spanish+subs&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mrizzo2","files":-1,"time":1257242968,"description":"Kindly download your subtitles folder here:\nhttp://thepiratebay.se/edit/5172701\n(SRT folder for French Spanish and Portuguese)\n\n\nfrom my movie reviews at moviesbyrizzo.info :\n\nHaving been described as &quot;brilliant&quot; in my work at senior philosophy studies at\na major western university (a comment from the course professor who was the\nassociate chair of the department), I am always up to the job when I have to\nallow myself the edification of a differing perspective in what there might be\nin the way of an argument needing rebuttal and correction (if you will pardon\nthe presumptiveness here - its well intentioned I put it to you). As such I\nhave to tell you that I have only once fallen asleep at a movie theater unable\nto sit through the entire ordeal without some means of escape. This was the\nmovie and i saw it a couple of decades ago when it first came to town (in 1981).\n\nThis is an important movie for discussion among all human beings who want to\nmake a choice to seek substantive, wholesome real answers and to avoid the\nflights into inanity and indeed insanity that are the stuff of the script\nwriters here and the obvious preference of the two characters in the play.\n\nAlthough pitted in discussion at some frivolous and superficial level as\nseemingly at times even antagonistic towards each other, rather than showing\ncomplete deference to what is being said by the character &quot;Andre&quot;, the fact is\nthat fundamentally these two individuals are altogether on the same wavelength\nat the most basic levels of relating to other human beings in their midst -\ndespite a major difference in the level of the facade and style of relating as\nit were. That said, we see in the movie script that this difference in style\ndoes cause differences to occur and to crop up between them in what they say to\neach other. What is more worth noting is that the level of conversation they\nare both engaged in is certainly the stuff of their own genre in the way of\nevolutionary development. What I mean to say is that they are not people of the\ngenre who have the intuitive sort of wisdom that one might associate with\nhumanistic philosophy, based on the very obvious statements and manner in the\npresentation thereof, and of course in the level of tolerance of such views.\n\nAs such the intelligence in their conversation, such as it is, is at all times\na contrivance, an attempt to create a different reality from what it is that\ninvolves normal human functioning, and different modes and fantasies of escape\ninto the inane, with admitted schizophrenic like symptoms being experienced\nalong the way as is disclosed by the character in the play named &quot;Andre&quot; played\nby Andre Gregory himself (the writer in addition). In these flights into the\ninane, the seeming ability to generate a thought, of any real meaning in terms\nof having true validity and real value, (in a sane sort of way) seems to\ncommand the entire scope of the movie as a way of suggesting that the level of\nanalysis of issues (of these types of characters), in and of itself, of what is\nnormal, the perversion of it somehow into something inane, a differing from\nwhat is normally intuitive, that this all amounts to wisdom of sorts and even\nbrilliance. At some point in the conversation, the characters cannot agree to\nhold to this sort of ridiculous philosophizing even between themselves, and\nmainly it becomes clear that they have been engaged in what Socrates would\nrefer to as the stuff of sophists rather than philosophers in true fashion.\nAs such, I beg to differ with the description in a torrent description on the\ninternet that describes the movie as &quot;brilliant, brilliant' (an obvious\nreference to the characters in the movie individually, and those that are cut\nfrom the same cloth (who would make such supportive comments) no doubt.\n\nInstead, I suggest that all thinking people, should have this movie and make it\nas widely available to others as possible, as a way to put others on guard\nagainst a form of charlatanism. The perpetration of inanity cloaked and dressed\nup as intellectual genius because the manner of the person expressing it seems\nto suggest that they have that opinion of themselves. the opinion is invalid as\nI think anyone with an intelligent mind listening to this trash would have to\nagree. In any event, &quot;en guarde&quot; as they say in fencing as that is the best way\nto be in the presence of the inane. I have to agree, I cannot replace my\nreality by a resort to a journey to the Himalayas in order to find &quot;in the\nmountains, a better wisdom than there is in the West&quot;. that is a statement made\nin the movie by the other main actor Wallace Shawn (also co-writer on the\nproject), and I am on side with the sentiment altogether, although I somehow\ndoubt his veracity in making the comment as I read his views and disposition on\nthings in totality.\n\n\nMichael Rizzo Chessman\n","torrent":{"xt":"urn:btih:7f6f7ca500f575de1ba99fc21f803e36a2d0a8e5","amp;dn":"My+dinner+with+Andre+%28720+X+480%29+DivX+French+Spanish+subs","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7f6f7ca500f575de1ba99fc21f803e36a2d0a8e5","infoHashBuffer":{"type":"Buffer","data":[127,111,124,165,0,245,117,222,27,169,159,194,31,128,62,54,162,208,168,229]},"announce":[],"urlList":[]}}