{"title":"SubGenius - Revelation X The BOB Apocryphon (.pdf)","uid":14687686,"size":435881954,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7fe61c959e0d76aab1eb9e84dada9895c63d5971&amp;dn=SubGenius+-+Revelation+X+The+BOB+Apocryphon+%28.pdf%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":1,"time":1464156911,"description":"*** ABOUT THE BOOK ***\r\n\r\nTitle:   Revelation X: The 'Bob' Apocryphon: Hidden Teachings and Deuterocanonical Texts of J.R. 'Bob' Dobbs\r\n\r\nAuthor: The SubGenius Foundation. Inc \r\nPublished: 1994\r\n\r\n&quot;Bob&quot; has kept the secret well hidden, however there are those of us who have come to figure it out for ourselves. Prior to the New Testament, the Koran, the Book of Ulvolva (ancient text of Atlantis), the Book of Zen, the Zoroastrian Scripture, the Talba, the Tonka, the Willy Wonka, and the Sears Roebuck catalog-- we have, written in the time of Ancient Maldaistheregasinthecar (formerly Rowwanda East of Gucci), a holy text. If you have mastered the Tao of Jeet Condo, then perhaps you are ready for the Apocryphon.\r\n\r\nBob has encrypted the actual `date of text.' In fact, within the Apocryphon are the architectural plans to the Ark of Noah, the Leaning Tower of Pizza (hold the anchovies), the Great Wall of China, the Ronald Reagan Presidential Library, and the electrical schematics for the Univac, the Cadillac, and the Rayovac--- all encrypted. Not to mention a fascinating `Table of Elements' containing over 92 undiscovered elements and a killer Betty Cronkyte chocolate chip cookie recipe.\r\nBob knows, and perhaps with some basic instruction and years of grueling practice, you too could know. Keep in mind that the Apocryphon doubles as both a CPRRPMWPM and an MFCCOICSOIC manual. Having the knowledge, as Bob warns, is half the battle. Knowing just what to do with having the knowing of every aspect of everything and everything in-between everything in and of itself is besides the point. However, despite these dichotomic delemmic conundrums one must insist the practice itself is beyond the ability of even the most skilled novice. Therefore Bob suggests that perhaps the reading of the Apocryphon backward could produce more or less understanding of the meaninglessness of the attempt not to do so.\r\nUsing the Apocryphon I have gained enlightenment and understand that, had I not pursued these truths, I would have undoubtedly overcome. Thank you Bob for being there, even when I did not need you, and thank you also for your wisdom and arrogance.\r\n\r\n\r\nSummary: \r\nFor those who didn't get enough &quot;Bob&quot; out of the original Book of the SubGenius, Revelation X provides more of the same. If anything, this book is more pointed and trenchant than its predecessor. Having watched as hundreds of zinesters, graffiti artists, and Hollywood hipster wanna-bes ripped off their imagery and ideas, the SubGenii have gained even more insight into the wretchedness of the human need to follow rather than create. Encouraging this tendency in others while also making a buck off of it, the SubGenii have produced a well-aimed and painfully funny volume that parodies religion, the cult of cool, the notion of an underground, and the very idea of selling out.\r\n\r\nIts hour come round at last: the prophesied do-it-yourself end times religion for swinging mutants and terminal abnormals! Eternal Salvation- or triple your money back. Beyond science, reason, and orgasm. Instant instructions for those who follow no master! Scarier than the Old Testament and Scientology put together! More needlessly complicated than the Qabbalah! More vague and ambiguous than the I Ching or astrology! More sheer, brazen hogwash than even the Book of Mormon-- yet infinitely more accurate than Project Bluebook and the Warren Commission Report-- combined! Authorized to blaspheme by the gods themselves! Compatible with all major world religions and most weird fringe cults with a minimum of expensive interfaces or messy surgery.\r\n\r\n\r\n# of pages: 208\r\nFormat: pdf\r\nSize: 415mb\r\nPublisher: Fireside; 1st edition (December 1, 1994)\r\nLanguage: English\r\nISBN-10: 0671770063\r\nISBN-13: 978-0671770068\r\nResolution: 11 x 8.5\r\nData Capture Rate: 700 dpi\r\nQuality: Med","torrent":{"xt":"urn:btih:7fe61c959e0d76aab1eb9e84dada9895c63d5971","amp;dn":"SubGenius+-+Revelation+X+The+BOB+Apocryphon+%28.pdf%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7fe61c959e0d76aab1eb9e84dada9895c63d5971","infoHashBuffer":{"type":"Buffer","data":[127,230,28,149,158,13,118,170,177,235,158,132,218,218,152,149,198,61,89,113]},"announce":[],"urlList":[]}}