{"title":"Classic Star Wars [1992-94]","uid":8052168,"size":176708804,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:8134b9de1581ebafbdbbf16a2582bf8092c88c10&amp;dn=Classic+Star+Wars+%5B1992-94%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Ketaros","files":20,"time":1358879822,"description":"Classic Star Wars (1992)\n\nPublisher: Dark Horse Comics\nPublication Date: August 1992 - March 1994\nCountry: United States\nLanguage: English \n\n\nNotes: \nDark Horse's use of the term &quot;Classic Star Wars&quot; is confusing, to say the least. While it generally means &quot;anything that Marvel did&quot;, it really means &quot;anything anyone else did&quot;.\nThe nature of the license granted by LucasLicensing, then LucasBooks, was that virtually anything comics related that appeared in the North American market could potentially be reprinted by Dark Horse. Thus, even things like the syndicated newspaper comic strips were potential subjects for reprinting.\n\nHence we have here the reprinting of the original Williams/Goodwin syndicated strips, which appeared in nationwide syndication the couple of years following the release of Episode IV. . They are re-formatted so as to make the story lines more coherent. They are also colored for the first time. Some &quot;clean-up&quot; artwork was done, as well as a small amount of original artwork.\n\nIt should be pointed out that these strips weren't directly connected to the continuity of the Marvel books, which were originally published at about the same time. However, as the early Marvel Star Wars was headlined by Goodwin and Williamson, the strips and comic book issues do fit together pretty well. Of course, as with all this early Star Wars, they are somewhat inconsistent with the overall Star Wars time line today, in the light of Episode III, than they would've at the time of first publication. \n\nNumber of files: 20 (COMPLETE!)\nFile Format: CBR","torrent":{"xt":"urn:btih:8134b9de1581ebafbdbbf16a2582bf8092c88c10","amp;dn":"Classic+Star+Wars+%5B1992-94%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8134b9de1581ebafbdbbf16a2582bf8092c88c10","infoHashBuffer":{"type":"Buffer","data":[129,52,185,222,21,129,235,175,189,187,241,106,37,130,191,128,146,200,140,16]},"announce":[],"urlList":[]}}