{"title":"The Ruby In The Smoke - Billie Piper formerly of Doctor Who","uid":4158147,"size":734712935,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:8177c94daaa0c33562b791631e2e3ee62f555fa6&amp;dn=The+Ruby+In+The+Smoke+-+Billie+Piper+formerly+of+Doctor+Who&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"circlensess","files":3,"time":1209244318,"description":"Plot Summary:\nIn Victorian England, Sally Lockhart receives an anonymous note sending her on a mysterious quest.\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0498382/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0498382/&lt;/a&gt;\n\nIn Victorian England, Sally Lockhart receives an anonymous note sending her on a mysterious quest. Her father has recently died and feeling suffocated living with her elderly aunt moves in with newfound friends, a photographer and his sister. She is soon made aware that the mysterious Mrs. Holland is out to kill her. In the end, she realizes the solution to the mystery is rooted in events that occurred long ago when she lived with her father in India and a recurring dream she has had ever since. Written by garykmcd\n\nDisjointed but ravishing production, 7 December 2006\nAuthor: isabella_deste from United Kingdom \n\nI have not read the books (heresy!) so I watched this with an open mind. The narrative is rather confusing - or rather, it makes sudden jumps in logic and you have to jump with it and not question things, otherwise you might get a bit frustrated. There are a lot of false endings too - you keep thinking its all over when something else happens. In terms of casting - JJ Field has a lovely voice. He sometimes looks like Jude Law, in certain lights, but some might find him a little on the geeky side for their romantic hero. Mrs. Holland is very very sinister. Julie Walters is a fabulous grotesque. Wonderful sets - really atmospheric. Especially the opium den. Billie Piper made a pretty good heroine, though I don&amp;#039;t think Victoriana is the right period for her looks. Her accent rings false from time to time, but overall a convincing bit of acting.","torrent":{"xt":"urn:btih:8177c94daaa0c33562b791631e2e3ee62f555fa6","amp;dn":"The+Ruby+In+The+Smoke+-+Billie+Piper+formerly+of+Doctor+Who","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8177c94daaa0c33562b791631e2e3ee62f555fa6","infoHashBuffer":{"type":"Buffer","data":[129,119,201,77,170,160,195,53,98,183,145,99,30,46,62,230,47,85,95,166]},"announce":[],"urlList":[]}}