{"title":"The Delights of Wisdom Pertaining to Conjugal Love - Swedenborg","uid":4288710,"size":859758,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:81e2774ae0ef28d34bf747d52d494bd808c5de11&amp;dn=The+Delights+of+Wisdom+Pertaining+to+Conjugal+Love+-+Swedenborg&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"CuriousGeorge","files":1,"time":1215824136,"description":"Emanuel Swedenborg devotes a large part of his work Conjugial Love to a searching analysis of the differences between men and women, both in mind and in body. To greatly simplify his view of the real differences between a man and a woman: a man has intelligence on the surface and love beneath whereas a woman has love on the surface and intelligence beneath.\n\nSo men and women are different but complementary and can bond together at a deep interior level as well as at the natural or physical level, driven by their love for each other.\n\nConjugial Love opens with an amazing account of a series of angelic discussions in the spiritual world before launching into the following:\n\n \n\nMARRIAGES IN HEAVEN\n\nThe existence of marriages in the heavens is incredible to those who believe that after death a person becomes a soul or spirit, if their concept of a soul or spirit is that of a tenuous ether or breath. So too it is to those who do not believe that a person can live as a person again until after the day of the Last Judgment, and generally speaking to those who know nothing about the spiritual world, where angels and spirits live, and where the heavens and hells are. Since this world has so far remained unknown, and there is utter ignorance of the fact that the angels of heaven are completely human in form, and likewise the spirits of hell, though less completely human, any revelation about marriages has been impossible. For people would say, &amp;#039;How can a soul be united with a soul?, or a breath with a breath, as husband and wife are united on earth?&amp;#039; And many more things which, the moment they were uttered, would destroy and scatter belief in marriages there.\n\nNow, however, that many revelations have been made about the spiritual world, and its nature has been described in my books HEAVEN AND HELL and THE APOCALYPSE REVEALED, it is possible to present also arguments in confirmation of the existence of marriage there, even for reason to grasp, as follows:\n\n(i) A person lives on as a person after death.\n\n(ii) A male is then male and a female is female.\n\n(iii) Each person retains his own love after death.\n\n(iv) The chief love is sexual love; and in the case of those who reach heaven, that is, those who become spiritual on earth, it is conjugial love.\n\n(v) These facts have been fully confirmed by eye-witness.\n\n(vi) Consequently there are marriages in the heavens.\n\n(vii) The Lord&amp;#039;s statement that after the resurrection people are not given in marriage refers to spiritual weddings.\n\nThese arguments will now be developed in sequence. ","torrent":{"xt":"urn:btih:81e2774ae0ef28d34bf747d52d494bd808c5de11","amp;dn":"The+Delights+of+Wisdom+Pertaining+to+Conjugal+Love+-+Swedenborg","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"81e2774ae0ef28d34bf747d52d494bd808c5de11","infoHashBuffer":{"type":"Buffer","data":[129,226,119,74,224,239,40,211,75,247,71,213,45,73,75,216,8,197,222,17]},"announce":[],"urlList":[]}}