{"title":"Jonathan Holloway - The Kane Conspiracy (BBC)","uid":7010501,"size":54247849,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:83e24a15a85c77f8aacfe5869a255076f7a3d84b&amp;dn=Jonathan+Holloway+-+The+Kane+Conspiracy+%28BBC%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"fakeplastictrousers2","files":-1,"time":1328436361,"description":"The Kane Conspiracy\n\nFrom BBC Radio 4. Written by Jonathan Holloway; Full-cast dramatisation.\n\nIn 1941 Orson Welles' film Citizen Kane, now regularly voted top in critics' and audience polls, picked up nine Oscar nominations and was already being spoken of as a work of genius. But there were powerful forces lobbying hard against it, not least among them William Randolph Hearst, the media mogul on whom the story is based, and FBI supremo J Edgar Hoover.\n\nAs the Oscar nominations are announced, Welles suffers an uncharacteristic attack of anxiety. And not without cause: FBI supremo J.Edgar Hoover has tasked a small-time FBI agent, Special Agent RB Wood, with making sure the film doesn't triumph at the Oscars ceremony. Hearst has banned any mention of the film across his media empire, RKO, the distributor, is looking shaky, and while the movie plays to capacity houses in art-house cinemas, no major theatres or cinema chains will take it. A chance encounter in an elevator leads to a highly charged head-to-head between Hearst and Welles when the two men lay their cards on the table. At the ceremony in February 1941 the film only wins one Oscar, and Welles' reputation in America never recovers.\n\nOnly the character of Agent Wood is imagined, although he is based on a documented but shadowy figure mentioned in the FBI archives. And it is Wood who finally confronts Welles with the uncomfortable truth about the film: in hijacking Hearst's life for Citizen Kane, Welles has replaced it with his own.\n\nOrson Welles.........Jeff Harding\nJ. Edgar Hoover........Toby Jones\nHerman Mankiewicz.....John Guerrasio\nWilliam Randolph Hearst...Peter Marinker\nGeorge Schaefer.......Garrick Hagon\nAgent Wood..........Val Jobara\nRadio Interviewer.......Paul Mundell","torrent":{"xt":"urn:btih:83e24a15a85c77f8aacfe5869a255076f7a3d84b","amp;dn":"Jonathan+Holloway+-+The+Kane+Conspiracy+%28BBC%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"83e24a15a85c77f8aacfe5869a255076f7a3d84b","infoHashBuffer":{"type":"Buffer","data":[131,226,74,21,168,92,119,248,170,207,229,134,154,37,80,118,247,163,216,75]},"announce":[],"urlList":[]}}