{"title":"THE CHRONICLES OF CONAN - VOLUME 16 and 17 (2008-2009) (Dark Hor","uid":9145028,"size":325269997,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:84ac0502d76d84c1e0a0e27fb017896a07e2d4a1&amp;dn=THE+CHRONICLES+OF+CONAN+-+VOLUME+16+and+17+%282008-2009%29+%28Dark+Hor&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"STFmaryville","files":-1,"time":1383577759,"description":"Chronicles of Conan Vol. 16: The Eternity War and Other Stories TPB\n\n* Since rekindling the Conan franchise in 2004, sales of Dark Horse Conan books are over one-quarter of a million copies!\n\n* Volume 16 features a foreword by J.M. DeMatteis and an afterword by Roy Thomas!\n\n* Features a portion of J.M. DeMatteis's first year as a regular writer on Conan and two riveting Conan Annual stories written by Roy Thomas!\n\n* Beautifully remastered in breathtaking new color!\n\nFollowing a renowned writer like Roy Thomas was no easy task, but J.M. DeMatteis (Justice League, Spider-Man, Moonshadow) found himself fit for the job when he became Conan the Barbarian's next regular writer with Conan #118! This volume continues the period when DeMatteis worked with legendary artist John Buscema, collecting five of their regular series issues, as well as Conan Annuals 4 and 5, which were created by Roy Thomas, John Buscema, and Ernie Chan!\n\nEnjoy the continuing story lines, growing cast of characters, and increasingly strange sorcerers and monsters in the regular series segments, while getting a look at an older Conan's fight for his throne and queen in the unbeatable Thomas/Buscema/Chan Conan Annual collaborations: &quot;The Return of the Conqueror&quot; and &quot;Bride of the Conqueror&quot;!\n\nWriter: J.M. DeMatteis, Roy Thomas\nArtist: John Buscema, Ernie Chan, Bob McLeod\n\nGenres: Fantasy, Action/Adventure\nPublication Date: November 19, 2008\nFull Color, 192 pages, Trade Paperback\nPrice: $16.95\nAge range: 16 and up\n\n------\n\nChronicles of Conan Volume 17: The Creation Quest and Other Stories TPB\n\nSpecial 240-page Gil Kane collection!\n\nSince rekindling the Conan franchise in 2004, Dark Horse has sold over 300,000 Conan graphic novels!\n\nThe incomparable Gil Kane (Green Lantern, Amazing Spider-Man, Blackmark) is featured in this special 240-page Chronicles of Conan volume-our thickest offering yet!\n\nJoining storyteller J.M. DeMatteis on Conan the Barbarian #127, Gil Kane's short but stellar Conan run in 1981 and 1982 thrust readers into a new era of magical quests, strange creatures, and inventive fantasy adventures. In Chronicles of Conan: The Creation Quest and Other Stories, Kane collaborates with DeMatteis, Bruce Jones, and longtime colleague Roy Thomas. In addition to a DeMatteis introduction -- an engaging, behind-the-scenes look at his years working on Conan-Roy Thomas provides another insightful afterword, as he discusses working with Gil Kane on their 38-page &quot;King of the Forgotten People!&quot; collaboration.\n\nIn addition to the &quot;Creation Quest&quot; story arc, readers will enjoy the meticulously restored color pages found in &quot;The Ring of Rhax,&quot; &quot;A Hitch in Time,&quot; and the heartbreaking &quot;Snow Haired Woman of the Wastes&quot; -- where Robert E. Howard's mighty barbarian finds himself unraveling horrific mysteries and testing his thresholds of pain and mental fortitude!\n\nWriters: Roy Thomas, J.M. DeMatteis, Bruce Jones\nArtists: Gil Kane, Ernie Chan\n\nGenres: Fantasy, Action/Adventure\nPublication Date: April 01, 2009\nFull Color, 240 pages, Trade Paperback\nPrice: $17.95\nAge range: 16 and up\n","torrent":{"xt":"urn:btih:84ac0502d76d84c1e0a0e27fb017896a07e2d4a1","amp;dn":"THE+CHRONICLES+OF+CONAN+-+VOLUME+16+and+17+%282008-2009%29+%28Dark+Hor","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"84ac0502d76d84c1e0a0e27fb017896a07e2d4a1","infoHashBuffer":{"type":"Buffer","data":[132,172,5,2,215,109,132,193,224,160,226,127,176,23,137,106,7,226,212,161]},"announce":[],"urlList":[]}}