{"title":"Superchick - 2002 - Last One Picked","uid":4874696,"size":41895655,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:851668ba560d317127a40ac8ee02a1ccdc98fb03&amp;dn=Superchick+-+2002+-+Last+One+Picked&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"TorrentTracts","files":11,"time":1241062617,"description":"Superchick - 2002 - Last One Picked\n\n\nTRACK LISTING:\n\n01 - High School\n02 - Real\n03 - One And  Lonely\n04 - So Bright (Stand Up)\n05 - Hero\n06 - Na Na\n07 - Song 4 Tricia (Princes And Frogs)\n08 - Wonder (If She'll Get It)\n09 - I Belong to You\n10 - Rock Stars\n11 - We All Fall\n\n\n\nADDITIONAL INFORMATION:\n\nSuperchic[k] took the Christian music scene by surprise with their runaway hit debut record Karaoke Superstar. A female-fronted garage band with a style about as stable and consistent as Dr. Jekyll, Superchic[k] came to be featured in nearly 40 TV shows/movies and even snagged a spot on the Legally Blonde film soundtrack last year. In 2002, Superchic[k] offers up the second effort, this time a little smarter and with a lot more to offer. \n\nThe record opens with the group's signature sound on &quot;High School,&quot; a song that pokes fun at adults who can't leave the petty politics of the teen years in high school where they belong. &quot;Real,&quot; a response to a frustrated 12 year old girl's struggle with fitting in is musically driven by aggressive guitars and vocal melodies (something lead singer Tricia sadly stays clear of most of the time). &quot;One and Lonely&quot; continues the theme of the record and addresses the days insecurity gets the best of us. &quot;There are days when it's hard to be yourself,&quot; founding member Max Hsu explains in a recent bio. &quot;Those days will always come, but we can have faith knowing those days will in fact end.&quot; While a lot of the topics Superchic[k] addresses, and they way they address them, are geared towards teens, they're topics people don't usually stick their necks out to talk about. Superchic[k] obviously sees this and covers them on the appropriately titled Last One Picked. \n\n&quot;So Bright (Stand Up)&quot; is a pop anthem Superchic[k]-style encouraging listeners to get up out of their comfort zones and make a difference with their life. &quot;Hero&quot; is a highlight, as the brutally honest and heart-wrenching pop track urges students to be more conscious of their actions and the feelings of those around them. Max explains, &quot;Think about scenarios in which a kid gets to the point where his only options are to kill himself or kill everyone at school. You can look back, and there are points in his life in which someone taking interest or not messing with his brain might have changed future history. It's a drastic example, but we are trying to drive home that how your act at school matters. Who you are matters. How you treat other people matters.&quot; A humbling and sobering thought. How true this song is and major props to Superchic[k] in addressing it. \n\n&quot;Wonder&quot; is a humorous tongue-in-cheek look at how easily some people fall in &quot;love&quot; with people they don't know or celebrities based on infatuation. &quot;I Belong to You&quot; is an acoustic worship song about finding God in the lowest points of our lives. &quot;Rock Star&quot; points out the fact that not everyone has to be famous or &quot;glamourous&quot; rock stars. &quot;We All Fall&quot; is a beautiful piano ballad encouraging that we need to just get up and move on when we make mistakes. \n\nNot a project for everyone, but a giant leap from their debut, Last One Picked is lyrically brilliant and musically fun, reaching out to teens and speaking to them right where they're at. Last One Picked is a must-have for anyone who's ever felt they just don't measure up sometimes. \n\n\n\nTORRENTED BY:\n\nTorrent Tracts, April 2009\n","torrent":{"xt":"urn:btih:851668ba560d317127a40ac8ee02a1ccdc98fb03","amp;dn":"Superchick+-+2002+-+Last+One+Picked","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"851668ba560d317127a40ac8ee02a1ccdc98fb03","infoHashBuffer":{"type":"Buffer","data":[133,22,104,186,86,13,49,113,39,164,10,200,238,2,161,204,220,152,251,3]},"announce":[],"urlList":[]}}