{"title":"Bananarama - Venus [Top of the Pops 1986].VOB","uid":6103495,"size":109015040,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:854bb69240d58a187920384db0d67ff2305a8809&amp;dn=Bananarama+-+Venus+%5BTop+of+the+Pops+1986%5D.VOB&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"SgtRlee","files":-1,"time":1295070147,"description":"Bananarama - Venus [Top of the Pops 1986].VOB\n\n\nVery HQ rare &quot;Top of the Pops&quot; tv show promo performance. Top of the Pops, also known as TOTP, is a music chart television program, made by the BBC and originally broadcast weekly from 1 January 1964 to 30 July 2006.\n\nEach weekly program consisted of performances from some of that week's best-selling popular music artists, with a rundown of that week's singles chart. Additionally, every year there was a special edition of the program on Christmas Day featuring some of the best-selling singles of the year.\n\n&quot;Venus&quot; is a 1969 song by the Dutch band Shocking Blue which the group took to number one in the U.S. and five countries across Europe in 1970. Notably covered by girl group Bananarama, the song returned to number one in the U.S. and topped the charts in six other countries around the world in 1986.\n\n&quot;Venus&quot; had been a part of Bananarama's repertoire for several years before they actually recorded it. The team's three members, Sara Dallin, Siobhan Fahey, and Keren Woodward, had the idea of turning the song into a dance music tune, but they were met with resistance from their producers at the time, Steve Jolley and Tony Swain. Bananarama brought the idea to the production trio of Stock Aitken Waterman, and it became Bananarama's first collaboration with them.\n\nDallin, Fahey, and Woodward had nearly completed recording their third album, titled True Confessions, with Jolley and Swain. Stock, Aitken and Waterman also resisted the idea because they believed that &quot;Venus&quot; would not make a good dance record. After persistence by the women, SAW relented, and the result was a worldwide smash. Bananarama's &quot;Venus&quot; went to number one in the U.S., Canada, Australia, New Zealand, Switzerland, Mexico, and South Africa. It hit number two in Germany and Hong Kong and was a top ten success in Italy, Austria, Belgium, Finland, France, Netherlands, Sweden, Venezuela, Norway, Portugal, Spain, and their native UK (#8 on UK Singles Chart). It also went to number one for two weeks on the U.S. Dance chart.\n(video does not have any logos)\n\n\n    &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/True_Confessions_(album)&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/True_Confessions_(album)&lt;/a&gt; \n      &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Top_of_the_Pops&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Top_of_the_Pops&lt;/a&gt; \n      &lt;a href=&quot;\nhttp://bayimg.com/EaDNOaADE&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/EaDNOaADE&lt;/a&gt; \n   \n\n\nFile properties info using Media Player Classic:     \n   Video: MPEG2 Video 720x576 (4:3) 25.00fps 6790kbps\n   Audio: Dolby Digital AC3 48000Hz stereo 256kbps\n   Duration: 00:03:07\n\n\n\n\n*Install the &quot;Media Player Classic&quot; player if you can't play this file, \nor for better visual and audio quality playback of all your videos. \nIt's 100% free to download and use. Just updated September 7, 2010!\n\n*Media Player Classic Home Cinema*        &lt;a href=&quot;\nhttp://mpc-hc.sourceforge.net/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://mpc-hc.sourceforge.net/&lt;/a&gt; \n\nSgtRlee (Sgt.R.Lee) \n","torrent":{"xt":"urn:btih:854bb69240d58a187920384db0d67ff2305a8809","amp;dn":"Bananarama+-+Venus+%5BTop+of+the+Pops+1986%5D.VOB","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"854bb69240d58a187920384db0d67ff2305a8809","infoHashBuffer":{"type":"Buffer","data":[133,75,182,146,64,213,138,24,121,32,56,77,176,214,127,242,48,90,136,9]},"announce":[],"urlList":[]}}