{"title":"Clifford D. Simak - Over the River and Through the Woods - Unb","uid":4950983,"size":215216879,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:85a930e4a64d5d444c6e6951219bc865bf9d15b1&amp;dn=Clifford+D.+Simak+-+Over+the+River+and+Through+the+Woods+-+Unb&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"RamJamSam","files":7,"time":1244888713,"description":"Clifford D. Simak - Over the River and Through the Woods - Unb\nRead by: J.P. Lincoln\nRuntime: 7 Hours and 28 Minutes\n\n\n\n&quot; He wrote for so long and always so well that his excellence came to be taken for granted, as we take sunlight for granted until we go blind.&quot;\nPoul Anderson  \n\n\n &quot;I always loved his stories, short or long. He made me love them -and the rural America of his childhood - as much as he did.&quot;\nLester del Rey  \n\n\n &quot;Good fantasy - and that includes science fiction - takes off from the known for its flights into the new. Cliff Simak was a master of the art. His known was the rural Midwest that he loved. His new could reach to the ends of space and time, but never beyond reality. Even his cosmic aliens always had half human dimensions that made them believable. I loved him, as so many did, for his unfailing warmth and a wit that was keen but never cruel. I heard from him often during the painful time after his wife's death. His own death touched me deeply, and I'm happy to see him remembered with this collection of his best-loved stories.&quot;\nJack Williamson  \n\n\n &quot;Without Simak, science fiction would have been without its most humane element, its most humane spokesman for the wisdom of the ordinary person and the value of life lived close to the land.&quot;\nJames E Gunn  \n\n\n &quot;I read Cliff's stories with particular attention, and I couldn't help but notice the simplicity and directness of the writing - the utter clarity of it. I made up my mind to imitate it, and I labored over the years to make my writing simpler, clearer, more uncluttered, to present my scenes on a bare stage&quot;\nIsaac Asimov  \n\n\n&quot;To read science fiction is to read Simak. The reader who does not like Simak stories does not like science fiction at all.&quot; \nRobert Heinlein\n\n \n\nClassic stories of science fiction by this Nebula Grandmaster award-winner.\n\nContents: A Death in the House,The Big Front Yard, Goodnight Mr. James, Dusty Zebra, Neighbor Over the River &amp; Through the Woods, Construction Shack, Grotto of the Dancing Deer\n\n\n\nGooD SeeDinG!\n\n","torrent":{"xt":"urn:btih:85a930e4a64d5d444c6e6951219bc865bf9d15b1","amp;dn":"Clifford+D.+Simak+-+Over+the+River+and+Through+the+Woods+-+Unb","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"85a930e4a64d5d444c6e6951219bc865bf9d15b1","infoHashBuffer":{"type":"Buffer","data":[133,169,48,228,166,77,93,68,76,110,105,81,33,155,200,101,191,157,21,177]},"announce":[],"urlList":[]}}