{"title":"The Pleasures of Reading in an Age of Distraction","uid":6653383,"size":604106,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8623b6a3d9a25f998c2e55563dabd93eea1fcff2&amp;dn=The+Pleasures+of+Reading+in+an+Age+of+Distraction&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bookzilla","files":1,"time":1315239307,"description":"In recent years, cultural commentators have sounded the alarm about the dire state of reading in America. Americans are not reading enough, they say, or reading the right books, in the right way. In this book, Alan Jacobs argues that, contrary to the doomsayers, reading is alive and well in America. There are millions of devoted readers supporting hundreds of enormous bookstores and online booksellers. Oprah's Book Club is hugely influential, and a recent NEA survey reveals an actual uptick in the reading of literary fiction. Jacobs's interactions with his students and the readers of his own books, however, suggest that many readers lack confidence; they wonder whether they are reading well, with proper focus and attentiveness, with due discretion and discernment. Many have absorbed the puritanical message that reading is, first and foremost, good for you--the intellectual equivalent of eating your Brussels sprouts. For such people, indeed for all readers, Jacobs offers some simple, powerful, and much needed advice: read at whim, read what gives you delight, and do so without shame, whether it be Stephen King or the King James Version of the Bible. In contrast to the more methodical approach of Mortimer Adler's classic How to Read a Book (1940), Jacobs offers an insightful, accessible, and playfully irreverent guide for aspiring readers. Each chapter focuses on one aspect of approaching literary fiction, poetry, or nonfiction, and the book explores everything from the invention of silent reading, reading responsively, rereading, and reading on electronic devices. Invitingly written, with equal measures of wit and erudition, The Pleasures of Reading in an Age of Distraction will appeal to all readers, whether they be novices looking for direction or old hands seeking to recapture the pleasures of reading they first experienced as children.\n\nOxford 2011","torrent":{"xt":"urn:btih:8623b6a3d9a25f998c2e55563dabd93eea1fcff2","amp;dn":"The+Pleasures+of+Reading+in+an+Age+of+Distraction","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8623b6a3d9a25f998c2e55563dabd93eea1fcff2","infoHashBuffer":{"type":"Buffer","data":[134,35,182,163,217,162,95,153,140,46,85,86,61,171,217,62,234,31,207,242]},"announce":[],"urlList":[]}}