{"title":"Whirlwind Over Vietnam CLONECD - AVENGED","uid":3670463,"size":1039987654,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:863b1b91612637e361bf51d832c844003f10078a&amp;dn=Whirlwind+Over+Vietnam+CLONECD+-+AVENGED&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Pathfind3r","files":7,"time":1177202753,"description":"What may come as a bit of a surprise is there is no other mode but Single Player. No way to jump right into action or create-a-mission. Nada. Zip. Zilch. And how many single player missions, you ask? A scant ten. However, each one can take a good hour to complete and are drawn directly from historical context - cool beans! For many, this time period was a true test of the new American military, having been quite a few years off since Korea, and was to test the new doctrine of helicopter troop transport/support never before seen, spearheaded by the infamous 7th Cavalry Division. As you fly about during the La-Drang Valley campaign of 1965, you will be tasked with a number of harrowing objectives such as seek and destroy, fire support, fire coordination, troop transport and more.\n\nYou can even jump around to different positions like Pilot, Gunner and Co-Pilot. Being the Gunner was always fun to break up the constant concerns of keeping your bird level and out of the trees - to just create death and destruction was glorious. Spraying away with the good ?ol door M-60 machine gun brought back many memories of great ?Nam movies like Platoon, We Were Soldiers, Full Metal Jacket, and Hamburger Hill, to name just a few. Often times your fellow Army and Marine forces will chip in with tanks, jeeps, planes (Skyraiders abound), or other helos (like the massive Chinook transport/utility chopper), providing much needed relief to your beleaguered comrades below. This approach to include various services really hits home with the realities of Vietnam after each mission. It?s surprisingly pretty simple to return to base and see how you did and proceed on to the next one.\n\nSome of the armaments besides the standard M-60 door gun are the XM-21 subsystem of M134 six-barrel machine guns (aka Gatling guns), HAP M158 seven-tube rockets, both controlled by either the pilot or co-pilot respectively. You can even zoom in using a nifty targeting scope to make sure you nail those enemy huts or riverboats. This armament is a bit lacking for fans of more whiz bang fireworks, but it is faithful to the era nonetheless and provides enough firepower to get the job done. Be warned however, your venerable Huey might be big and green, but it can?t stand up indefinitely to enemy fire. Realistic physics and internal systems are all modeled here, so take a critical hit to your fuselage and you could be eating dirt (or worse, playing Russian roulette in some P.O.W. camp?). In all, aircraft weight, load out, wind direction and more all affect the flight.  \n\n\n\nMinimum System Requirements:\n\nIntel Pentium 4 2.4 GHz\n\nVideo card with 128 Mb RAM (minimum Radeon 9600 or GeForce 6600) \n\n\n\n\n 1. Mount with the latest Daemon Tool 4        \n\n2. Install and use the included loader to play\n","torrent":{"xt":"urn:btih:863b1b91612637e361bf51d832c844003f10078a","amp;dn":"Whirlwind+Over+Vietnam+CLONECD+-+AVENGED","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"863b1b91612637e361bf51d832c844003f10078a","infoHashBuffer":{"type":"Buffer","data":[134,59,27,145,97,38,55,227,97,191,81,216,50,200,68,0,63,16,7,138]},"announce":[],"urlList":[]}}