{"title":"Democracy Now - 03 feb 2012","uid":7006661,"size":456864780,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:870bcc7134c4beac6a26513353d49d471c0c6383&amp;dn=Democracy+Now+-+03+feb+2012&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":1,"time":1328291050,"description":"An alternative daily newschannel. One hour with news as you do not see it elsewhere.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n\nHeadlines for Feb 03, 2012\n\n- Komen Officials Resign Over Planned Parenthood Controversy\n- Syria: U.N. Drops Call for Assad Resignation\n- Egypt: 4 Killed as Thousands Protest Soccer Deaths\n- Israel: Iranian Missiles Could Reach United States\n- Khmer Rouge Commander Gets Life Term\n- Trump Backs Romney Ahead of Nevada Caucus\n- SEC Issued Scores of Waivers to Wall Street Firms in Fraud Cases\n- Holder Takes Heat from Congress for &quot;Fast and Furious&quot; Weapons Sting\n- Yemeni Activists Protest Saleh's NYC Visit\n- Sierra Club Took $26 Million From Gas Industry\n- Report: U.S. More Than Doubles Names on No-Fly List\n\n\nSpecial reports\n\n- NYPD Muslim Spy Scandal Grows With Newly Revealed Plan to Target Shiite Mosques\n\nNew revelations have emerged about the New York City Police Department's secret program to spy on Muslim communities. The Associated Press has just uncovered a confidential NYPD plan from 2006 to engage in targeted surveillance of Shiite mosques following increased tensions between the U.S. and Iran; the latest revelation on its secret intelligence operations focused on Muslim neighborhoods. On Thursday a coalition of Muslim and civil rights organizations reiterated their call for the immediate resignation of NYPD Commissioner Ray Kelly. We're joined by reporter Matt Apuzzo, who has helped break the NYPD spying story for the Associated Press; and Imam Talib Abdur-Rashid, spiritual leader at the Mosque of Islamic Brotherhood and president of the Islamic Leadership Council of New York.\n\n\n- Occupy the Super Bowl: Indiana's New Anti-Union Law Sparks Protest at Sport's Biggest Spectacle\n\nOccupy protesters in Indianapolis are gearing up to use the media spotlight on Sunday's Super Bowl XLVI to rally for union rights outside the statehouse. Earlier this week, Indiana Gov. Mitch Daniels signed a so-called &quot;right to work&quot; measure into law that critics say will result in lower wages and diminished collective bargaining rights. Indiana workers have received the backing of the National Football League Players Association, which has called &quot;right to work&quot; &quot;a political ploy designed to destroy basic workers' rights.&quot; We're joined from Indiana by Tithi Bhattacharya, an associate professor of South Asian History at Purdue University and a protester who is taking part in Occupy the Super Bowl. &quot;It is absolutely shameful that the legislature passed a law that condemns unions and is now using the city to showcase Indianapolis while ordinary people in Indiana are completely opposed to this law,&quot; Bhattacharya says.\n\n\n- ICE Enabled East Haven Police's Racial Profiling By Detaining, Deporting Targeted Immigrants\n\nA new investigation by Colorlines has revealed that Immigration and Customs Enforcement continued to detain and deport individuals rounded up by the East Haven, Connecticut police, even after the Department of Justice launched its investigation into racial profiling. Four East Haven police officers have been arrested for targeting Latino immigrants with false arrests, false reports and harassment, prompting the East Haven police chief to resign. We're joined by Seth Freed Wessler, a senior research associate at the Applied Research Center and an investigative reporter for Colorlines.com. &quot;East Haven, Connecticut has a long history of profiling people of color,&quot; Freed Wessler says. &quot;Folks of color in the greater New Haven area know not to drive through East Haven, Connecticut: you're going to get pulled over if you're black or Latino.&quot;\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n","torrent":{"xt":"urn:btih:870bcc7134c4beac6a26513353d49d471c0c6383","amp;dn":"Democracy+Now+-+03+feb+2012","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"870bcc7134c4beac6a26513353d49d471c0c6383","infoHashBuffer":{"type":"Buffer","data":[135,11,204,113,52,196,190,172,106,38,81,51,83,212,157,71,28,12,99,131]},"announce":[],"urlList":[]}}