{"title":"Playing House 2014 COMPLETE Season 1 &amp; 2","uid":12420801,"size":3386991957,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:877de2d0f2c7d936a8aa182c3ee411068aa9b888&amp;dn=Playing+House+2014+COMPLETE+Season+1+%26amp%3B+2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":38,"time":1442303462,"description":"Playing House 2014 Complete Season 1 and Season 2 with English subtitles\n\nIMDB: tt2750182\n\nChildhood best friends Maggie Caruso (Lennon Parham, &quot;Best Friends Forever&quot;) and Emma Crawford (Jessica St. Clair, &quot;Best Friends Forever&quot;) have shared countless adventures growing up together in the charming town of Pinebrook, CT. Now, Maggie and Emma are in store for one of their biggest adventures-raising a baby. When Maggie discovers that her husband is having an online affair with a muscular German woman, Emma gives up her burgeoning business career in China to stay in their hometown and help Maggie raise her baby. Meanwhile, as Maggie prepares for the birth of her first child and the fallout of her marriage ending, Emma must confront the past that she abruptly left behind thirteen years ago -- her first love and local cop Mark, her prim-and-proper mother and a small town that she's never felt comfortable in. Despite their differences - Emma is brash, bold, and assertive while Maggie is grounded, rational, and safe - the women complement each other the way only best friends can, by facing the challenges of their past, present and future--together.\n\nStars: Lennon Parham, Jessica St. Clair, Keegan-Michael Key","torrent":{"xt":"urn:btih:877de2d0f2c7d936a8aa182c3ee411068aa9b888","amp;dn":"Playing+House+2014+COMPLETE+Season+1+%26amp%3B+2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"877de2d0f2c7d936a8aa182c3ee411068aa9b888","infoHashBuffer":{"type":"Buffer","data":[135,125,226,208,242,199,217,54,168,170,24,44,62,228,17,6,138,169,184,136]},"announce":[],"urlList":[]}}