{"title":"New X-Men - Academy X (001 - 046) (complete)","uid":8851138,"size":625595969,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:87a75f3df2098197bb67d02716b6c10f0282040c&amp;dn=New+X-Men+-+Academy+X+%28001+-+046%29+%28complete%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"nemesis43","files":47,"time":1377527426,"description":"New X-Men was a superhero comic book series published by Marvel Comics within the X-Men franchise. After the end of Grant Morrison's run on X-Men vol. 2 titled New X-Men, the title was used for a new series, New X-Men: Academy X. This series served as a continuation of the second volume of New Mutants. The title was later shortened to simply New X-Men.\n\nNew X-Men: Academy X was launched during the X-Men ReLoad event. It resumes directly where the most recent New Mutants series ended, with the same writers, artists, and cast of characters. The Academy X subtitle was dropped from the title when the new creative team of Craig Kyle and Christopher Yost took over the series with issue #20.\n\nWhereas the other X-Men comics mostly deal with established adult mutants, this series concentrates on the lives of young students residing at the Xavier Institute for Higher Learning as they learn to control their powers and, as of late, to survive the backlash against mutants that befell them as part of House of M.\n\nAfter the 2007 crossover X-Men: Messiah Complex, the New X-Men title was canceled and briefly relaunched as Young X-Men for 13 issues. The series was written by Marc Guggenheim. After the first arc of Young X-Men, the characters began appearing in the pages of Uncanny X-Men. With the cancellation of Young X-Men the characters were folded onto the main X-Men books, appearing most prominently in the pages of X-Men: Legacy and most recently, in Wolverine and the X-Men.","torrent":{"xt":"urn:btih:87a75f3df2098197bb67d02716b6c10f0282040c","amp;dn":"New+X-Men+-+Academy+X+%28001+-+046%29+%28complete%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"87a75f3df2098197bb67d02716b6c10f0282040c","infoHashBuffer":{"type":"Buffer","data":[135,167,95,61,242,9,129,151,187,103,208,39,22,182,193,15,2,130,4,12]},"announce":[],"urlList":[]}}