{"title":"POtHS - Creation - 53 - Creation Super Conference 2011","uid":7877574,"size":11892636075,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:88bf64b6481e53659226250a798776079abd5d97&amp;dn=POtHS+-+Creation+-+53+-+Creation+Super+Conference+2011&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"POtHS11","files":-1,"time":1354384767,"description":"POtHS - Creation 53\n\n\nCreation Super Conference 2011\n\n\nPOtHS Comments on This one......... There is truth here for all ages and beliefs. If Darwin was wrong...........then the Schools have been intentionally lying to our Children. If the schools teach Darwinism which says there is NO CHRIST. Then they are of The Anti-Christ. Public Schools teaching books CHANGE EVERY YEAR. The Bible never changes. So where is truth??? In Evolution Theories??? If you believe in Evolution you are denying The Father, The Son and The Holy Spirit of the Praise They are entitled too for making everything you understand and can see and more than that, everything you don't understand and can't see. If you have never thanked the CREATOR for his Creation now is your chance to thank Him.\n\nDescription:\n\nPOtHS - Creation - 53 - Creation Super Conference 2011\n\nThe 2011 Creation Super Conference:\nCreation Ministries International (CMI) is a Christian apologetics ministry dedicated to upholding the authority of the Bible by equipping Christians to defend their faith and enabling them to give answers to the questions many people have regarding science and the Bible.\n\nThe Bible is under attack:\nThe mantra of the 'new atheists' is that, since evolution is a fact, the Bible is wrong and there is no Creator to be accountable to. As a result, most Christians have questions about the accuracy of the Bible, especially Genesis and the creation/evolution issue.  With more PhD scientists on staff than any other Christian ministry, CMI speakers are more than qualified to help equip Christians to answer the tough questions brought against Biblical truths.  This multi-day conference will address all aspects of the creation/evolution issue in a fun, relaxing environment by experts in their field of study and ministry.\n\nA Key issue in the church today:\nThe creation/evolution debate is not something Christians can avoid or afford to ignore. Prominent Christian leaders agree.\n\n\n\n \nSeed long and Prosper with Blessings from our Father. I have prayed to The Father, Bless all that Seed Long. (I have 4 year old active seeds out there, must be working for some folks!)\n\nEphesians 5:11\n\n11 And have no fellowship with the unfruitful works of darkness, but rather reprove (expose) them.\n\n\n           \n     \n:thankyou:    :thankyou:     Thank You JESUS  \n\n\n \n","torrent":{"xt":"urn:btih:88bf64b6481e53659226250a798776079abd5d97","amp;dn":"POtHS+-+Creation+-+53+-+Creation+Super+Conference+2011","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"88bf64b6481e53659226250a798776079abd5d97","infoHashBuffer":{"type":"Buffer","data":[136,191,100,182,72,30,83,101,146,38,37,10,121,135,118,7,154,189,93,151]},"announce":[],"urlList":[]}}