{"title":"Jacqui Sussholz Yiddish is Forever / Jewish Songs","uid":3346373,"size":298973548,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:89324c5d1cb7f5592ad6566fb6430a47e59e8f3c&amp;dn=Jacqui+Sussholz+Yiddish+is+Forever+%2F+Jewish+Songs&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"tchouf","files":49,"time":1119195048,"description":"Yiddish is Forever / Jewish Songs /http://www.yiddish-is-forever.com\nJacqui Sussholz is full of surprises. He's a diamond dealer in Antwerp - and he sings like an angel. \nHe sings traditional Yiddish and Hassidic songs - with brilliant arrangements that transcend categories.. \nHe's proud to be Jewish - but he's reaching out to the world. He performs in English, French, Dutch,\nGerman, Hebrew - and, of course, Yiddish.\n \nJacqui is a born artist, a natural all-round performer who has recorded 3 CDs and created his own \none-man show Yiddish is Forever. \nHe sings, he tells stories, he can make you laugh, he can break your heart.. \nAnd everything he does, he does with passion; he lives each moment to the full. \nYou can sense that in every song he sings and every story he tells - hilarious monologues, \nWoody Allen style, about his own life. \nThe full stage show blends the music and the humour to create great entertainment: \nit has played to packed, enthusiastic audiences in Belgium, France and Germany .\nHe has now adapted a smaller-scale version for private functions, based on humorous stories of his \nexperiences in the diamond world. \n'It's doing great with all audiences' he says. \n'And I can put it on anywhere. So long as the technical backup - sound system, etc. - is professional'\n \nWhat's a diamond dealer doing in showbiz, you may ask? 'My mother's always asking that' Jacqui says. \n'You spend all your time and money on singing, she says. What will become of you? So I say, \n'Listen. Other guys in business, when they want a break, they drink, they gamble, they keep a fancy \nmistress somewhere. \nSo what should I do?' And she gives me a look and says, 'Sing, Jacqui, sing!&quot;\n \nAnd that's what he does - with a warmth and humanity that will touch the hearts of audiences \neverywhere.\n\n3 albums: Yiddish is Forever 1/2/3","torrent":{"xt":"urn:btih:89324c5d1cb7f5592ad6566fb6430a47e59e8f3c","amp;dn":"Jacqui+Sussholz+Yiddish+is+Forever+%2F+Jewish+Songs","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"89324c5d1cb7f5592ad6566fb6430a47e59e8f3c","infoHashBuffer":{"type":"Buffer","data":[137,50,76,93,28,183,245,89,42,214,86,111,182,67,10,71,229,158,143,60]},"announce":[],"urlList":[]}}