{"title":"Who is Muhammad (Peace Be Upon Him)?","uid":7091650,"size":5159195,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8972390bb863dd092dc34073e4f76d0b731c4fe6&amp;dn=Who+is+Muhammad+%28Peace+Be+Upon+Him%29%3F&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"iSky","files":-1,"time":1331386552,"description":"All Praise is due to Allah, the Lord of the Worlds, the [one Who] sustains the Heavens and Earths, Director of all that is created, who sent the Messengers (may the peace and blessing of Allah be upon all of them) to rational beings, to guide them and explain the religious laws to them with clear proofs and undeniable arguments. I praise Him for all His bounties. I ask Him to increase His Grace and Generosity. I bear witness that there is none worthy of worship except Allah alone, who has no partner, the One, Who Subdues, the Generous, the Forgiving. I bear witness that our leader Muhammad is His servant and Messenger, His beloved and dear one, the best of all creation. He was honoured with the Glorious Quran that has been an enduring miracle throughout the years.\nHe was also sent with his guiding Sunnah that shows the way for those who seek guidence. Our leader Muhammad has been particularized with the characteristic of eloquent and pithy speech, and simplicity and ease in the religion. May the peace and blessing of Allah be upon him, the other Prophets and Messengers, all if their families and the rest of the righteous.\n\n\nAddress: Who is Muhammad (Peace Be Upon Him)?\nLanguage: English\nFormat: PDF\nPages:  100\nFormation : Yusuf Estes\nReveiwers : Muhammad AbdulRaoof\nFrom issues : http://www.rasoulallah.net - Website of Rasoulullah (peace be upon him)\n\nShort Description: Prophet Muhammad, may the mercy and blessings of God be upon him, is the man beloved by more than 1.2 billion Muslims. He is the man who taught us patience in the face of adversity, and taught us to live in this world but seek eternal life in the hereafter. It was to Prophet Muhammad that God revealed the Quran. Along with this Book of guidance God sent Prophet Muhammad, whose behavior and high moral standards are an example to us all. Prophet Muhammad-s life was the Quran. He understood it, he loved it and he lived his life based on its standards. He taught us to recite Quran, to live by its principles and to love it. When Muslims declare their faith in One God, they also declare their belief that Muhammad is the slave and final messenger of God.\n\n\n\n   If you are seeking real Truth and Salvation like many \nothers before you, give Islam a try.","torrent":{"xt":"urn:btih:8972390bb863dd092dc34073e4f76d0b731c4fe6","amp;dn":"Who+is+Muhammad+%28Peace+Be+Upon+Him%29%3F","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8972390bb863dd092dc34073e4f76d0b731c4fe6","infoHashBuffer":{"type":"Buffer","data":[137,114,57,11,184,99,221,9,45,195,64,115,228,247,109,11,115,28,79,230]},"announce":[],"urlList":[]}}