{"title":"Ed Schultz Show - February 26 2013 ","uid":8199110,"size":45403236,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:8985a8b701d4c8bdb96122986f9abc6306696f3b&amp;dn=Ed+Schultz+Show+-+February+26+2013+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"480v","files":3,"time":1361979814,"description":"February 26, 2013\nThe Ed Schultz Show\n\n\nCol. Jack Jacobs, MSNBC Military Analyst, joins the 1st hour of Tuesday's show to discuss how the Sequestration cuts will affect military spending.\n\nSen. Bernie Sanders, I-VT, joins the 1st hour of Tuesday's show to discuss avoiding sequestration.\n\nHarold Schaitberger, General President of the International Association of Fire Fighters, joins the 2nd hour of Tuesday's show to discuss how the sequestration would affect first responders.\n\nCon. Gerald Connolly, D-VA, joins the 2nd hour of Tuesday's show to discuss the Sequester.\n\nCon. Debbie Wasserman-Schultz, D-FL, joins the 3rd hour of Tuesday's show to discuss avoiding the Sequestration cuts.\n\nKatrina vanden Heuvel, editor and part-Owner of the Nation, joins the 3rd hour of Tuesday's show to discuss the sequestration.\n\nThe White House escalated a campaign on Monday to convince Americans dire consequences await if government spending cuts go ahead on March 1, warning of a slowdown in global trade, a stalled fight against cancer and Alzheimer's disease and compromised security at U.S. borders. We'll give you the details.\n\nPresident Barack Obama will meet leading Senate Republicans John McCain and Lindsey Graham on Tuesday to discuss immigration reform efforts and could also delve into across-the-board spending cuts set to take effect on Friday. We'll talk about it.\n\nPresident Barack Obama is arguing that looming government-wide spending cuts could idle military resources like naval aircraft carriers, while Republicans are criticizing the president for taking his arguments outside Washington instead of staying to work out a plan before Friday's deadline. We'll bring you the latest.","torrent":{"xt":"urn:btih:8985a8b701d4c8bdb96122986f9abc6306696f3b","amp;dn":"Ed+Schultz+Show+-+February+26+2013+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8985a8b701d4c8bdb96122986f9abc6306696f3b","infoHashBuffer":{"type":"Buffer","data":[137,133,168,183,1,212,200,189,185,97,34,152,111,154,188,99,6,105,111,59]},"announce":[],"urlList":[]}}