{"title":"Glen Keane - Duet (Fan Pack)","uid":15767749,"size":151659301,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:89a87736c176d414ce8474c958102fdb973d07cc&amp;dn=Glen+Keane+-+Duet+%28Fan+Pack%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ADHDerby","files":17,"time":1473174182,"description":"Glen Keane - Duet (Fan Pack)\r\n\r\nA hand-drawn short by animation legend Glen Keane. Keane has crafted a touching story that chronicles the lives of two children, Tosh and Mia, as they grow into adults, weaving together their life stories through stunning animation. Initially created as an interactive experience for Google Spotlight Stories, the project evolved into a theatrical release. The magical music features vocals by Megan Slankard and Alexis Harte and a full string section recorded at Skywalker Sound in Marin County, Ca. Duet won an Annie Award nomination and has been shortlisted for a 2015 Academy Award in the Animated Short Film category.\r\n\r\nYou can download the interactive version for free from within Google ATAP’s Spotlight Stories app (Android &amp; iOS).\r\n\r\nI'm a big fan of this short, but all the versions at YouTube are derived from Google's I/O Conference and contain monitor noise.\r\nThis release contains the full theatrical release from another source (720p version from Pollen Music Group) without the static noise.\r\nIt's completely smartphone-ready (it contains artwork and info), just sync it to your smartphone and you're done.\r\n\r\nI've added Publicity Stills and a custom Soundtrack which contains the music from the theatrical release and the interactive version. The last track (Music Box Version) is the track that is played in the interactive version when you look above at the stars. It's a perfect loop so you can use it as a lullaby.\r\n\r\n\r\nCheers,\r\n\r\nADHDerby","torrent":{"xt":"urn:btih:89a87736c176d414ce8474c958102fdb973d07cc","amp;dn":"Glen+Keane+-+Duet+%28Fan+Pack%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"89a87736c176d414ce8474c958102fdb973d07cc","infoHashBuffer":{"type":"Buffer","data":[137,168,119,54,193,118,212,20,206,132,116,201,88,16,47,219,151,61,7,204]},"announce":[],"urlList":[]}}