{"title":"Transporter: The Series COMPLETE Season 1 [Eng audio/subs] (Cana","uid":10187204,"size":4413667415,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:89d7ccb4d4947733dd0c34e70147e4215f8daf98&amp;dn=Transporter%3A+The+Series+COMPLETE+Season+1+%5BEng+audio%2Fsubs%5D+%28Cana&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"lunchbox1134","files":24,"time":1400595750,"description":"I watched the series to ensure there were no duplicate files and all subtitles worked properly (and because it's a pretty great show). The texted language listed above refers to the subtitles, not on-screen text, which is German (I believe) on all but one episode. Please seed the hell out of this, and of course, enjoy! You know the drill.\n\n-----------------------------------------\n\nThis is the complete first season of Transporter: The Series, packaged in the order of the Canadian broadcast. Wikipedia states, &quot;Based on the chronology of events, the Canadian release most likely carries the correct order of episodes.&quot; I think there are still some changes to be made in episode order for the continuity to make more sense, but it's not my place to reorder the episodes how I see fit before uploading them. I had to order them according to one of the broadcasts, and Canadian seems to make the most sense overall. I'll leave it to you to rearrange them, if you so prefer.\n\nSpoken language and subtitles of all episodes are English. All episodes except &quot;Give the Guy a Hand&quot; were downloaded from a PSiG torrent on KickassTorrents. The opening credits for the PSiG episodes say 'Transporter: die serie' and most on-screen text is in German, but it doesn't detract much from the show. I do not know where to find episodes with English text.\n\nThe opening credits/text for &quot;Give the Guy a Hand&quot; are in English. The video came from this torrent: http://thepiratebay.se/torrent/8137789/Transporter_The_Series_S01E07_Give_the_Guy_a_Hand_WS.XviD-err000\n\nSubtitles obtained from OpenSubtitles.com season 1 pack. The subs for &quot;Give the Guy a Hand&quot; were out of sync. This is the first time I tried my hand at editing a subtitle file. I changed the frame rate from 25 (like the rest of the videos in this pack) to 23.976, dropped them back by 10 seconds because they were starting late, bumped them by 35.5 seconds after the opening credits because of the extended title sequence, and bumped and/or dropped back a few other places where they were slightly out of sync. They may not yet be perfect, but seemed to me to work just fine overall.","torrent":{"xt":"urn:btih:89d7ccb4d4947733dd0c34e70147e4215f8daf98","amp;dn":"Transporter%3A+The+Series+COMPLETE+Season+1+%5BEng+audio%2Fsubs%5D+%28Cana","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"89d7ccb4d4947733dd0c34e70147e4215f8daf98","infoHashBuffer":{"type":"Buffer","data":[137,215,204,180,212,148,119,51,221,12,52,231,1,71,228,33,95,141,175,152]},"announce":[],"urlList":[]}}