{"title":"Dick Dale - Unknown Territory","uid":6916039,"size":443811467,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:8dbe6623dbd09471cbaf675ede7cff15c27d0214&amp;dn=Dick+Dale+-+Unknown+Territory&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":16,"time":1325032706,"description":"With the studio team that recorded the triumphant comeback Tribal Thunder, including legendary Tubes drummer Prairie Prince, Dale peeled off another smoking set of originals, covers and reinterpretations of older material. The energy and fire in opening track &quot;Scalped&quot; alone means that the title could apply to just about any miserable hair-metal guitarist who thinks challenging Dale is a good idea. Unknown Territory also features a neat cameo -- none other than Huey Lewis provides the honking harmonica on two tracks. One of them, &quot;F Groove,&quot; is a duet between Lewis and Dale over a slow, funky beat -- listening to the two trade off is a delight. The titles and music of Dale's originals capture his vibe and Southern California's to a T. The rollicking &quot;Terra Dictyl&quot; and &quot;Maria Elena&quot; are more reasons why Dale is The Man, and who else but a surfer would write a song called &quot;Fish Taco&quot;? As always, Dale's choice of covers is idiosyncratic and successful, beginning with Boudelaux Bryant's &quot;Mexico.&quot; The drumming arrangement on this one is a dream, matching Dale's joyous guitar runs perfectly. Other covers include a kicking &quot;Ghostriders in the Sky,&quot; the album-closing &quot;Ring of Fire,&quot; and an only appropriate rip through the Rivieras' frat-rock classic &quot;California Sun,&quot; the latter two featuring Dale's only main vocals on the album. Perhaps the most jaw-dropping revamp is of the Jewish standard &quot;Hava Nagila&quot; -- given Dale's own Middle Eastern musical and family roots, the choice was inspired, and the job he does on it is perfection. Add in the eight-minute atmospheric strut of the title track and his cautionary environmental tale &quot;The Beast,&quot; and Dale does it again in spades.\n\n1\t\tScalped\tDale\t4:05\n2\t\tMexico\tBryant\t3:05\n3\t\tF Groove\tDale\t4:26\n4\t\tTerra Dicktyl\tDale\t3:11\n5\t\tTake It or Leave It\tDale\t4:27\n6\t\t(Ghost) Riders in the Sky\tJones\t3:16\n7\t\tFish Taco\tDale\t2:39\n8\t\tCalifornia Sun\tGlover, Levy\t3:16\n9\t\tMaria Elena\tDale\t4:19\n10\t\tHava Nagila\tTraditional\t4:00\n11\t\tThe Beast\tDale\t3:09\n12\t\tUnknown Territory\tDale\t7:55\n13\t\tRing of Fire\tCash, Kilgore\t3:31\n","torrent":{"xt":"urn:btih:8dbe6623dbd09471cbaf675ede7cff15c27d0214","amp;dn":"Dick+Dale+-+Unknown+Territory","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8dbe6623dbd09471cbaf675ede7cff15c27d0214","infoHashBuffer":{"type":"Buffer","data":[141,190,102,35,219,208,148,113,203,175,103,94,222,124,255,21,194,125,2,20]},"announce":[],"urlList":[]}}