{"title":"Complete Marvel Chronology  CMC 1970","uid":9415873,"size":6100951299,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:8fbee7c0b66b6d969bf0a592e28cf6b505331841&amp;dn=Complete+Marvel+Chronology++CMC+1970&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"7","files":-1,"time":1388441329,"description":"1970 - End of an Era\n\n1970 can be marked by three significant events.\n\nFirst was the departure of Jack Kirby from Marvel, after a decade of amazing creativity with Stan Lee. Fans debate the date the Silver Age of Comics ended, the departure of Kirby from Marvel is a candidate.\n\nNext, 1970 saw the cancellation of X-Men, despite quality talent on the book in Roy Thomas and Neal Adams. The book would return as a reprint title but it would be in the mid-70s before new stories would be seen again.\n\nFinally, 1970 saw the creation of one of Marvel's most successful comics - Conan the Barbarian. Not an original Marvel character, the character and many of the stories were licensed from the estate of Robert E Howard, the creator of Conan, but the series would be memorable for the art of Barry Smith and the writing of Roy Thomas, who made the character a true comic book hero.\n\n\n\nAbout the Complete Marvel Chronology by PeteThePIPster\n\nThe Complete Marvel Chronology (CMC) is version 2.0 of the Marvel Chronology (MC).\n\nThe MC was created by cyager69 aka Chuck, who uploaded Marvel comics beginning with Fantastic Four 001 (Nov 61) through to the issues published in Jun 1997.\n\nWhen Chuck was unable to continue the uploads I took over the MC and uploaded the remainder of the issues through to December 2008. Additional uploads added various titles not cover-dated with a specific month (the 'Decades' uploads) and seven Fill packs added new scans for issues missing when the original uploads were done for the 70's through to the 90's.\n\nWith none of Chuck's original uploads online, the decision was to either upload the original version of 1961-1996 or go with a brand new, full version incorporating the missing genres, such as romance, western and humour, and including the imprints which Chuck intended to upload following the completion of the MC.\n\nThe CMC will cover Marvel's entire seventy year history. At present I am uploading the years beginning with 1960 and these uploads will continue right through to December 1996. After that I have not finalised what will follow, but the likelihood will be that I go back to upload the 39-59 period, and then upload the 97-09 period again. When I do upload version 2.0 of 97-09 there will be many additions and many new scans.\n\nNews and Notes\n\nWelcome to the Seventies This upload sees the complete year of 1970 with every Marvel Comic included.\n\nAcknowledgments\n\nBooks used as research material in completing the CMC include -\n\nMarvel Chronicle - Tom DeFalco\nMarvel Vault - Roy Thomas and Pete Sanderson\nTales of the Implosion - Tom Lammers\nStandard Catalogue of Comics 5th Edition\n\nThanks to PeteThePIPster for his amaziness and ability to put all this together.\n\nThanks to all the scanners, editors and uploaders who make the scans available.\n\nThanks for the support of all those who seed the CMC.\n\nThanks to Chuck for creating the MC.\n\nMore info and pictures at\n &lt;a href=&quot;\nhttps://forum.suprbay.org/Thread-%E2%98%BA%E2%99%8B%E2%99%82%E2%98%A0%E2%98%80%E2%98%AE-%C6%AE%E2%98%AF%C2%AE%C2%AE%C6%90%C6%9D%E2%98%A8%C2%A7-%E2%98%AE%E2%98%80%E2%98%A0%E2%99%82%E2%99%8B%E2%98%BA?pid=15747#pid15747&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://forum.suprbay.org/Thread-%E2%98%BA%E2%99%8B%E2%99%82%E2%98%A0%E2%98%80%E2%98%AE-%C6%AE%E2%98%AF%C2%AE%C2%AE%C6%90%C6%9D%E2%98%A8%C2%A7-%E2%98%AE%E2%98%80%E2%98%A0%E2%99%82%E2%99%8B%E2%98%BA?pid=15747#pid15747&lt;/a&gt;\n","torrent":{"xt":"urn:btih:8fbee7c0b66b6d969bf0a592e28cf6b505331841","amp;dn":"Complete+Marvel+Chronology++CMC+1970","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8fbee7c0b66b6d969bf0a592e28cf6b505331841","infoHashBuffer":{"type":"Buffer","data":[143,190,231,192,182,107,109,150,155,240,165,146,226,140,246,181,5,51,24,65]},"announce":[],"urlList":[]}}