{"title":"Walls That Speak - The Murals of John Thomas Biggers (Art Ebook)","uid":13527493,"size":5906864,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8fea7bb4e93cb83ccd0a441c2750b305b1d27fa4&amp;dn=Walls+That+Speak+-+The+Murals+of+John+Thomas+Biggers+%28Art+Ebook%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"STBGD","files":1,"time":1455394830,"description":"Olive Jensen Theisen, &quot;Walls That Speak: The Murals of John Thomas Biggers&quot; \r\nEnglish | ISBN 1574412892 | 2010 | 160 pages | PDF | 6 MB\r\n\r\nJohn Thomas Biggers (1924-2001) was one of the most significant African American artists of the twentieth century. He was known for his murals, but also for his drawings, paintings, and lithographs, and was honored by a major traveling retrospective exhibition from 1995 to 1997. He created archetypal imagery that spoke positively to the rich and varied ethnic heritage of African Americans, long before the Civil Rights era drew attention to their African cultural roots. His influence upon other artists was profound, both for the power of his art and as professor and elder statesman to younger generations.Olive Jensen Theisen's long-time commitment to the art of John Biggers resulted from the serendipitous discovery of an early Biggers mural in a school storeroom in the mid-1980s. Theisen immediately recognized the artist, the work, and its significance. She then set about returning &quot;The History of Negro Education in Morris County, Texas&quot; to a place of honor and found herself becoming a friend and recorder of John Biggers's stories and experiences relating to the creation of his other murals too, including &quot;Family Unity &quot;at Texas Southern University.Containing more than eighty color and black-and-white illustrations, &quot; Walls That Speak &quot;is a richly illustrated update of an earlier edition published in 1996. The artist completed new murals between its publication and his death in 2001. In addition to the inclusion of the new murals, Theisen has added a chapter on Biggers's African art collection. The only work exclusively dedicated to his murals, this book will appeal to all those interested in murals or African American art.&quot;As a result of her friendship with Dr. Biggers, Dr. Theisen clearly has unique access to the works that are now held by the Biggers estate. Her interviews provide a deeply personal insight into the mind of this remarkable man and the symbols he employed in his art.&quot;–R. William McCarter, Regents Professor of Art, University of North Texas","torrent":{"xt":"urn:btih:8fea7bb4e93cb83ccd0a441c2750b305b1d27fa4","amp;dn":"Walls+That+Speak+-+The+Murals+of+John+Thomas+Biggers+%28Art+Ebook%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8fea7bb4e93cb83ccd0a441c2750b305b1d27fa4","infoHashBuffer":{"type":"Buffer","data":[143,234,123,180,233,60,184,60,205,10,68,28,39,80,179,5,177,210,127,164]},"announce":[],"urlList":[]}}