{"title":"Gnomoria v0.8.47","uid":8735686,"size":206372426,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:912b85898a3b991c75ded2d9182cbf468242768f&amp;dn=Gnomoria+v0.8.47&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"aedziex23","files":-1,"time":1374681286,"description":"Gnomoria is a sandbox village management game where you help lead a small group of gnomes, who have set out on their own, to thrive into a bustling kingdom! Anything you see can be broken down and rebuilt elsewhere. Craft items, build structures, set traps and dig deep underground in search of precious resources to help your gnomes survive the harsh lands. Build your kingdom and stockpile wealth to attract wandering gnomads to your cause, but be wary of also attracting enemies!\n\nKey Features:\n-Procedurally generated world - Every game is different\n-Fully destructible environment - Everything can be mined, dug, chopped and rebuilt or used for crafting\n-Open sandbox gameplay - Play how you want - manage a peaceful town or build up military and fend off invasions.\n-Crafting - Tons of items to craft at different workshops\n-Mechanisms - Construct elaborate contraptions using parts like hatches, levers, steam engines\n\nGnomoria v0.8.47\n\nGeneral:\n-Added an attack tab to the enemy window\n   -Individual squads can be set to attack an enemy\n   -Squads with &quot;Defend gnomes&quot; selected will automatically be set to attack\n   -Attacks can be cancelled by unchecking squads\n   -Squads without &quot;Defend gnomes&quot; or &quot;Perform attack orders&quot; will not be shown in the list\n-Removed the attack button from the enemy window\n-Added an Enemies tab to Military overview\n   -Lists all spotted enemies\n   -Squads can be assigned to attack enemies\n   -Option to view the selected enemy\n-Added option to retreat from combat to equip missing gear\n-Added option to retreat from combat to refill ammo\n   -Gnomes will only retreat once they have no ammo but will attempt to refill all ammo before going back to combat\n\nFixed:\n-Gnomes continuing to pursue enemies after they died\n\nSystem requirements:\nOS: Windows Xp, Vista, Win 7\nProcessor: 2.0 Ghz\nMemory: 1GB\nHard Disk Space: 50MB\nVideo Card: 128mb Video Memory\nDirectXÂ®: 9.0c or Greater\n\nXNA Framework 4.0 and .NET Framework 4.0 are included in the _CommonRedist folder. (Install these first.)\n\nYou can help the developer and buy the game on steam here: http://store.steampowered.com/app/224500/\n","torrent":{"xt":"urn:btih:912b85898a3b991c75ded2d9182cbf468242768f","amp;dn":"Gnomoria+v0.8.47","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"912b85898a3b991c75ded2d9182cbf468242768f","infoHashBuffer":{"type":"Buffer","data":[145,43,133,137,138,59,153,28,117,222,210,217,24,44,191,70,130,66,118,143]},"announce":[],"urlList":[]}}