{"title":"Anthony de Mello - The Song of the Bird (pdf)","uid":8468160,"size":2329127,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:916a9bb9481c5bb625295f754ce0a51a5d53d3e2&amp;dn=Anthony+de+Mello+-+The+Song+of+the+Bird+%28pdf%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"pharmakate","files":-1,"time":1368413554,"description":"Anthony de Mello - The Song of the Bird (Doubleday, 1984). 172 pages.\n\nNew scan. Searchable pdf (clearscan) with accurate metadata and pagination.\n\n\n\n&quot;Every one of these stories is about YOU.&quot; --Anthony de Mello\n\nEveryone loves stories; and in this book the bestselling author of Sadhana: A Way to God shares 124 stories and parables from a variety of traditions both ancient and modern. Each story resonates with life lessons that can teach us inescapable truths about ourselves and our world.\n\nDe Mello's international acclaim rests on his unique approach to contemplation and ability to heighten self-awareness and self-discovery. His is a holistic approach, and in the words of one reviewer: &quot;his mysticism cuts across all times and peoples and is truly a universal invitation.&quot; The Song of the Bird uses the familiar yet enduring medium of the story to illustrate profound realities that bring us in touch with the problems and concerns of daily life, as well as with our common spiritual quest. The aim is to develop the art of tasting and feeling the message of each story to the point that we are transformed. &quot;Let the story speak to your heart, not to your brain,&quot; the author directs. &quot;This may make something of a mystic out of you.&quot;\n\nEnhanced by lovely ink drawings, this is indeed a volume to treasure, to share, and to read many times over, for it is everyone's best companion on the road to spiritual growth.\n\n\n\n\nfor de Mello's Sadhana see this: &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/8167093&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/8167093&lt;/a&gt;\n\nThere are also some audio/video works by de Mello are on piratebay -- search for his name to find them.","torrent":{"xt":"urn:btih:916a9bb9481c5bb625295f754ce0a51a5d53d3e2","amp;dn":"Anthony+de+Mello+-+The+Song+of+the+Bird+%28pdf%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"916a9bb9481c5bb625295f754ce0a51a5d53d3e2","infoHashBuffer":{"type":"Buffer","data":[145,106,155,185,72,28,91,182,37,41,95,117,76,224,165,26,93,83,211,226]},"announce":[],"urlList":[]}}