{"title":"The Odyssey by Robert Fagles","uid":11047105,"size":1131589,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9305c4ac08544153629b92f27a8103f1da7b98fc&amp;dn=The+Odyssey+by+Robert+Fagles&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"namhsea","files":1,"time":1410965728,"description":"The great epic of Western literature, translated by the acclaimed classicist Robert Fagles\n \nRobert Fagles, winner of the PEN/Ralph Manheim Medal for Translation and a 1996 Academy Award in Literature from the American Academy of Arts and Letters, presents us with Homer's best-loved and most accessible poem in a stunning modern-verse translation. &quot;Sing to me of the man, Muse, the man of twists and turns driven time and again off course, once he had plundered the hallowed heights of Troy.&quot; So begins Robert Fagles' magnificent translation of the Odyssey, which Jasper Griffin in the New York Times Book Review hails as &quot;a distinguished achievement.&quot;\n\nIf the Iliad is the world's greatest war epic, the Odyssey is literature's grandest evocation of an everyman's journey through life. Odysseus' reliance on his wit and wiliness for survival in his encounters with divine and natural forces during his ten-year voyage home to Ithaca after the Trojan War is at once a timeless human story and an individual test of moral endurance. In the myths and legends  retold here,\n\nFagles has captured the energy and poetry of Homer's original in a bold, contemporary idiom, and given us an Odyssey to read aloud, to savor, and to treasure for its sheer lyrical mastery. Renowned classicist Bernard Knox's superb introduction and textual commentary provide insightful background information for the general reader and scholar alike, intensifying the strength of Fagles's translation. This is an Odyssey to delight both the classicist and the general reader, to captivate a new generation of Homer's students. This Penguin Classics Deluxe Edition features French flaps and deckle-edged paper.\n\nFor more than sixty-five years, Penguin has been the leading publisher of classic literature in the English-speaking world. With more than 1,500 titles, Penguin Classics represents a global bookshelf of the best works throughout history and across genres and disciplines. Readers trust the series to provide authoritative texts enhanced by introductions and notes by distinguished scholars and contemporary authors, as well as up-to-date translations by award-winning translators.","torrent":{"xt":"urn:btih:9305c4ac08544153629b92f27a8103f1da7b98fc","amp;dn":"The+Odyssey+by+Robert+Fagles","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9305c4ac08544153629b92f27a8103f1da7b98fc","infoHashBuffer":{"type":"Buffer","data":[147,5,196,172,8,84,65,83,98,155,146,242,122,129,3,241,218,123,152,252]},"announce":[],"urlList":[]}}