{"title":"Lisa Scottoline's Save Me (epub format)","uid":6979527,"size":371162,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:930be042ca3c5e879fa40e5b0cfb4e79a501f301&amp;dn=Lisa+Scottoline%5C%27s+Save+Me+%28epub+format%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Bookeek","files":1,"time":1327353958,"description":"JUST GOT AROUND TO READING COMMENTS. THIS IS FOR shelleyjohn. \n\n\n\nFrom the New York Times bestselling author of Think Twice and Look Again comes an emotionally powerful novel about a split-second choice, agonizing consequences, and the need for justice \n\nSusan Pressman volunteers as a lunch mom in her daughter Melly's school in order to keep an eye on Amanda, a mean girl who's been bullying her daughter. Her fears come true when the bullying begins, sending Melly to the bathroom in tears. Just as Susan is about to follow after her daughter, a massive explosion goes off in the kitchen, sending the room into chaos. Susan finds herself faced with the horrifying decision of whether or not to run to the bathroom to rescue her daughter or usher Amanda to safety. She believes she has accomplished both, only to discover that Amanda, for an unknown reason, ran back into the school once out of Susan's sight. In an instance, Susan goes from hero to villain as the small community blames Amanda's injuries on her. In the days that follow, Susan's life starts to fall to pieces, Amanda's mother decides to sue, her marriage is put to the test, and worse, when her daughter returns to school, the bullying only intensifies. Susan must take matters into her own hands and get down to the truth of what really happened that fateful day in order to save herself, her marriage and her family. \n\nIn the way that Look Again had readers questioning everything they thought they knew about family, Save Me will have readers wondering just how far they would go to save the ones they love. Lisa Scottoline is writing about real issues that resonate with real women, and the results are emotional, heartbreaking and honest.","torrent":{"xt":"urn:btih:930be042ca3c5e879fa40e5b0cfb4e79a501f301","amp;dn":"Lisa+Scottoline%5C%27s+Save+Me+%28epub+format%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"930be042ca3c5e879fa40e5b0cfb4e79a501f301","infoHashBuffer":{"type":"Buffer","data":[147,11,224,66,202,60,94,135,159,164,14,91,12,251,78,121,165,1,243,1]},"announce":[],"urlList":[]}}