{"title":"A Knight's Tale","uid":4176070,"size":1031184088,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:931d50aebadc68a4f2bd09cf87495aa5d4271207&amp;dn=A+Knight%5C%27s+Tale&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"TheLabMan","files":1,"time":1210129592,"description":"The setting of the story took place in the modern medieval times and appears to be anachronism as it contains music and wordings that does not fit those times.\n\nIt started with 3 faithful &amp; loyal squires Ronald, Wat and William. As they are on their way to Victory, all 4 together with the Knight took a little rest and when Ronald came to his lord (their knight) he found out that he is no longer breathing and is already dead. They no longer have the chance to participate in final round of Jousting, (a sport during the Medievil times).\n\nWilliam, took the armor vest and wear it and to join the jousting (knight&amp;#039;s sport) were he won consecutively. Together with the 2 squires, he trained himself the use of Sword and Lance as it may be his edge for such game.\n\nWhen they are on their way to a place were there is Jousting and Sword competition, they have encountered an acclaimed writer, Geoffrey Chaucer, who on the middle of the story confessed that he has gambling problems. He joined the three and he stood as the Herald of Sir Ulrich Von Lichenstein from Gelderland (composed fake name of William because he needs a name that belongs to a royal &amp; noble family).\n\nGeoff presented Ulrich to the panel and told them that Sir Ulrich will compete for Sword and Jousting.\n\nAs Ulrich is wandering around that area, singing, he saw a beautiful lady and he followed her. Insisting to ask for her name, The lady asked back if he would care if she is ugly. Ulrich was speechless.\n\nUlrich have just finished his 1st jousting round, when moments later, a man approached him and he said that he was there because of Ulrich&amp;#039;s Herald. He found out that Geoff had serious problems, and it was gambling. He was unclothed by 2 men as his punishment. Ulrich asked the 2 men to release him and give him back his clothes and repay them after the game. They then released Geoff and on their way out, Geoff said that he truly is a writer, he lied before and has gambling issues. Ulrich started to compete with the sword just after they talk. People were so impressed, as he is unbeatable. With consecutive wins. He&amp;#039;s proclaimed a Sword Champ.\n\nPrepared for another jousting, Sir Ulrich pointed to Geoff the woman he liked, it&amp;#039;s the woman she saw while he&amp;#039;s roaming in the crowded area. Geoff commented that Ulrich is so ambitious and is getting too far now.\n\nInspired William, he persists to ask the lady, her name. The lady didn&amp;#039;t say her name, instead she said &quot;You Persist?&quot;. Another knight was sitting beside the lady whose name was Count Alemar and humiliated him about the armor suite Ulrich was wearing and of how Ulrich say his name. Ulrich was pissed, he left and went on to his game.\n\nFrom one of his games, he faced the Black Prince of Wales and hit him with 2 points. Realizing that the competitor belongs to a royal blood, Ulrich calls it a draw and spared Prince Edward.\n\nHe impressed the crowd with his fearless fight and merciful judgment. Even Count Alemar and his Herald were impressed.\n\nFrom one of his games, he had a very strong hit on the chest and his vest needs to be fixed. They went to several blacksmiths, but the blacksmiths asks for a &quot;money-down-to-fix&quot;. One of the blacksmith suggested to them if they could try approaching the Lady Farrier just next to them and see what she can do.\n\nKate, the Lady Farrier, also refused and said that she doesn&amp;#039;t work for free, but when she felt that she was underestimated by the other blacksmiths, she took Ulrich&amp;#039;s vest and successfully fixed it.\n\nBefore the game starts with Count Alemar as his contender, the lady&amp;#039;s maid approached William and said sha has a message from the lady. The lady wish to tell William that her name is Lady Jocelyn and handed over a piece of clothe. William accepted it gratefully and was inspired. With two consecutive nice hit to Count Alemar and Alemar not hitting Ulrich, he decided to hit Ulrich on the face and flash of Williams memory went on during his childhood with his father, wishing that one day he&amp;#039;ll change the stars and he&amp;#039;ll be a knight.\n\nWhen the game ended, Count Alemar picked-up the piece cloth that Ulrich dropped. Alemar handed back the cloth to Lady Jocelyn and she left without a word.\n\nAfter winning Ulrich paid Geoffs penalty to Simon the Summoner and Peter the Pardoner from Rouen.\n\nKate commented that the armor which Ulrich is wearing is not originally made for him and she gave an offer of making a very good armor. Ulrich asked how much would it cost. She said nothing, but just takes her as far as Paris. Ulrich refused and said that they walk alone. And ask her to take her gold (payment for the vest fix).\n\nAs they were packing up their stuff, Geoff suggested to them that they should stay and Ulrich should attend the dance party. Ulrich and Geoff had an argument whether he attends or not. Minutes after, Lady Jocelyn&amp;#039;s maiden approach them and ask what kind and color of tunic will Ulrich wear in the dance party. As Geoff would have answered that they wouldn&amp;#039;t be attending, Ulrich blocked Geoff and said don&amp;#039;t speak of things he doesn&amp;#039;t understand. Ulrich ask Ronald of what tunic will he wear tonight. Ronald as shock as he was, he described the attire base on the tent that he is facing. Then the maiden left. Ulrich with much depression he said he couldn&amp;#039;t dance. All 5 of them, Kate, Geoff, Wat, Ronald and Ulrich went to a place where they can work on the Ulrich&amp;#039;s Tunic and Dance problem. Kate and Geoff helped taught the dance. Wat as always being bullied by Geoff became Ulrich&amp;#039;s partner during the practice, while Ronald fixes the Tunic.\n\nManaged to fix the tunic and learned the steps. Ulrich attended the gathering. He and Lady Jocelyn both wore green colored attires. They dance similar to a Farandol but with lots of differences, (especially modern moves. OST- Golden Years by David Bowie) which makes the scenario anachronism.\n\nJousting took place again the next day were Count Alemar is to face the Black Prince of Wales: Prince Edward as his opponent. Alemar calls it a draw. Just to impress the crowd. Ulrich on the other hand, though he was informed that he will be fighting against Prince Edward for the second time. Wat, Ronald and Geoff told Ulrich about this but Ulrich still went on with the fight and hit Prince Edward squarely in the chest with 2 points. Edward loses the game. Geoff approach Ulrich and ask if he knows what he&amp;#039;s doing. Ulrich told Geoff that Edward is taking the risk and is putting himself to danger and told Edward that he knows that he is a prince. Edward appeared stunned and wondered why Ulrich still go on even if he knew what he is. Ulrich said that it is not in him to withdraw. &quot;But it happen&quot; added Prince Edward. Sir Ulrich was named Jousting Champion. But still have the feeling of a 2nd placer as Count Alemar withdraws and he did not defeat him in a Joust.\n\nThey went through places and they couldn&amp;#039;t find Count Alemar. Unknown by them, count Alemar went to Gelderland to make a research about Sir Ulrich&amp;#039;s genealogy. He failed to see Ulrich&amp;#039;s name on the painting as he doesn&amp;#039;t exist. He found out that Ulrich is a fraud.\n\nUlrich sent a sweet letter that was composed by him, Kate, Wat, Ronald and Geoff writing it for Lady Jocelyn and asking if she would come to Paris.\n\nJocelyn got the letter, had tears in her eyes and Wat asked if she has something for his master in return. Jocelyn smiled.\n\nWat, going back to were Ulrich and the rest was, He said that Jocelyn is going to Paris with them. Sir Ulrich asked if she gave something in return. Wat kissed William on the Lip and William shouted YES. He knew that Lady Jocelyn just send him the kiss. HE was so HAPPY!\n\nOn their way to London, William had a flashback of a childhood memory it was a time when he and his father are on their way to London through a boat.\n\nNow that they are in London, Geoff informed Ulrich (William) that Count Alemar is on the list to compete. Ulrich and Alemar saw each other and Count Alemar said that Lady Jocelyn will be his bride no matter what it takes.\n\nThat night, Ulrich on his horse, roamed around the area while it is raining when he saw a little girl playing the stick like it was her lance. The little told Ulrich that he was her favorite knight and she wondered why Ulrich is roaming in that area. Ulrich told the little girl that he used to live there and he asks the little girl if he knows a man who looks like a knight that lives just the other corner. The little girl told Ulrich that she also lives there and she knows the man Ulrich is pertaining to. She said that the man is blind and been there for years.\n\nUlrich, with his curiosity went to that place and saw an old man fixing a fisherman&amp;#039;s net. John Thatcher (William&amp;#039;s Father) heard a squeak sound from the stairs and ask &quot;if somebody is there?&quot; He thought that the person on the stairs was the owner of the net and advised him to go back as he is not yet done with it. Then, John Thatcher asked again, &quot;Who Are You?&quot; Ulrich answered &quot;A Knight&quot; and said that he is Ulrich. John said that he knew him as his name is being chanted in the stadium. John ask if what business he has been there. Ulrich said that he has a message for John coming from his son. John, as stunned as he was. He asked him to come inside and asked for his son&amp;#039;s message. Ulrich said that &quot;Your Son have Changed his Stars&quot;. With teary eyes, ohn have somehow recognize this and asked if his son have followed his feet. Ulrich answered &quot;YES&quot;. And he knew that the knight standing in front of him, the one whom he speaks with, is his SON WILLIAM. They hugged each other and cried.\n\nThey had dinner and William mentioned that he has a girlfriend. His father told him that he wants to meet her. But Ulrich changed teh topic about the water dropping from the roof. He fixed it. Unknown by him, Count Alemar have followed him and confirmed that he is a fraud and doesn&amp;#039;t belong from a Royal line. In morning, Ulrich is so happy that he told the 3 (Wat, Ronald and Kate) that he have spoken with his father and it was a great time of his life.\n\nGeoff and Jocelyn approach the four and both appear that someone died why the reason their sad. Geoff and Jocelyn told William that people knew already who he was and they are waiting for him on the list for him to be arrested and put him on the stacks.\n\nAll were shocked with the terrible news and Ronald suggested packing their things up. William refused and asked Lady Jocelyn what she thinks. Lady Jocelyn suggested to RUN and do it for LOVE, instead of seeing him being place on the stacks.\n\nRonald, Kate, Wat and Geoff agreed with Lady Jocelyn. But furious William firmly refused and said that &quot;I&amp;#039;M A KNIGHT&quot;.\n\nRonald commented that everything must be put into an end. They prepared Ulrich and they went to the game. The officers approached them and told William should remove himself from the game of honor. But William answered that he is there to compete. They said that he is here to be arrested. And he was arrested and was put to jail.\n\nCount Alemar visited William and reiterates the words he keep on saying while he punches him every line he says &quot;YOU HAVE BEEN WEIGHED&quot;, &quot;YOU HAVE BEEN MEASURED&quot; &quot;AND YOU HAVE BEEN FOUND WANTING&quot;. Then with a last punch on the stomach, Count Alemar left.\n\nThe next day, William is placed on the stacks and there&amp;#039;s one boy who slapped his head as everybody make a satisfying applause to what the boy have done.\n\nRonald, Wat, Kate and Geoff stood by his side and didn&amp;#039;t leave him. 2 men with hoods stood there as audience and when they reveal their faces. the people found out that it was the Black Prince of Wales, Prince Edward. He approached William and told him how William&amp;#039;s men love him and if he knew nothing else about him that would be enough. He asked the guards to release William and ask if how he can repay the kindness once William showed him. He asked William to kneel; Prince Edward took his sword and proclaimed William, Sir William Thatcher.\n\nApplause went on and Prince Edward if he is fit to compete. He said that he can prepare him his opponent. Sir William, officially the new knight thanked his lord, Prince Edward.\n\nThe Final battle between Sir William and Count Alemar has come. Alemar cheats as he placed a sharp tip on his lance. They rode and Count Alemar hit William on the right end of his chest. The tipped lance was left on his chest and Ronald pulled it out. Wat and Geoff found out that Alemar is cheating. William is severely injured by the 1st attack. And with much pain from his chest, he dropped his lance and was hit again by the 2nd time. Ronald said that the only way to win the game is to kill.\n\nHaving so much pain, he asked Kate to remove his Armor Vest so he can breathe well. He asked her not to put it back again. Kate looks at Ronald and he agreed. He couldn&amp;#039;t carry the lance anymore so he asked Wat to tie the lance on his arm. Wat looks at Ronald again and he said do whatever William says. When the game is about to start, Geoff made a heartfelt introduction of his lord, he introduced him as the son of John Thatcher and with his official title, everybody knew that he is Sir William Thatcher. Wat told William that everybody heard Williams name including his father. Geoff said &quot;Godspeed Williams&quot; and went down.\n\nWilliam with no vest and a tied lance on his arm, rode on his horse and fought with Count Alemar. When he is about to reach Count Alemar, he shouted his name and hit Alemar squarely into the chest, bringing him down of his horse. Count Alemar fell down leaning flat on the ground, had a vision of the 5 person he hates. Wat stood above him saying &quot;HE HAS BEEN WEIGHED&quot;, then comes Ronald saying &quot;YOU HAVE BEEN MEASURED&quot;, then Kate said &quot;AND YOU ABSOLUTELY&quot; Geoff came above him and added &quot;HAVING FOUND WANTING&quot; finally, William completed the circle saying WELCOME TO THE NEW WORLD. GOD SAVE YOU IF IT&amp;#039;S THE RIGHT THING TO DO. Then they left him.\n\nVictoriously, William and his friends rejoiced. His father is so pleased and so as Prince Edward. Lady Jocelyn is so proud of him.\n\nThe story end where Ronald, Kate, Geoff and Wat were leaning forward at the center of the stadium as Geoff is thinking about writing a story about everything had happen, bullying Wat &quot;Maybe NOt Yours&quot;.\n\nEnd\n","torrent":{"xt":"urn:btih:931d50aebadc68a4f2bd09cf87495aa5d4271207","amp;dn":"A+Knight%5C%27s+Tale","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"931d50aebadc68a4f2bd09cf87495aa5d4271207","infoHashBuffer":{"type":"Buffer","data":[147,29,80,174,186,220,104,164,242,189,9,207,135,73,90,165,212,39,18,7]},"announce":[],"urlList":[]}}