{"title":"Cisco PIX Firewall Security Appliance v. 7.0(4) Flash Image (OS","uid":3411651,"size":5437440,"categoryP":"applications","categoryS":"other_os","magnet":"?xt=urn:btih:93b39105965d61cf3ab6a7c41f60484695b98f25&amp;dn=Cisco+PIX+Firewall+Security+Appliance+v.+7.0%284%29+Flash+Image+%28OS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Gregorlan","files":1,"time":1132511325,"description":"-----------------------------------------------------------------------------------\n\nNote The PIX 501 security appliance is not supported in software Version 7.0.4\n-----------------------------------------------------------------------------------\n\nRelease by Gregorlan (PL)\n\nGreat Polish Team deliver you a newest release of Cisco Pix Firewall OS Software...\nNow avaible to anyone...\n-----------------------------------------------------------------------------------\nCisco PIX Firewall Security Appliance v. 7.0(4) Flash Image (OS for Cisco PIX)\n-----------------------------------------------------------------------------------\nImportant Notes in Release 7.0.4\n\nMaximum Security Contexts and VLANs Supported \nThe maximum security contexts supported in release 7.0(4) for the PIX 535 are 50 tiers. The maximum number of VLANs supported are 150. For more information on the feature support for each platform license, see the &quot;Platform Feature Licenses&quot; section in the Cisco Security Appliance Command Line Configuration Guide \n\nIKE Delete-with-Reason \nIKE syslogs for Delete-with-Reason will not contain the reason text unless the clients support this feature. Currently the VPN 3002 Version 4.7 and PIX 501 Version 6.3(4) hardware clients do not support this feature. \n-----------------------------------------------------------------------------------\nNew Features \n\nThis section describes the new features in this release. This section includes the following topics: \n\n? Auto Update Over a VPN Tunnel \n\n? Crashinfo Enhancement \n\n? Modular Policy Framework Enhancement \n\n? Support GTP Load Balancing Across GSNs \n\n? Downloadable Access Control Lists Enhancements \n\n? Converting Wildcards to Network Mask in Downloadable ACL \n\n? IPSec VPN: Add support for cascading ACLs \n\n? Rate limiting of Syslog messages \n\nAuto Update Over a VPN Tunnel \nWith this release, the auto-update server command has a new source interface argument that lets you specify an interface, such as a VPN tunnel used for management access and specified by the management-access command: \n\nauto-update server url [source interface] [verify-certificate] \n\nno auto-update server url [source interface] [verify-certificate] \n\nFor a complete description of the command syntax, see the Cisco Security Appliance Command Reference. \n\nCrashinfo Enhancement \nOutput from the crashinfo command might contain sensitive information that is inppropriate for viewing by all users connected to the security appliance. The new crashinfo console disable command lets you suppress the output from displaying on the console. \n\nFor a complete description of the command syntax, see the Cisco Security Appliance Command Reference. \n\nModular Policy Framework Enhancement \nThe new set connection timeout command lets you configure the timeout period, after which an idle TCP connection is disconnected. \n\nFor more information, see the &quot; Using Modular Policy Framework&quot; section in the Cisco Security Appliance Command Line Configuration Guide. For a complete description of the command syntax, see the Cisco Security Appliance Command Reference. \n\nSupport GTP Load Balancing Across GSNs \nIf the security appliance performs GTP inspection, by default the security appliance drops GTP responses from GSNs that were not specified in the GTP request. This situation occurs when you use load-balancing among a pool of GSNs to provide efficiency and scalability of GPRS. You can enable support for GSN pooling by using the permit response command. This command configures the security appliance to allow responses from any of a designated set of GSNs, regardless of the GSN to which a GTP request was sent. \n\nFor more information, see the &quot; Enabling and Configuring GTP Inspection&quot; section in the Cisco Security Appliance Command Line Configuration Guide. For a complete description of the command syntax, see the Cisco Security Appliance Command Reference. \n\nDownloadable Access Control Lists Enhancements \nThis feature adds a means of ensuring that downloadable ACL requests sent to a RADIUS server come from a valid source through the Message-Authenticator attribute. \n\nUpon receipt of a RADIUS authentication request that has a username attribute containing the name of a downloadable ACL, Cisco Secure ACS authenticates the request by checking the Message-Authenticator attribute. The presence of the Message-Authenticator attribute prevents malicious use of a downloadable ACL name to gain unauthorized network access. The Message-Authenticator attribute and its use are defined in RFC 2869, RADIUS Extensions, available at http://www.ietf.org. \n\nFor more information, see the &quot; Configuring Any RADIUS Server for Downloadable ACLs&quot; section in the Cisco Security Appliance Command Line Configuration Guide. For a complete description of the command syntax, see the Cisco Security Appliance Command Reference. \n\nConverting Wildcards to Network Mask in Downloadable ACL \nSome Cisco products, for example the VPN 3000 concentrator and Cisco IOS routers, require that dowloadable ACLs be configured with wildcards instead of network masks. The adaptive security appliance, on the other hand, requires that downloadable ACLs be configured with network masks. This new feature allows the security appliance to internally convert a wildcard to a netmask. Translation of wildcard netmask expressions means that downloadable ACLs written for Cisco VPN 3000 series concentrators can be used by the security appliance without altering the configuration of the downloadable ACLs on the RADIUS server. \n\nYou can configure ACL netmask conversion on a per-server basis, using the acl-netmask-convert command, available in the AAA-server configuration mode. For more information about configuring a RADIUS server, see the &quot;Identifying AAA Server Groups and Servers&quot; section in the Cisco Security Appliance Command Line Configuration Guide. For a complete description of the command syntax, see the Cisco Security Appliance Command Reference. \n\nIPSec VPN: Add support for cascading ACLs \nCascading ACLs involves the insertion of deny ACEs to bypass evaluation against an ACL and resume evaluation against a subsequent ACL in the crypto map set. Because you can associate each crypto map with different IPSec settings, you can use deny ACEs to exclude special traffic from further evaluation in the corresponding crypto map, and match the special traffic to permit statements in another crypto map to provide or require different security. The sequence number assigned to the crypto ACL determines its position in the evaluation sequence within the crypto map set. \n\nFor more information, see the &quot; Defining Crypto Maps&quot; section in the Cisco Security Appliance Command Line Configuration Guide. For a complete description of the command syntax, see the Cisco Security Appliance Command Reference. \n\nFailover Key Command \nThe failover key command was modified to include the hex key keyword and argument. hex key specifies a hexadecimal value for the encryption key. The key must be 32 hexadecimal characters. \n\nFor a complete description of the command syntax, see the Cisco Security Appliance Command Reference. \n\nRate limiting of Syslog messages \nThe logging rate limit enables you to limit the rate at which system log messages are generated. You can limit the number of system messages that are generated during a specified time interval. \n\nYou can limit the message generation rate for all messages, a single message ID, a range of message IDs, or all messages with a particular severity level. To limit the rate at which system log messages are generated, use the logging rate-limit command. \n\nFor a complete description of the command syntax, see the Cisco Security Appliance Command Reference. \n\nImportant Notes \nImportant Notes in Release 7.0 \nThis section lists important notes related to Version 7.0(4). \n\nMaximum Security Contexts and VLANs Supported \nThe maximum security contexts supported in release 7.0(4) for the PIX 535 are 50 tiers. The maximum number of VLANs supported are 150. For more information on the feature support for each platform license, see the &quot;Platform Feature Licenses&quot; section in the Cisco Security Appliance Command Line Configuration Guide \n\nIKE Delete-with-Reason \nIKE syslogs for Delete-with-Reason will not contain the reason text unless the clients support this feature. Currently the VPN 3002 Version 4.7 and PIX 501 Version 6.3(4) hardware clients do not support this feature. \n\n--------------------------------------------------------------------------------\n\nNote The PIX 501 security appliance is not supported in software Version 7.0. \n--------------------------------------------------------------------------------\n\n","torrent":{"xt":"urn:btih:93b39105965d61cf3ab6a7c41f60484695b98f25","amp;dn":"Cisco+PIX+Firewall+Security+Appliance+v.+7.0%284%29+Flash+Image+%28OS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"93b39105965d61cf3ab6a7c41f60484695b98f25","infoHashBuffer":{"type":"Buffer","data":[147,179,145,5,150,93,97,207,58,182,167,196,31,96,72,70,149,185,143,37]},"announce":[],"urlList":[]}}