{"title":"Supernatural Selection: How Religion Evolved","uid":6021830,"size":2451813,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:93f4dd584defe2af2b2630b08c9743dd1d3b3915&amp;dn=Supernatural+Selection%3A+How+Religion+Evolved&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"bookzilla","files":1,"time":1291816183,"description":"The existence of God has been part of human discussion for centuries. Believers point to evidence of design and rationality as convincing proofs of divine presence. Rossano, head of the psychology department at Southeastern Louisiana University, looks instead to notions borrowed from anthropology and sociology to construct a purely nonreligious view of the evolution of religion. Favoring science over sentiment, he takes great comfort in the idea that Ã‚Â£pieces of our evolutionary puzzle are now falling into place.Ã‚Â¥ He suggests that religion, which he describes as an Ã‚Â£evolutionary adaptation,Ã‚Â¥ arises from intergroup competition and is the result of the inevitable struggles that occur when groups compete for the same prizes (in this case, adherents to their message). To true believers, this is a grim assessment of the religious notions that underlie their lives. Casual readers will find this book tough going and, in some instances, overly technical. But with patience, most will find food for thought. \nCopyright Ã‚Â© Reed Business Information, a division of Reed Elsevier Inc. All rights reserved. \nReview\n\n&quot;Well-reasoned and ultimately persuasive book...Writing with verve, insight, and even occasional wit, Rossano does an outstanding job of placing his reconstruction of the origins of human religiousness in the context of up-to-date knowledge from diverse scientific fields of human origins. Very highly recommended.&quot; -- Library Journal \n\n&quot;This exhaustively researched and intriguing book...is sure to get you thinking about the nature of religion.&quot; -- New Scientist \n\nHardcover: 304 pages \nPublisher: Oxford University Press, USA (May 28, 2010) \nLanguage: English \n \n","torrent":{"xt":"urn:btih:93f4dd584defe2af2b2630b08c9743dd1d3b3915","amp;dn":"Supernatural+Selection%3A+How+Religion+Evolved","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"93f4dd584defe2af2b2630b08c9743dd1d3b3915","infoHashBuffer":{"type":"Buffer","data":[147,244,221,88,77,239,226,175,43,38,48,176,140,151,67,221,29,59,57,21]},"announce":[],"urlList":[]}}