{"title":"Ashes To Ashes Season 1","uid":4293313,"size":5851271012,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:94c8733c2d2d473078a97d62115a844a77a2afab&amp;dn=Ashes+To+Ashes+Season+1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Canneberge","files":8,"time":1215988599,"description":"Season 1, Episode 1: Episode #1.1\nOriginal Air Date: 7 February 2008\nWhen DI Alex Drake is shot and lands in 1981, she comes face-to-face with DCI Gene Hunt, the relic of old-fashioned policing she read about in Sam Tyler\\&amp;#039;s reports. Alex thinks she is in a coma and needs Hunt\\&amp;#039;s help to go after Layton, the man who shot her in 2008. She is confident she knows the rules of the game, but with no contact from the outside world Alex has to contend with a terrifying possibility.\n\nSeason 1, Episode 2: Episode #1.2\nOriginal Air Date: 14 February 2008\nIt\\&amp;#039;s the week of the Royal Wedding, and CID is under pressure to keep the streets quiet. Realising she is stuck here for now, Alex is desperate for escapism. She goes on a date with a handsome Thatcherite and makes contact with her mother, Caroline. As bombs threaten to ruin Charles and Diana\\&amp;#039;s big day, Gene needs Alex to stop being distracted and acknowledge this world has the power to hurt.\n\nSeason 1, Episode 3: Episode #1.3\nOriginal Air Date: 21 February 2008\nWhen a prostitute complains of rape, Alex has a tough time convincing Gene to take the case seriously. She is the lone voice in CID, and only the link to a recent murder victim makes Gene take the investigation further. The pursuit of the attacker takes them undercover to a fancy dress boat party, but has Alex\\&amp;#039;s determination got the better of her, and is her effort to prove a point masking her judgment?\n\nSeason 1, Episode 4: Episode #1.4\nOriginal Air Date: 28 February 2008\nWhen the body of a worker at a nuclear research centre disappears from the morgue, it smacks of conspiracy to Alex. Was Martin Kennedy killed because he had proof the government was testing neutron bombs? Gene is adamant that murder has simpler motives, and a link to Alex\\&amp;#039;s mother gives him at least one suspect in an investigation that leads them onto dangerous territory.\n\nSeason 1, Episode 5: Episode #1.5\nOriginal Air Date: 6 March 2008\nSimon Neary is a gangster Gene has wanted to nail for years. When the team discovers that his latest deal is to obtain guns, the case takes on another imperative for Alex. Is stopping the guns a way to stop herself getting shot in 2008? Gene is shocked by how far Alex is prepared to go, including trying to persuade Neary\\&amp;#039;s young boyfriend to turn informant. Would she put a civilian at risk?\n\nSeason 1, Episode 6: Episode #1.6\nOriginal Air Date: 13 March 2008\nAlex thinks she\\&amp;#039;s close to death and has to keep her brain alive by solving the case: a raid at a Post Office. Gene believes the culprit is Chas Cale, a blagger he crossed swords with years ago. When Chas claims he\\&amp;#039;s too ill and too old, Gene reflects on whether he too is over the hill. For once, Alex needs Gene to be strong for her. She fears she can\\&amp;#039;t solve the case alone and is desperate not to die in 1981.\n\nSeason 1, Episode 7: Episode #1.7\nOriginal Air Date: 20 March 2008\nThousands of pounds collected for charity have been stolen, and the only lead is Gil Hollis, the man who raised it. Alex is sure that Gil knows more than he realises and that she can coax it out of him. But when Gene is humiliated on a TV appeal, he resorts to his \\&amp;#039;fists first, questions later\\&amp;#039; method. Can Alex prevent Gene going off the rails just at the point when she needs to stay in control, and if she can\\&amp;#039;t, will someone die?\n\nSeason 1, Episode 8: Episode #1.8\nOriginal Air Date: 27 March 2008\nIt\\&amp;#039;s the biggest day of Alex\\&amp;#039;s life: the day her parents were killed. She believes that if she can prevent this from happening she can leave the prison of 1981 and get back to her daughter Molly. With Gene waylaid by a station inspection, Alex needs to use every ounce of her strength and energy to stop the elements coming together, throw a cog into the wheel of fate, and finally return home.\n\n","torrent":{"xt":"urn:btih:94c8733c2d2d473078a97d62115a844a77a2afab","amp;dn":"Ashes+To+Ashes+Season+1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"94c8733c2d2d473078a97d62115a844a77a2afab","infoHashBuffer":{"type":"Buffer","data":[148,200,115,60,45,45,71,48,120,169,125,98,17,90,132,74,119,162,175,171]},"announce":[],"urlList":[]}}