{"title":"Da.Vincis.Demons.S02E01.Xvid-AJAXEN.avi","uid":9813184,"size":377274966,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:95b20e090d5b5d4585f6d444f909b5a478085f29&amp;dn=Da.Vincis.Demons.S02E01.Xvid-AJAXEN.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ajaxen94","files":-1,"time":1395575146,"description":"&quot;Da Vinci's Demons&quot; -- In a world where thought and faith are controlled, one man fights to set knowledge free. The secret history of Leonardo da Vinci's tantalizing life reveals a portrait of a young man tortured by a gift of superhuman genius. He is a heretic intent on exposing the lies of religion. An insurgent seeking to subvert an elitist society. A bastard son who yearns for legitimacy with his father.\n\nHe finds himself in the midst of a storm that has been brewing for centuries. A conflict between truth and lies, religion and reason, past and future. His aspirations are used against him by the opposing forces of the time - luring him into a game of seduction where those who despise his intellect need him most. Leonardo must take up the fight against foes who use history to suppress the truth. A hero armed only with genius, da Vinci stands alone against the darkness within, and the darkness without.\n\nFacing an uncertain future, his quest for knowledge nearly becomes his undoing as he explores the fringes of his own sanity. Da Vinci throws himself into his genius and emerges as an unstoppable force that lifts an entire era out of darkness and propels it into light. His story becomes a mirror into our own world, calling us all to join his fight to Free the Future.\naspect ratio...640x360\nframe rate...25\nbit rate...520 - 775\naudio mp3 stereo...96... 48khz\ncodec...Xvid avi\nre-converted using FORMAT FACTORY\ni download the smallest files i can find and re-convert them to xvid avi for my own use as  i  can't play any other format on my player so i thought i would upload them for anyone else who might  be able to use them ,i dont have a very fast upload speed so please be patient\n","torrent":{"xt":"urn:btih:95b20e090d5b5d4585f6d444f909b5a478085f29","amp;dn":"Da.Vincis.Demons.S02E01.Xvid-AJAXEN.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"95b20e090d5b5d4585f6d444f909b5a478085f29","infoHashBuffer":{"type":"Buffer","data":[149,178,14,9,13,91,93,69,133,246,212,68,249,9,181,164,120,8,95,41]},"announce":[],"urlList":[]}}