{"title":"Dead Ringers DVD ISO InFeCtiouS(JDPennington)[ExtraTorrent]","uid":5573828,"size":4681443328,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:965fb0c7d559d5fc8c638a84af43ae601e489061&amp;dn=Dead+Ringers+DVD+ISO+InFeCtiouS%28JDPennington%29%5BExtraTorrent%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"raymondhome","files":-1,"time":1274326660,"description":"Love for All and Sharing is the first step to solving all the problems of humanity.\n\nWebsites I want to share.\n\n    &lt;a href=&quot;\nhttp://www.shareintl.org/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.shareintl.org/&lt;/a&gt;\n\n    &lt;a href=&quot;\nhttp://www.lightmiddleway.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.lightmiddleway.com&lt;/a&gt;\n\n\nThank you very much\n\nNo credit for me...credit to EVERYONE for sharing\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/raymondhome/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/raymondhome/&lt;/a&gt;\n\nPLOT\nLike many other films by Canadian director David Cronenberg (especially Crash), Dead Ringers presents the cinematic and psychological equivalent of an automobile accident--you dare not look, but you can't turn away. The film marked a directorial breakthrough for Cronenberg, who was able to continue some of the themes explored in his earlier horror films while graduating to a higher, more critically &quot;respectable&quot; level of artistic sophistication. The film is loosely based, amazingly enough, on a true story about twin gynecologists who routinely traded each others' identities, lives and even lovers. Utilizing innovative split-screen technology (years before computer manipulation made such trickery much easier), the film stars Jeremy Irons in flawless dual roles as the identical brothers Beverly and Elliot Mantle. Their ability to instantly switch identities leads them to a shared relationship with a well-known actress (Genevieve Bujold) and, ultimately, a physical and psychological tailspin that sends them both to the brink of madness and death. The scenario suggests that both men are halves of a whole, and that one cannot exist without the other. But when Beverly pursues a kinky, drug-addicted affair with the actress, his more self-controlled brother is helpless to prevent their mutual decline. In this way Dead Ringers becomes a fascinating and stylistically clinical study of duality, and Cronenberg doesn't shy away from the dark and unpleasant aspects of the story. (One look at the movie's display of bizarre gynecological instruments and you'll know why women find this film particularly--and unforgettably--disturbing.)\n\nIMDb RATING: 7.3/10 (12,312 votes)\n\nRun Time: 116 minutes\nLanguage: English\n\ncredit InFeCtiouS (JDPennington) BIG BIG BIG TIME &amp; to all the people who made it possible for us to share this...especially EVERYONE involve in the production of the movie...IF YOU LIKE IT...BUY IT :)\n\n*****help what we can with others in need...the world is ONE big family*****","torrent":{"xt":"urn:btih:965fb0c7d559d5fc8c638a84af43ae601e489061","amp;dn":"Dead+Ringers+DVD+ISO+InFeCtiouS%28JDPennington%29%5BExtraTorrent%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"965fb0c7d559d5fc8c638a84af43ae601e489061","infoHashBuffer":{"type":"Buffer","data":[150,95,176,199,213,89,213,252,140,99,138,132,175,67,174,96,30,72,144,97]},"announce":[],"urlList":[]}}