{"title":"Shakira feat. Wyclef Jean - Hips Don't Lie (Live)","uid":4511685,"size":138205188,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:9660d4ad239d231fceb4d30ba9409363686ad872&amp;dn=Shakira+feat.+Wyclef+Jean+-+Hips+Don%5C%27t+Lie+%28Live%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":-1,"time":1226798926,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 256 kbps\n\n\nA live performance by Shakira &amp; Wyclef Jean of &quot;Hips Don&amp;#039;t Lie&quot; from MTV TRL Spring Break. The quality isn&amp;#039;t the best but I thought some of you might want it.\n\n\n\n&quot;Hips Don&amp;#039;t Lie&quot; is a Grammy Award-nominated Latin pop song based in a salsa and Cumbia mix and fused with reggaeton beat (reggaeton pop) performed by Colombian singer Shakira and Haitian rapper Wyclef Jean. The song is a remake of Jean&amp;#039;s 2004 song &quot;Dance Like This&quot; and takes some of its instrumentation from Jerry Rivera&amp;#039;s &quot;Amores Como El Nuestro&quot; (which was also used for Lord Tariq and Peter Gunz&amp;#039;s hit single &quot;DÃƒÂ©jÃƒÂ  Vu (Uptown Baby).&quot;). Shakira wrote some parts of the new version, and co-produced the song. The song was released as the second single from Shakira&amp;#039;s second English album Oral Fixation Vol. 2 in 2006. &quot;Hips Don&amp;#039;t Lie&quot; became a global success, topping the charts in at least 55 countries. It became Shakira and Wyclef&amp;#039;s first (and to date, only) number-one single in the U.S.. The song became one of the world&amp;#039;s best-selling singles of all time and one of the hottest songs of summer 2006. In the UK, this was Wyclef&amp;#039;s third number-one hit (after The Fugees&amp;#039; &quot;Killing Me Softly&quot; and &quot;Ready Or Not&quot;) and Shakira&amp;#039;s first. In many other countries, it became Shakira&amp;#039;s second number one, (following the massive success of &quot;Whenever, Wherever&quot;) and her third number one single in other countries such as Australia and Netherlands (after &quot;Underneath Your Clothes&quot;).\n\nAccording to Media Traffic, &quot;Hips Don&amp;#039;t Lie&quot; is the third most successful song since 1998, only behind Cher&amp;#039;s 1999 hit &quot;Believe&quot; so far and &quot;Apologize&quot; by Timbaland feat. One Republic, the second successful single in the twenty first century, the forty-sixth most successful song in music history and also Shakira and Wyclef&amp;#039;s most successful single ever, amassing more than 10,000,000 million points. The song made Shakira the only Colombian and South American artist in history to top the U.S. Hot 100.\n\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:9660d4ad239d231fceb4d30ba9409363686ad872","amp;dn":"Shakira+feat.+Wyclef+Jean+-+Hips+Don%5C%27t+Lie+%28Live%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9660d4ad239d231fceb4d30ba9409363686ad872","infoHashBuffer":{"type":"Buffer","data":[150,96,212,173,35,157,35,31,206,180,211,11,169,64,147,99,104,106,216,114]},"announce":[],"urlList":[]}}