{"title":"Ghostpoet - Some Say I So I Say Light (2013) [FLAC]","uid":8486854,"size":325005031,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:972b57eab12ad995d23cad88f97dc638b05168db&amp;dn=Ghostpoet+-+Some+Say+I+So+I+Say+Light+%282013%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"politux","files":-1,"time":1368891067,"description":"\n  Ghostpoet - Some Say I So I Say Light (2013) [FLAC]\n\n  Released: 2013\n  Duration: 53:42\n  Genre: Electronic, Rap\n  Style: British Rap\n  Source: WEB\n  Codec: FLAC\n  Bit Rate: ~ 800 kbps\n  Bits Per Sample: 16\n  Sample Rate: 44,100 Hz\n\n  01 Cold Win \n  02 Them Waters \n  03 Dial Tones \n  04 Plastic Bag Brain \n  05 Thymethymethyme \n  06 Meltdown\n  07 Sloth Trot\n  08 Dorsal Morsel \n  09 MSI MusmiD \n  10 12 Deaf \n  11 Comatose \n\n  Even with a Mercury Prize nomination under his belt, London rapper Ghostpoet could walk through a crowd of music fans without notice and his albums don't land as much as emerge out of the mist. Maybe it's because his delivery is like Roots Manuva on sizzurp or that the lead single here is &quot;MSI musmiD,&quot; which comes off as a Dali dream sequence directed by Man Ray, but deciphering Some Say I So I Say Light is certainly a joy for returning fans. Maybe the album's title references a desire to communicate something brighter or more &quot;up,&quot; as the lyrics are more audible here than previously, or in the case of &quot;Them Waters,&quot; it's the music that's luminous, as balloons of synthesizer sound pass before the sun as they rise toward the sky. &quot;Plastic Bag Brain&quot; is the ultimate example and towering highlight with its combo of indie guitar riffing, Radiohead keyboards, and crackable code (his brain wanders like a plastic bag blowin' in the wind), and here's hoping that &quot;Dorsal Morsel&quot; is Sir Mix-A-Lot's &quot;Baby Got Back&quot; for the Wittgenstein set, because a mention of women's jeans, &quot;popping like a Pringle pack,&quot; and &quot;revel in the elegance&quot; all seem to point toward it. At 12 tracks long, the album is right-sized and flows beautifully with guests Tony Allen, Woodpecker Wooliams, Gwilym Gold, and This Heat's Charles Hayward adding some new sounds for the rapper to flow over. With Richard Formby and the MC himself on production, Ghostpoet remains the most aptly named rapper in the game with his excellent sophomore effort.","torrent":{"xt":"urn:btih:972b57eab12ad995d23cad88f97dc638b05168db","amp;dn":"Ghostpoet+-+Some+Say+I+So+I+Say+Light+%282013%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"972b57eab12ad995d23cad88f97dc638b05168db","infoHashBuffer":{"type":"Buffer","data":[151,43,87,234,177,42,217,149,210,60,173,136,249,125,198,56,176,81,104,219]},"announce":[],"urlList":[]}}