{"title":"Hair Force One #1 - Hairy Interracial Porn XXX","uid":8521154,"size":2857698891,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:9851847f7afd4582740f7610404d4aaa42d7f957&amp;dn=Hair+Force+One+%231+-+Hairy+Interracial+Porn+XXX&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"KidAtomic","files":1,"time":1369920471,"description":"Hair Force One: White hair pie for the big black guy! Horny white whores have hairy muffs and are looking to get their holes stuffed. A 100% interracial affair with tons of pussy hair!!!\n\n Scene 1. Lara, Maya, Joachim Kessef\n Scene 2. Camilla Ken, Wesley\n Scene 3. Priscilla, Joachim Kessef, Wesley\n Scene 4. Helena Bush, Franco Roccaforte\n Scene 5. Ventura, Joachim Kessef\n Scene 6. Gabriela, Kid Jamaica\n\nLength 2 hrs. 28 mins.\nRating XXX\nReleased Jun 07 2007\nProduction Year 2006\nStudio Third Degree Films\n\nActresses:\n Camilla Ken (as Camilla) [IR]\n Gabriela [IR]\n Helena Bush [IR]\n Lara (as Lis) [Anal IR]\n Maya [Anal IR]\n Priscilla [Anal DP IR]\n Ventura [IR]\n\nActors:\n Franco Roccaforte\n Joachim Kessef\n Kid Jamaica\n Wesley\n\n\n\n\nFirst Impressions:\nThere are basically two schools of thought on full frontal female hygiene. Some like their pussy as smooth as a baby's bottom (and the analogy is strangely apropos), stubble free, and completely hairless - the better to see the flopping labia, one imagines (though other more questionable rationales could exist). Then there are those who adore a tiny patch of hair - a landing strip of love above the vaulted walls of sexual sugar, or a delicious design accentuating a woman's wondrous womb. Of course, there are extremes on both ends, but when it comes to femme fur, the obvious outer limits are evocatively old school. To paraphrase the notorious '60s musical, there are men out there who want vaginas (and asses) with hair, long beautiful hair. Shining, gleaming, streaming, flaxen, waxen. Drew Smith's dopey Hair Force One tries to celebrate the coated cunt, complete with gals who've allowed their nether regions to sprout Sasquatch like locks. Yet its Eastern European approach (odd) matched by Smith's constant discussion of pinball machines (odder) and his collection of clipped pubic hair (oddest) turns this fetish film into a farce.\n\nThe Sex Scenes:\nPart compilation (meaning the title takes unrelated scenes of hirsute honeys and incorporates them into the main narrative), part international smut spoof, the interracial element at the center of Hair Force One will either stimulate or shrink your interest in the title, depending on your tendencies. Half the cast can't speak English (some of the movie was supposedly made in Russia), while others are merely conduits for giant black dick. While the men are named in the credits, they are not listed per scene, so it's hard to figure out whose zooming who. And since we've already established that the gals are more or less interchangeable, there's a real impersonal vibe to the entire production. Drew drives it along with his weirdo witty banter, but what we really want is red hot humping. We only get some of that here.","torrent":{"xt":"urn:btih:9851847f7afd4582740f7610404d4aaa42d7f957","amp;dn":"Hair+Force+One+%231+-+Hairy+Interracial+Porn+XXX","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9851847f7afd4582740f7610404d4aaa42d7f957","infoHashBuffer":{"type":"Buffer","data":[152,81,132,127,122,253,69,130,116,15,118,16,64,77,74,170,66,215,249,87]},"announce":[],"urlList":[]}}