{"title":"The Young Lions 1958 Eng Ger Fra Spa Ita H264 AAC Sub","uid":4911813,"size":890000000,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:987aba5dd38855860dcb966b564312c80202c897&amp;dn=The+Young+Lions+1958+Eng+Ger+Fra+Spa+Ita+H264+AAC+Sub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"siggomar","files":21,"time":1243200917,"description":"The Young Lions\nDeutsch:\tDie jungen LÃƒÂ¶wen\nFranÃƒÂ§ais:\tLe Bal des maudits\nEspaÃƒÂ±ol:\tEl baile de los malditos\nItaliano:\tI giovani leoni\n\nYear: 1958\nDirector: Edward Dmytryk\nFilm length: 2h39\n\nvideo codex: H.264 AVC 704 x 400 (16/9) Black &amp; White\naudio codex: He-AAC Stereo 64 kb/s for each language\n\nlanguages: English, Deutsch, FranÃƒÂ§ais, Spanish, Italiano\nsubtitles: English, Deutsch, FranÃƒÂ§ais, Spanish, Italiano\n\nThough several concessions to the censors and the box-office were made in adapting Irwin Shaw's bestseller The Young Lions to the screen, the end result is generally effective and satisfying. Set during World War II, the film concentrates on three individuals, one German, two American. Lt. Christian Diestl (Marlon Brando) plays an idealistic German whose early fascination with Nazism leads to doubt and disillusionment. American entertainer Michael Whiteacre (Dean Martin), on the verge of the Big Time, does his best to dodge the draft but ends up in uniform all the same. And American Jew Noah Ackerman (Montgomery Clift), so sensitive that he's practically breakable, must come to grips with anti-Semitism, not only from the Germans but also from his fellow soldiers. Romance enters the picture in the form of Hope Lange as Clift's gentile girlfrind, Barbara Rush as the socialite who shames Martin into joining up, and May Britt as Brando's vis-a-vis.\nScreenwriter Edward Anhalt was obliged to shoehorn in a boot-camp sequence indicating that the Brass disapproved of the bigoted behavior of Clift's topkick Lee van Cleef (as if racism was a mere aberration during the 1940s), and to slightly&quot; alter the ending of the book, in which the embittered but still patriotic Brando character, shouting &quot;Welcome to Germany!,&quot; machine-guns the Martin and Clift characters (in the film, it is Brando who bites the dust, symbolically dying for Hitler's sins). Maximillian Schell offers a starmaking turn as Brando's cynical comrade, while an uncredited John Banner, &quot;Sergeant Schultz&quot;\non Hogan's Heroes, shows up as a pompous burgomeister who feigns ignorance of the hellish concentration camp in his community.\n\nmore reviews:\nhttp://en.wikipedia.org/wiki/The_Young_Lions\nhttp://www.imdb.com/title/tt0052415/\n\nIf you want to burn it on a 700 MB CD, you will have to remove at least 2 audio tracks, with MKVtoolnix.","torrent":{"xt":"urn:btih:987aba5dd38855860dcb966b564312c80202c897","amp;dn":"The+Young+Lions+1958+Eng+Ger+Fra+Spa+Ita+H264+AAC+Sub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"987aba5dd38855860dcb966b564312c80202c897","infoHashBuffer":{"type":"Buffer","data":[152,122,186,93,211,136,85,134,13,203,150,107,86,67,18,200,2,2,200,151]},"announce":[],"urlList":[]}}