{"title":"Tribes 1970 Jan Michael Vincent &amp; Darren McGavin","uid":9786567,"size":3314577408,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:98aa30245ce1eb882290da60284c20d601da12d0&amp;dn=Tribes+1970+Jan+Michael+Vincent+%26amp%3B+Darren+McGavin&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"albabe","files":-1,"time":1395177170,"description":"I think this is a great movie.  Really good performances from Jan Michael Vincent as the Pacifist Marine and Darren McGavin as his Drill Sgt..  The other draftees are also well-cast and well-played.  Earl Holliman also gives a great performance as the asshole other Drill Sgt..\n\nA good friend of mine authored the VIDEO_TS folder from a VHS tape from a Movie Channel Broadcast of this from a few years back.  Very good quality.\n\nFrom IMDB:\nAmong the new recruits in a U.S. Marine basic-training platoon is Adrian, a long-haired member of the hippie generation, opposed to blind allegiance to authority and the complete opposite of Gunnery Sergeant Tom Drake, who is assigned as Drill Instructor for Adrian's platoon. Drake's job as a D.I. is to break down the individuality of his recruits in order to rebuild them as a military unit, and he sets out to break Adrian's particularly contrary spirit. But Adrian's gentle will is difficult to break, and eventually both men come to learn something about what the other has to offer.\n\nTaglines: WANTED by the US Marines: for AWOL, insubordination . . . and doing his thing!\n\nWritten byÂ Jim Beaver \nWiki:\nTribes received three Primetime Emmy Awards for Sound Editing (Don Hall, Jack Jackson, Bob Weatherford and Dick Jensen, sound editors), Film Sound Mixing (Theodore Soderberg, mixer) and Original Teleplay (Marvin Schwartz and Tracy Keenan Wynn, writers). It was also nominated for Directorial Achievement in Drama (Joseph Sargent).","torrent":{"xt":"urn:btih:98aa30245ce1eb882290da60284c20d601da12d0","amp;dn":"Tribes+1970+Jan+Michael+Vincent+%26amp%3B+Darren+McGavin","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"98aa30245ce1eb882290da60284c20d601da12d0","infoHashBuffer":{"type":"Buffer","data":[152,170,48,36,92,225,235,136,34,144,218,96,40,76,32,214,1,218,18,208]},"announce":[],"urlList":[]}}