{"title":"[DvdRip-Xvid-Ita-Mp3]Juno","uid":4822982,"size":701519872,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:99027e2d64bd5c686ab845ce7a899d3471f991b4&amp;dn=%5BDvdRip-Xvid-Ita-Mp3%5DJuno&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Volpebianca","files":1,"time":1238839522,"description":"Juno MacGuff (Ellen Page), ÃƒÂ© un'adolescente schietta e sicura di sÃƒÂ© che riesce a mantenere il controllo sulla sua vita con apparente indifferenza e distacco mentre vive tutti i turbamenti emotivi di una gravidanza che la traghetterÃƒÂ  dall'adolescenza all'etÃƒÂ  adulta; in realtÃƒÂ , dietro un'apparente forza e leggerezza si nasconde una teenager che sta semplicemente cercando di capire cosa fare. Un pomeriggio noioso come tanti si trasforma in qualcosa di diverso quando Juno decide di fare sesso con Bleeker (Michael Cera) un ragazzo timido e riservato. Ma quando scopre di essere incinta, con la collaborazione della sua migliore amica Leah (Olivia Thirlby) Juno escogita un piano per trovare una perfetta coppia di genitori per il bambino che porta in grembo. Dopo qualche ricerca, le due ragazzine mettono gli occhi su Mark e Vanessa Loring (Jason Bateman e Jennifer Garner), una benestante coppia che vive nei quartieri alti e che sta cercando di avere un bambino in adozione. Per sua fortuna, Juno puÃƒÂ² contare sull'aiuto ed il sostegno del padre e della matrigna (J.K. Simmons e Allison Janney) i quali, dopo lo shock iniziale le danno tutto l'appoggio di cui ha bisogno. Ma quando sta per arrivare la fatidica data del parto, la vita apparentemente perfetta ed idilliaca di Mark e Vanessa comincia a mostrare qualche crepa. Con il passare dei mesi, i cambiamenti fisici di Juno rispecchiamo la sua crescita interiore e alla fine, mostrando un coraggio e un'intelligenza piuttosto insoliti in una ragazzina della sua etÃƒÂ , Juno affronterÃƒÂ  i suoi problemi a testa alta con un'esuberanza giovanile che ÃƒÂ¨ al contempo intelligente ed inaspettata.","torrent":{"xt":"urn:btih:99027e2d64bd5c686ab845ce7a899d3471f991b4","amp;dn":"%5BDvdRip-Xvid-Ita-Mp3%5DJuno","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"99027e2d64bd5c686ab845ce7a899d3471f991b4","infoHashBuffer":{"type":"Buffer","data":[153,2,126,45,100,189,92,104,106,184,69,206,122,137,157,52,113,249,145,180]},"announce":[],"urlList":[]}}