{"title":"Friends.Mononokeshima.no.Naki.2011.DVDRip.AC3.HORiZON-ArtSubs","uid":7375815,"size":1465305088,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:99293f943fd3a684f1452cfc8e48aa2df95fc8bf&amp;dn=Friends.Mononokeshima.no.Naki.2011.DVDRip.AC3.HORiZON-ArtSubs&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"shetkhs","files":1,"time":1340358039,"description":"In a country strangely similar to Japan, there is an island floating on the middle of a lake. It is said that monsters have been living there from the ancient time so that people feared the island calling it &quot;the Monster Island.&quot; But in reality, the monsters living there are sweet and are in fact living their lives fearing the humans.\n \n\nOne day, a human child named Kotake wanders off into the island. Surprisingly, Naki, a red ogre who is difficult to please and therefore unpopular among others, ends up taking care of him. Naki hates other ogres as well as humans, and has been living a lonely life, but starts living together with his only friend Gunjo, who is a blue ogre, and the human child Kotake. Through the life with Gunjo and Kotake, Naki gradually opens up his heart and gets to know the meaning of tenderness.\n\n \nHowever, the merry living together doesn't last long. Since Kotake comes to miss his parents, Naki sends him back to his village. But when the villagers see Naki, they beat him off, and Naki is stripped away from Kotake. Naki gets depressed after losing Kotake. Seeing his discouraged friend, Gunjo makes up his mind to do a certain thing, which separates Gunjo and Naki forever.\n\n\nThe first 3D, CGI feature film from Japan, directed by Takashi Yamazaki.\n\nBased on an childrenÎ“Ã‡Ã–s book, Friends: Naki on the monster island (Mononoke Shima No Naki) tells a story about the unconditional friendship between two monsters and a human child.\n\n \nTakashi Yamazaki was responsible for Space Battleship Yamato, a successful sci-fi live-action film, based on a TV series with the same name. Now he fully moves to anime territory (kid-friendly, though).\n \n\nThe narrative of Friends brings Shrek in mind,  whereas its visual look references Monsters, Inc.\n\n\nAudio: japanese\n\n","torrent":{"xt":"urn:btih:99293f943fd3a684f1452cfc8e48aa2df95fc8bf","amp;dn":"Friends.Mononokeshima.no.Naki.2011.DVDRip.AC3.HORiZON-ArtSubs","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"99293f943fd3a684f1452cfc8e48aa2df95fc8bf","infoHashBuffer":{"type":"Buffer","data":[153,41,63,148,63,211,166,132,241,69,44,252,142,72,170,45,249,95,200,191]},"announce":[],"urlList":[]}}