{"title":"Heytesburg - From The River I Come (2011 EP) [FLAC]","uid":9535430,"size":103121500,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:995e030d87b14078c5d5cb3d21a0e408100d5c67&amp;dn=Heytesburg+-+From+The+River+I+Come+%282011+EP%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"cjefton","files":8,"time":1390922376,"description":"01 From The River I Come (1:26)\n02 The Watcher (4:20)\n03 To Walk Where David Walks (5:12)\n04 Once Were Kings (4:01)\n05 To The Desert I Go (1:19)\n\nFrom The River I Come, To The Desert I Go represents the bands foray into Far Eastern influenced music. Utilising a variety of instruments from various cultures such as the duduk, kalimba, congas, didgeridoo, sitar, rain stick and even a Chinese gong, they have fused distinctive tribal beats and creative song structures into a unique non traditional approach to music. Yet at the heart of each song is always a strong sense of melody.\n\nLead single The Watcher is a fine example of this; weaving mysterious duduk lines over intricate guitar culminating in a veritable mid song 'parting of the clouds' before a crescendo of magnificent proportions. To Walk Where David Walks features groove laden bass over infectious far eastern rhythms and intriguing sitar lines. Perhaps the most madly inventive song on the EP, Once Were Kings starts with a whisper and ends with a roar that has to be heard to be understood. Finally, the title tracks, featuring tuvan throat singers, complete the EP both sonically and thematically.\n\nAnd a theme there is, for From The River I Come, To The Desert I Go is in itself a journey both musically and conceptually from beginning to destination, life to death and rise to fall...\n\nAll songs written and produced by Heytesburg\nEngineered by Alan Smith at Bergerk Studios\nMastered by Simon Struthers at Forensic Audio\nArtwork/Photography by Treehouse Collective ","torrent":{"xt":"urn:btih:995e030d87b14078c5d5cb3d21a0e408100d5c67","amp;dn":"Heytesburg+-+From+The+River+I+Come+%282011+EP%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"995e030d87b14078c5d5cb3d21a0e408100d5c67","infoHashBuffer":{"type":"Buffer","data":[153,94,3,13,135,177,64,120,197,213,203,61,33,160,228,8,16,13,92,103]},"announce":[],"urlList":[]}}