{"title":"Ann Rabson - 1997 - Music Makin' Mama FLAC","uid":9122246,"size":377226553,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:999c6ca933f367920f0a2b32263aaaa3011395e7&amp;dn=Ann+Rabson+-+1997+-+Music+Makin%27+Mama+FLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"eika256","files":-1,"time":1383156969,"description":"Ann Rabson - 1997 - Music Makin' Mama\n\nMusic Makin' Mama starts with a bang and ends with a boogie -- the bang is Rabson's revved-up take on Huey &quot;Piano&quot; Smith's &quot;Baby, Every Once in a While,&quot; and the boogie is a solo instrumental ode to two of her piano heroes, Jimmy Yancey and Meade Lux Lewis. Between these two end pieces, Rabson navigates through bluesy territory with her trademark gusto, digging up songs by Ray Charles, Big Bill Broonzy, Bessie Smith, and Cow Cow Davenport, while also throwing in a few originals for good measure. Not surprisingly, Music Makin' Mama will sound a fair bit rootsier than the typical Saffire -- The Uppity Blues Women album; Rabson, after all, has long been the traditionalist torchbearer in the group, and her burning reverence for the dusty, old blues song certainly shines through here. While this is technically her debut solo album, Rabson has been playing some of these songs for decades, and there's nothing tentative about her playing here. The solo cuts in particular (Smith's &quot;He's Got Me Goin',&quot; Roosevelt Sykes' &quot;Skin and Bones,&quot; and Rabson's &quot;Blue Boogie&quot;) stand out for their simple charm and pinpoint delivery. On the ensemble numbers, Rabson gets a helping hand from an all-star backing band that includes saxman Greg Piccolo, violinist Mimi Rabson (Ann's sister), and Alligator labelmates John Cephas, Phil Wiggins, and Bob Margolin. In 1998, Music Makin' Mama was nominated for two W.C. Handy Awards (for Acoustic Blues Album of the Year and Traditional Blues Album of the Year). (AllMusic)\n\nTrack list:\n01 - Baby, Every Once In A While\n02 - Givin' It Away\n03 - No Later On\n04 - One Meatball\n05 - Snatchin' And Grabbin'\n06 - Gonna Stop You From Giving Me The Blues\n07 - He's Got Me Going\n08 - Music Makin' Mama\n09 - Another You\n10 - What I Don't See Can't Hurt Me\n11 - Serial Love\n12 - Ain't That A Shame\n13 - Hallelujah, I Just Love Him So\n14 - Skin And Bones\n15 - I Haven't Got A Clue\n16 - Blue Boogie\n\nPersonnel:\nMimi Rabson - violin\nAnn Rabson - vocals, guitar, acoustic guitar, piano\nPhil Wiggins - harmonica\nAlso: Bob Margolin, Greg Piccolo, Big Joe Maher, John Cephas\n\nEnjoy and share! ","torrent":{"xt":"urn:btih:999c6ca933f367920f0a2b32263aaaa3011395e7","amp;dn":"Ann+Rabson+-+1997+-+Music+Makin%27+Mama+FLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"999c6ca933f367920f0a2b32263aaaa3011395e7","infoHashBuffer":{"type":"Buffer","data":[153,156,108,169,51,243,103,146,15,10,43,50,38,58,170,163,1,19,149,231]},"announce":[],"urlList":[]}}