{"title":"Sacred Wells (2009) - (Malestrom)","uid":5156290,"size":4022428,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:99e48fc4ebfb67c45ecea24708905317d84e96c5&amp;dn=Sacred+Wells+%282009%29+-+%28Malestrom%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"malestrom_HH","files":1,"time":1257871813,"description":" &lt;a href=&quot;http://bayimg.com/faEnJaaCm&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://bayimg.com/faEnJaaCm&lt;/a&gt;\n\n\nSacred Wells: A Study in the History, Meaning, and Mythology of Holy Wells &amp; Waters\n200 pages | Algora Publishing; 2nd, revised and expanded edition (June 12, 2009) | 0875867189 | PDF \n\nSacred Wells is an in depth study of springs, wells and waters that have been venerated from California to Cornwall, Russia to Australia.\nTales of faeries, black hounds, hauntings and miraculous cures are explored. Many of these sites are still locations for religious festivals and ritual, unchanging for hundreds of years.\nThis book is a welcome addition to the scant literature concerning holy wells, springs, and rivers around the world, one of just a few serious works outside of regional studies which discusses, in depth, the folklore, mythology, and archaeology of holy wells and springs, as well as rituals that still exist today at many of the sacred water sites around the world. Sacred Wells is a fascinating look at the continuation of ancient pagan traditions into modern culture. Many of these water sources, from California to Cornwall and from Estonia to Australia, are still frequented for their miraculous healing powers. Mysterious beasts, ghosts, fairies, and gods are still believed to reside in and near these holy areas. This study examines the universal appeal of these sites and provides an excellent reference for anyone interested in folklore, history, and the development of religion.\n\nPreface by the Author:\nSacred Wells was originally published in 2002. Since that time, I have visited a large number of additional sacred sites, including those associated with Native American rock art, gargoyle-embellished cathedrals, sacred landscapes and, of course, sacred wells. I continue to travel back to the subject of holy wells and waters and when Algora Publishing gave me an opportunity to expanded and reissue the book in this present volume, I couldn t resist.\n\nMuch of our mythic environment is forgotten, discarded or abused. The thirst for coal and oil, for land for housing developments and business parks, and the desire to control the few wild rivers to harness energy, consistently degrades our habitat and the habitat of the wild animals that continue to struggle to survive. It also destroys much of the landscape that, for a variety of reasons, has a special meaning for various people, some of that revealed in ancient tales that used to be told. Now, many of the mysterious locations our ancestors held in awe are forgotten. I am pleased to reissue Sacred Wells so that these sacred places and their legends will continue to be known to those who may wish to learn from them and perhaps even to experience their special nature for themselves.\n\nSacred wells are recognized in nearly every culture and in every age. Long associated with feminine, divine power they are also seen as places of healing, magick, wisdom and sources to the Other World. Some believe that these wells were originally created to bring the moon and its powers to the earth, at least in its reflection. Water from these holy wells was believed to have the intrinsic value of fertility and life, and thereby love and sexuality. In many cultures, and for untold centuries, it has been believed that Holy wells are inhabited, or at least guarded, by nymphs and faeries. Holy wells are also contradictory. Traditions have held that they are life giving, they grant wishes, they heal, they foretell the future but also that they may take life, apply curses, and serve as residences for lost souls and supernatural mischief-makers.\n\nMost holy wells have been renamed after Christian saints but in many cases the ancient practices associated with them continue. Votive offerings are still left in secret at many out-of-the-way locations throughout Great Britain and Europe.\n\nWhat is most important is how these monuments affect us today. Do we find an important archetypal link in our concept of what is holy and divine through these wells? Do we find ourselves at peace when we visit these areas?","torrent":{"xt":"urn:btih:99e48fc4ebfb67c45ecea24708905317d84e96c5","amp;dn":"Sacred+Wells+%282009%29+-+%28Malestrom%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"99e48fc4ebfb67c45ecea24708905317d84e96c5","infoHashBuffer":{"type":"Buffer","data":[153,228,143,196,235,251,103,196,94,206,162,71,8,144,83,23,216,78,150,197]},"announce":[],"urlList":[]}}