{"title":"JeeKee's Kidstime 2 DVD 5( 4 Films op 1 DVD Ned Audio) TBS","uid":6633923,"size":4525667664,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:9a7e77722ecaa9ea750c1ca9f44d36292601f143&amp;dn=JeeKee%5C%27s+Kidstime+2+DVD+5%28+4+Films+op+1+DVD+Ned+Audio%29+TBS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Marjanb","files":-1,"time":1314473757,"description":"JeeKee's Kidstime 2\n\nDeel 2 bevat de volgende vier films + HR Cover:\n\n\nRapunzel - Tangled\nHet verhaal over Prinses Rapunzel, die als baby is gestolen uit het paleis van haar ouders en door een heks genaamd Mother Gothel wordt opgesloten in een verborgen hoge toren, waar ze onmogelijk uit kan ontsnappen. Ze snakt naar avontuur in haar leven en droomt ervan de toren te verlaten om te zien waar de vreemde lichten, die ze elk jaar op haar verjaardag ziet, vandaan komen. Dat avontuur kan eindelijk beginnen als de knapste, maar ook beruchtste, crimineel van het koninkrijk, Flynn Rider, langs haar toren komt en naar boven klimt om zich te verstoppen. Ze maken samen de afspraak om uit de toren te ontsnappen en op zoek te gaan naar de lichten. Onderweg ontmoeten ze vele hilarische figuren en beleven ze een magisch avontuur.\n\nTinkerbell 1\nIn Pixie Hollow, waar alle feeÃƒÂ«n wonen, krijgen alle feeÃƒÂ«n iets te doen in de wisseling van de seizoenen, afhankelijk van hun talenten. De nieuwe fee Tinkerbell is niet blij met haar feeÃƒÂ«n talent als \\&quot;tinker\\&quot;. Ze denkt dat de talenten van andere feeÃƒÂ«n belangrijker zijn tijdens het wisselen van seizoenen. Ze probeert samen met haar vrienden Rosetta, Silvermist, Fawn en Iridessa haar talent te veranderen. Maar doordat ze probeert te veranderen wie ze is, loopt alles mis.\n\nTinkerbell 2\nOpnieuw begint Tinker Bell aan een magisch avontuur ver weg van Nooitgedachtland. Met de hulp van haar nieuwe vriend Blaze (een lichtgevende insect), zal zij een nieuwe maansteen moeten vinden. Deze bevat magisch stof. De reis is allesbehalve saai, aangezien Tinker Bell verstrikt raakt in allerlei gevaarlijke avonturen, en gered moet worden door haar oude vriend Terence. Bovendien leert Tinker Bell onderweg het belang van verantwoordelijkheid nemen, en wat ware vriendschap is.\n\nTinkerbell 3\nTijdens een zomer bezoek aan het vaste land, wordt Tinker Bell per ongeluk ontdekt en gevangen genomen door een klein meisje. De andere elfjes, geleid door Vidia, zetten een reddingsmissie op door een zware zomerstorm om Tinker Bell te bevrijden. Tinker Bell ontwikkelt echter een speciale band met het eenzame meisje en is vastbesloten om de relatie tussen haar en haar vader te verbeteren. Maar als Tink hierdoor haar redders wegstuurt, om haar nieuwe vriend te helpen; riskeert ze hiermee haar eigen veiligheid en de toekomst van alle elfjes.\n\n\n\t\n Category\t:\tVideo\n Format\t:\tDVD5\n Source\t:\tRetail\t\t\n Genre\t:\tAnimation Family Kinderfilm\n Language\t:\tDutch audio\nSubtitle\t:\tNo Subs\t \t \t \nFiles\t:\t104 Files\nSize\t:\t4.20 GB\n Filename\t:\tJeeKeeKidstime02\n\n \t\nEnjoy the Movie's\n\n************************************\n\nKom ook eens kijken :\n &lt;a href=&quot;\nhttp://www.black-sam.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.black-sam.org&lt;/a&gt;\n\nEnjoy\n\n*************************************\n \t\n\n \t \t \t \n \t\n","torrent":{"xt":"urn:btih:9a7e77722ecaa9ea750c1ca9f44d36292601f143","amp;dn":"JeeKee%5C%27s+Kidstime+2+DVD+5%28+4+Films+op+1+DVD+Ned+Audio%29+TBS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9a7e77722ecaa9ea750c1ca9f44d36292601f143","infoHashBuffer":{"type":"Buffer","data":[154,126,119,114,46,202,169,234,117,12,28,169,244,77,54,41,38,1,241,67]},"announce":[],"urlList":[]}}