{"title":"Injustice: Why social inequality persists","uid":8354501,"size":3626761,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9a9b9e697af65607de1e56d1ee0784618fcfd7b8&amp;dn=Injustice%3A+Why+social+inequality+persists&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mdusanjay","files":-1,"time":1365450069,"description":"Injustice: Why social inequality persists By Danny Dorling\n2010 | 400 Pages | ISBN: 1847424260 | PDF | 3 MB\n\n\n\nFew would dispute that we live in an unequal and unjust world, but what causes this inequality to persist? In the new paperback edition of this timely book, Danny Dorling, a leading social commentator and academic, claims that in rich countries inequality is no longer caused by not having enough resources to share but by unrecognized and unacknowledged beliefs which actually propagate it.\n\nBased on significant research across a range of fields, Dorling argues that, as the five social evils identified by Beveridge at the dawn of the British welfare state (ignorance, want, idleness, squalor, and disease) are gradually being eradicated they are being replaced by five new tenets of injustice: elitism is efficient, exclusion is necessary, prejudice is natural, greed is good, and despair is inevitable.\n\nWith an informal yet authoritative style, Dorling examines who is most harmed by these injustices, why, and what happens to those who most benefit. With a new foreword by Richard Wilkinson and Kate Pickett, authors of The Spirit Level, and a new afterword by Dorling himself examining developments during 2010, this book is hard-hitting and uncompromising in its call to action and continues to make essential reading for everyone concerned with social justice.","torrent":{"xt":"urn:btih:9a9b9e697af65607de1e56d1ee0784618fcfd7b8","amp;dn":"Injustice%3A+Why+social+inequality+persists","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9a9b9e697af65607de1e56d1ee0784618fcfd7b8","infoHashBuffer":{"type":"Buffer","data":[154,155,158,105,122,246,86,7,222,30,86,209,238,7,132,97,143,207,215,184]},"announce":[],"urlList":[]}}