{"title":"Edgar Broughton Band-Original Album Series[5CD][2014][320KBPS]","uid":10771393,"size":623673576,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:9af1b2cbd5d2c5c911d175407eb9524131113e8c&amp;dn=Edgar+Broughton+Band-Original+Album+Series%5B5CD%5D%5B2014%5D%5B320KBPS%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"LameDuck69","files":74,"time":1408080252,"description":"Edgar Broughton Band - Original Album Series [5 CD's][2014]\n\n\n\n\n\nDisc 1 [Wasa Wasa][1969]\n\n \n01. Death Of An Electric Citizen  \n02. American Boy Soldier   \n03. Why Can't Somebody Love Me  \n04. Neptune   \n05. Evil   \n06. Crying Band  \n07. Love In The Rain   \n08. Dawn Crept Away \n\n\n \nDisc 2 [Sing Brother Sing][1970]\n\n \n01. There's No Vibrations, But Wait  \n02. The Moth (Medley) \n03. Momma's Reward (Keep Them Freaks A-Rollin)   \n04. Refugee   \n05. Officer Dan   \n06. Old Gopher   \n07. Aphrodite   \n08. Granma   \n09. Psychopath   \n10. It's Falling Away  \n\n\n \nDisc 3 [Edgar Broughton Band][1971]\n\n \n01. Evening Over Rooftops \n02. The Birth \n03. Piece Of My Own   \n04. Poppy   \n05. Don't Even Know Which Day It Is   \n06. House Of Turnabout   \n07. Madhatter   \n08. Getting Hard/What Is A Woman For  \n09. Thinking Of You  \n10. For Dr Spock (Parts 1 &amp; 2) \n\n\n  \nDisc 4 [In Side Out][1972]\n\n \n01. Get Out Of Bed/There's Nobody There/Side By Side (Medley)   \n02. Sister Angela   \n03. I Got Mad   \n04. They Took It Away   \n05. Homes Fit For Heroes   \n06. Gone Blue   \n07. Chilly Morning Mama   \n08. The Rake   \n09. Totin' This Guitar   \n10. Double Agent   \n11. It's Not You 12. Rock N' Roll\n\n \nDisc 5 [Oora][1973]\n\n \n01. Hurricane Man/Rock N' Roller (Medley)   \n02. Roccococooler   \n03. Eviction   \n04. Oh You Crazy Boy!  \n05. Things On My Mind   \n06. Exhibits From A New Museum/Green Lights  \n07. Face From A Window/Pretty/Hi-Jack Boogie/Slow Down   \n08. Capers  \n\n\n\n\n320 KBPS [CBR]\n\nCover Art\n\n\n\n\n\n\nFrom Wikipedia:\n\n\nThe Edgar Broughton Band, founded in 1968 in Warwick, England, was an English psychedelic rock group.\n\nThe band started their career as a blues group under the name of The Edgar Broughton Blues Band, playing to a small following in the region around their hometown of Warwick. However, when the band began to lean towards the emerging psychedelic movement, dropping the 'Blues' from their name as well as their music, Victor Unitt left.\n\nIn 1968, the Edgar Broughton Band moved to Notting Hill Gate, London, seeking a recording contract and a wider audience, and were picked up by Blackhill Enterprises. Blackhill landed them their first record deal, on EMI's progressive rock label Harvest Records, in December 1968. Their first single was &quot;Evil&quot;/&quot;Death of an Electric Citizen&quot;, released in June 1969, which was also the first single released by Harvest.\n\nThe first single was followed by the Edgar Broughton Band's first album, Wasa Wasa. Wasa Wasa retained a heavily blues influenced sound that was hard-driven and propelled by Edgar Broughton's gritty vocal style, which was similar to that of Captain Beefheart and Howlin' Wolf. The Broughtons entered into an attempt to capture their live sound on record by organising a performance at Abbey Road on 9 December 1969. Only one track was released at the time: a rendition of &quot;Out, Demons Out!&quot;, an adaptation of The Fugs' song &quot;Exorcising the Demons Out Of the Pentagon&quot;, which had become the band's set-closer and anthem. The rest of the recording was lost until its rediscovery and release in a remixed form in 2004 as Keep Them Freaks a Rollin': Live at Abbey Road 1969.\n\nThe band's touring attracted some controversy from their series of free concerts at locations such as children's playgrounds, and from a number of cases of civil disorder occurring at their shows. The most notorious incidents were a show in Redcar at which a fight broke out between audience members and led to violent police intervention, and a show in Keele where the audience vandalized the venue using paint given to them by the band. Though the band denied doing anything to incite any of these incidents (in the case of Keele, Edgar Broughton admitted to giving paint to the audience but argued that &quot;we didn't tell them to do anything with it&quot;), several towns banned the group's concerts.\n\nThe Edgar Broughton Band kept recording, releasing the live performance of &quot;Out Demons, Out!&quot; as a single (b/w &quot;Momma's Reward (Keep Those Freaks a Rollin')&quot;) and following it, in June 1970, with the album Sing Brother Sing. This was accompanied by the single &quot;Up Yours!&quot; (b/w &quot;Officer Dan&quot;), a polemic on the 1970 General Election declaring their intention to drop out. The song featured a string arrangement by David Bedford.\n\nTheir next single, &quot;Apache Dropout&quot;, combined The Shadows' &quot;Apache&quot; with Captain Beefheart's &quot;Drop Out Boogie&quot;. It was played (to astonished and puzzled reactions) on the David Jacobs' hosted BBC Television's Juke Box Jury. Jerry Lordan, the composer of &quot;Apache&quot;, insisted that the title be &quot;Apache Dropout&quot; instead of the original &quot;Dropout Apache&quot;. The single reached No. 33 on the UK Singles Chart, stalling partly due to the then-current postal strike.[citation needed]\n\nIn 1971, the band decided that existence as a power trio was limiting, and asked Victor Unitt, who had been playing meanwhile in The Pretty Things, to rejoin the band. In May, with the new lineup, they released their eponymous third album, which contained &quot;Evening Over Rooftops&quot; (again with strings by David Bedford). Edgar Broughton Band contained heavy blues and even country influences.\n\nThe album was followed by the release of the double A-side &quot;Hotel Room&quot;/&quot;Call Me A Liar&quot;. This was played by Tony Blackburn as his 'record of the week' upon its release: Edgar Broughton recalled him saying that &quot;he hated everything that we stood for, but that the single was the best thing he had heard that year&quot;.[citation needed] The single failed to chart, but the album sold well throughout Europe, especially in Germany.\n\nWith the success of their third album, the Edgar Broughton Band relocated to Devon to begin recording for their next album, Inside Out, after which Unitt departed.\n\nIn 1975 the band signed to NEMS. In the same year, John Thomas joined the band on guitar for the Broughtons' sixth album, Bandages. This featured a softer sound than previous releases. Shortly after the release of Bandages, John Thomas left and was replaced by Terry Cottam. In 1976, having recorded the live album Live Hits Harder (which was not released until 1979), the Edgar Broughton Band dissolved.\n\nHowever, Edgar and Steve Broughton together with Grant regrouped as The Broughtons to release Parlez-Vous English? in 1979, with Tom Nordon and Pete Tolsen playing guitar and Richard de Bastion on keyboards. This was the Band's first adventure into a fuller, more orchestral style of heavy rock. Pete Tolsen was not retained after the release of the album and was replaced by John Thomas for the two years of European touring that followed. Tom Norden appears again, along with keyboardist Dennis Haines, on Superchip, released in 1982.\n\nAfter this the band returned to a hiatus, recording no more studio material but touring infrequently throughout the 1980s and 1990s. A mini-tour in 1989 included a gig at The Oval in London. Following another lengthy hiatus with occasional gigs, the band returned to live action in 2006 after the re-issue of their back catalogue had stimulated new interest in their work. They had a mini tour of England and Germany then completed a European tour in 2007, including an appearance at the German Burg Herzberg Festival.\n\nThe Edgar Broughton Band disbanded in 2010, with Edgar Broughton opting to continue to perform as a solo artist.\n\n--------------------------------------------------------------------------------\n\nWasa Wasa is the debut album by the psychedelic rock band Edgar Broughton Band. The album was originally released as &quot;Harvest SHVL 757&quot; in July 1969 and was produced by Peter Jenner. The 2004 CD reissue contained 5 previously unreleased bonus tracks, 4 of them being demos recorded by the band when they were a blues outfit called &quot;The Edgar Broughton Blues Band&quot;. These tracks feature guitarist Victor Unitt, who left the band when they started to go into psychedelic rock, stating the members of the band to be &quot;sell-outs&quot;. The last bonus track being a jamming session which was recorded on 21 January 1969, which was discovered when remastering the album.\n\n--------------------------------------------------------------------------------\n\nSing Brother Sing is the second album by psychedelic rock band, Edgar Broughton Band. It was originally released as &quot;Harvest SHVL 772&quot; in June 1970. The 2004 CD reissue contains 8 bonus tracks.\n\n--------------------------------------------------------------------------------\n\nEdgar Broughton Band was the self-titled third album of the Edgar Broughton Band. The album is known amongst fans as &quot;The Meat Album&quot;, as the album cover features lots of meat on hangers in a warehouse; a human can also be seen hanging amongst the meat. The 2004 CD reissue features 3 bonus tracks.\n\n--------------------------------------------------------------------------------\n\nInside Out was the fourth album by psychedelic rock group, Edgar Broughton Band. The album was originally released as &quot;Harvest SHTC 252&quot; in July 1972. The 2004 CD reissue features 3 bonus tracks.\n\n--------------------------------------------------------------------------------\n\nOora is the fifth album by psychedelic rock group, The Edgar Broughton Band. It was originally released as &quot;Harvest SHVL 810&quot; in May 1973, it was also the last album to be released on Harvest Records. The 2004 CD reissue features 1 bonus track.\n\n--------------------------------------------------------------------------------\n\nBand:\n\nEdgar Broughton (born Robert Edgar Broughton, (1947-10-24) October 24, 1947 (age 66), Warwick, Warwickshire).\n\nSteve Broughton (born Stephen Alex Broughton, (1950-05-20) May 20, 1950 (age 64), Warwick).\n\nArthur Grant (born Arthur James Grant, (1950-05-14) May 14, 1950 (age 64), Leamington Spa, Warwickshire).\n\nLuke Broughton (born Luke Alex Broughton, (1980-01-16) January 16, 1980 (age 34), London)","torrent":{"xt":"urn:btih:9af1b2cbd5d2c5c911d175407eb9524131113e8c","amp;dn":"Edgar+Broughton+Band-Original+Album+Series%5B5CD%5D%5B2014%5D%5B320KBPS%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9af1b2cbd5d2c5c911d175407eb9524131113e8c","infoHashBuffer":{"type":"Buffer","data":[154,241,178,203,213,210,197,201,17,209,117,64,126,185,82,65,49,17,62,140]},"announce":[],"urlList":[]}}