{"title":"My Best Friend Is a Vampire (1987) DVDrip","uid":5783743,"size":782702592,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:9b34b46e2ae077eca90535e08b2187557640fa2e&amp;dn=My+Best+Friend+Is+a+Vampire+%281987%29+DVDrip&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Horrorspoke","files":-1,"time":1282518048,"description":"PLOT:\n\nHigh schooler Jeremy Capella [Robert Sean Leonard] makes a delivery to the Gardner Mansion and comes away vampire. He thinks the guys chasing him in the white van are from the husband of the lady he bedded at the mansion. When the mansion is burnt down, Jeremy thinks the other guy following him is a detective. When the detective shows up in Jeremy's bedroom one night, Jeremy learns he is Modoc [Rene Auberjonois], a vampire. Modoc informs Jeremy that the strange things that have been happening to him the last few days are due to his changing into a vampire. Modoc also tells him that the guys in the white van are vampire hunters and they want to kill him. Actually they want Jeremy's friend Ralph [Evan Mirand] because they think Ralph is the vampire. They almost succeed, but Jeremy saves Ralph from the stake, Modoc's friends make an ally of Professor Leopold McCarthy [David Warner], and Jeremy gets a girlfriend, Darla Blake [Cheryl Pollack]. \n\nREVIEW:\n\nI couldn't believe the rating this movie got here so I had to write, this was a movie that opitimised every aspect of the eighties (including really bad dress sense)from the troubled/angst teenager, to the mad thinks he's doing-good scientist and put it all togother in a fun relaxing and romantic teenage movie(no shlock horror typical of the era). I honestly think that anyone sits down and watches this movie for what it was and is &quot;a rom/com&quot; they will enjoy, even now when it looks a bit dated.......Honestly go rent buy scrape this movie up or out of the cupboard and put your feet up grab some popcorn or beer or possibly pigs bloods (sorry couldn't help a reference to the movie) and enjoy................. \n\nSCREENS:\n\n\nSEED AND ENJOY ALL!!! (AND PLEASE BE PATIENT, MY UPLOAD SPEED IS CAPPED!!!\n\nTHANKS!","torrent":{"xt":"urn:btih:9b34b46e2ae077eca90535e08b2187557640fa2e","amp;dn":"My+Best+Friend+Is+a+Vampire+%281987%29+DVDrip","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9b34b46e2ae077eca90535e08b2187557640fa2e","infoHashBuffer":{"type":"Buffer","data":[155,52,180,110,42,224,119,236,169,5,53,224,139,33,135,85,118,64,250,46]},"announce":[],"urlList":[]}}