{"title":"Rahul Dravid: Timeless Steel by ESPN Cricinfo","uid":11680960,"size":3759567,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9f9fec5dd8228a41b0039453de49e90816a2382e&amp;dn=Rahul+Dravid%3A+Timeless+Steel+by+ESPN+Cricinfo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ZamKhan","files":1,"time":1423086529,"description":"Rahul Dravid was probably one of the last classical Test match batsmen. The lynchpin of India's Test match side through the 2000s, he combined technical virtuosity with a legendary work ethic and near-yogic powers of concentration, and epitomised an old-school guts-before-glory approach in an age increasingly defined by flashy strokeplay and low attention spans.\n\nA collection of 30 pieces new and previously published on ESPNcricinfo and its sister publications this book features contributions from Dravid s team-mates and peers, some of the finest cricket writers around, and interviews over the years with Dravid himself. It attempts to paint a picture of a cricketer who embodied the best traditions and values of the game, and a man who impressed the many people who came in contact with him. Greg Chappell remembers the India captain he worked alongside. Ed Smith, who shared a dressing room with Dravid at Kent, writes of a thorough gentleman. Sanjay Bangar relives the splendour of Headingley 2002. Jarrod Kimber tells of how Dravid became the reason for him getting married. Mukul Kesavan analyses how his technique allows for more style than one might assume. Sidharth Monga puts Dravid s captaincy under the spotlight. Rohit Brijnath looks back at the twin peaks of Adelaide 2003. Vijeeta Dravid gives us a look at her husband the perfectionist. Those and other articles make Timeless Steel as much a celebration of a colossal cricketer as of an exceptional human being","torrent":{"xt":"urn:btih:9f9fec5dd8228a41b0039453de49e90816a2382e","amp;dn":"Rahul+Dravid%3A+Timeless+Steel+by+ESPN+Cricinfo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9f9fec5dd8228a41b0039453de49e90816a2382e","infoHashBuffer":{"type":"Buffer","data":[159,159,236,93,216,34,138,65,176,3,148,83,222,73,233,8,22,162,56,46]},"announce":[],"urlList":[]}}