{"title":"Tom Campbell - The Planner (retail).epub","uid":10729663,"size":495443,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9fd162abbb55de1d1e78b63141d2fe9947e057af&amp;dn=Tom+Campbell+-+The+Planner+%28retail%29.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"gratefuldawg77","files":1,"time":1407612066,"description":"James is exactly what you'd expect from one of London's most promising, young town planners. He's cautious, respected by colleagues and performs well in team meetings. But while James understands the glitter and grime of the city better than almost anyone, he hasn't actually experienced much of it. And, as he watches his university friends blossom bewilderingly into rich and successful adults, he has the nagging sense that he has somehow fallen by the wayside.\n\nThat is, until he meets Felix, who navigates the glamorous and cynical capital with sophisticated ease. Felix introduces James to a London that he has never known, and which doesn't feature in the planning manuals: a world of private clubs and executive football boxes; of book launches, contemporary art galleries, suburban drug dealers and dates with women even more exotic than the peculiar vodka shots they drink.\n\nBut London is an expensive city in many ways, and the world Felix has opened up comes at a cost. James may know how to design housing estates and high streets, but is it really possible to redraw the masterplan for his own life? And what will he lose along the way?","torrent":{"xt":"urn:btih:9fd162abbb55de1d1e78b63141d2fe9947e057af","amp;dn":"Tom+Campbell+-+The+Planner+%28retail%29.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9fd162abbb55de1d1e78b63141d2fe9947e057af","infoHashBuffer":{"type":"Buffer","data":[159,209,98,171,187,85,222,29,30,120,182,49,65,210,254,153,71,224,87,175]},"announce":[],"urlList":[]}}