{"title":"Richard Dawkins: Growing Up in the Universe Part 1, 2, 3, 4, &amp; 5","uid":3899076,"size":549315787,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:a279a7efc48512ff990ec8c5a7e1302c444f952a&amp;dn=Richard+Dawkins%3A+Growing+Up+in+the+Universe+Part+1%2C+2%2C+3%2C+4%2C+%26+5&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"FuckYourReligion","files":5,"time":1195464438,"description":"Trouble with this torrent? You can also obtain this from the dedicated Richard Dawkins torrent server maintained by ResponsiveWeb LLC (www.responsiveweb.com) at http://216.128.88.40:6969/\n\n========================\n\nThis Growing Up In the Universe.torrent contains all 5 parts of the &quot;Growing Up In the Universe&quot; series by Richard Dawkins. If you wish to download these 1 part at a time, feel free to use the individual torrent links:\n\nPart 1: Waking Up in the Universe  &lt;a href=&quot;\nhttp://thepiratebay.se/tor/3898977/Growing_Up_in_the_Universe__Part_1__Waking_Up_in_the_Universe&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/tor/3898977/Growing_Up_in_the_Universe__Part_1__Waking_Up_in_the_Universe&lt;/a&gt;\n\nPart 2: Designed and Designoid Objects  &lt;a href=&quot;\nhttp://thepiratebay.se/tor/3898988/Growing_Up_in_the_Universe__Part_2__Designed_and_Designoid_Objec&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/tor/3898988/Growing_Up_in_the_Universe__Part_2__Designed_and_Designoid_Objec&lt;/a&gt;\n\nPart 3: Climbing Mount Improbable  &lt;a href=&quot;\nhttp://thepiratebay.se/tor/3898997/Growing_Up_in_the_Universe__Part_3__Climbing_Mount_Improbable&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/tor/3898997/Growing_Up_in_the_Universe__Part_3__Climbing_Mount_Improbable&lt;/a&gt;\n\nPart 4: The Ultraviolet Garden  &lt;a href=&quot;\nhttp://thepiratebay.se/tor/3899001/Growing_Up_in_the_Universe__Part_4__The_Ultraviolet_Garden&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/tor/3899001/Growing_Up_in_the_Universe__Part_4__The_Ultraviolet_Garden&lt;/a&gt;\n\nPart 5: The Genesis of Purpose  &lt;a href=&quot;\nhttp://thepiratebay.se/tor/3899004/Growing_Up_in_the_Universe__Part_5__The_Genesis_of_Purpose_&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/tor/3899004/Growing_Up_in_the_Universe__Part_5__The_Genesis_of_Purpose_&lt;/a&gt;\n\n\n========================\n\n\nGrowing Up in the Universe\n\nGrowing Up in the Universe is a series of lectures given by Richard Dawkins as part of the Royal Institution Christmas Lectures, where he discusses the evolution of life in the universe.\n\nThe lectures were first broadcast in 1991, in the form of five one-hour episodes, on the BBC in the UK. The Richard Dawkins Foundation for Reason and Science was granted the rights to the televised lectures, and a DVD version was released by the foundation on April 20, 2007.\n\nContents: [in Quicktime .MOV format]\nPart 1: Waking Up in the Universe \nPart 2: Designed and Designoid Objects \nPart 3: Climbing Mount Improbable \nPart 4: The Ultraviolet Garden \nPart 5: The Genesis of Purpose \n\nPart 1: Waking Up in the Universe\n\nTo start off part one, Dawkins discusses the amazing capabilities of the human body and contrasts these with the limited capabilities of computers and other man-made machines. He uses a small totem pole (which is used in ancestor worship) to illustrate the importance of studying our ancestors in order to understand how we&amp;#039;ve evolved. To contrast ease of reproduction with the difficulty of becoming an ancestor, Dawkins uses the example of paper folding to explain exponential growth. Dawkins then tells the audience that exponential growth does not generally happen in the real world - natural factors come into play which control the population numbers, meaning that only an elite group of organisms will actually become distant ancestors. In order to be in this elite group, the organism must &quot;have what it takes&quot; to survive and pass on their genes to offspring.\n\nThe long chain of successful ancestors means that the probability of our existence is very small, and we are lucky to be alive. By turning down the lights and shining a small spotlight on a large ruler in front of him, Dawkins illustrates the darkness of the distant past and of the unknown future.\n\nAfter expounding on how lucky we are to be alive, and urging us not to waste the precious time that we have, Dawkins brings up the usefulness of science in aiding our understanding of the universe. He mentions the reply that Michael Faraday gave to Sir Robert Peel when asked about the use of science. Faraday&amp;#039;s response was &quot;What is the use of a baby?&quot; Dawkins explains that Faraday was either referring to the vast potential of a baby, or to the idea that there must be something more to life than growing up, working, getting old, and dying. There must be a point to it all; Perhaps science can uncover the answers to our biggest questions.\n\nIn order to shake off the &quot;anesthetic of familiarity,&quot; Dawkins shows the audience a number of strange terrestrial organisms which he nicknames &quot;Bi-Jovians,&quot; based on what we might call living organisms from Jupiter. He uses a scanning electron microscope to look at small organisms including mites, mosquitoes, and a bee being parasitized by a strepsiptera. Using a model of a eukaryotic cell, he discusses the mitochondria and presents the audience with a complicated diagram of the metabolic pathways.\n\nDawkins suggests that we can also shake off the familiarity by stepping backwards in time. By using a single pace to represent going back 1000 years, he starts at year zero and takes four steps in front of his desk, going back to 4000 B.C.E. Pointing to a portrait of Homo habilis, he states that in order to go back to the time of habilis, he would have to walk about two kilometers. He has audience members hold up portraits of other human ancestors, telling them how far he would have to walk in order to get back to the time of each one.\n\nBy imagining what an advanced alien species would think of humans if they were to arrive on Earth, Dawkins suggests that their science would be similar to ours. They would know about pi, the Pythagorean theorem, and the theory of relativity. However, Dawkins explains that the alien anthropologists would most likely scoff at our local, parochial religious beliefs. He then contrasts evidence-based beliefs with revealed, tradition-based, and authority-based beliefs.\n\nIn order to explain the problem with beliefs in the supernatural, Dawkins conducts a small experiment with the audience in order to &quot;find the psychic.&quot; Using a coin, he assigns half the audience to will it to land on heads, and assigns the other half to will it to land on tails. After each flip, the section of the audience that was wrong is eliminated from the experiment, and he repeats the experiment using the remainder. After eight coin flips, only one boy in the audience remains. Dawkins then asks the question &quot;Is he psychic?&quot; Obviously, because of how the experiment was set up, one person was bound to have been correct about the result of each coin flip. Dawkins argues that this is exactly how seemingly supernatural events occur in the real world, especially when the &quot;audience&quot; is the entire population of the planet.\n\nTo conclude the lecture, Dawkins claims that there is nothing wrong with having faith in a proper scientific prediction. To illustrate this, he takes a cannonball which has been suspended from the ceiling with a rope, moves against the wall, and touches the cannonball to his forehead. He announces that he is going to release the cannonball, and that when it comes back to him, he is going to ignore his natural instinct to run because he has faith in his scientific prediction of what will happen - the cannonball should stop about an inch short of his forehead. He releases the cannonball, and his prediction is proved correct.\n\n\n\nPart 2: Designed and Designoid Objects \n\nDawkins&amp;#039; second lecture of the series examines the problem of design. He presents the audience with a number of simple objects, such as rocks and crystals, and notes that these objects have been formed by simple laws of physics and are therefore not designed. He then examines some designed objects - including a microscope, an electronic calculator, a pocket watch, and a clay pot - and notes that none of these objects could have possibly come about by sheer luck. Dawkins then discusses what he calls &quot;designoid objects&quot;, which are complex objects that are neither simple, nor designed. Not only are they complex on the outside, they are also complex on the inside - perhaps billions of times more complex than a designed object such as a microscope.\n\nDawkins then shows the audience a number of designed and designoid objects, including the pitcher plant, megalithic mounds built by the compass termite, and pots made by trapdoor spiders, potter wasps, and mason bees. He examines some designoid objects that use camouflage, such as a grasshopper that looks like a stone, a sea horse that looks like sea weed, a leaf insect, a green snake, a stick insect, and a collection of butterflies that look like dead leaves when their wings are closed. Dawkins notes that many animals share similar types of camouflage or protection because of a process called convergent evolution. Examples of such designoid objects include the hedgehog and the spiny anteater (both of which evolved pointed spines along their back) and the marsupial wolf (which looks like a dog but is actually a marsupial). He illustrates the reason why convergent evolution occurs by using two small models of commercial aircraft. The reason they look similar isn&amp;#039;t due to industrial espionage, it is due to the fact that they are both built in order to fly, so they must make use of similar design principles.\n\nUsing a camera and a model eye, Dawkins then compares the designed camera with the designoid eye. Both are involved in similar processes - using a lens to direct light onto a film or a retina. Both the camera and the eye also have an iris, which is used to control the amount of light which is allowed in. Using a volunteer from the audience, Dawkins demonstrates the contraction of the human iris by shining a light into her right eye.\n\nThe lecture then moves into an explanation of natural selection, which brings forth designoid objects. In order to explain natural selection, Dawkins first explains artificial selection by discussing the evolution of wild cabbage into broccoli, cauliflower, cabbage, red cabbage, kohlrabi, and Brussel sprouts. He continues the discussion of artificial selection by explaining the evolution of the ancestral wolf into the many varieties of modern dog. Starting with the ancestral wolf, Dawkins imagines that everyone on one side of the room is breeding for small wolves, while everyone on the other side is breeding for big wolves. By selectively breeding the smallest or largest of each litter for a number of years, you may eventually end up with something like the Chihuahua on one side of the room, and something like a Great Dane on the other side of the room.\n\nDawkins then introduces an Arthromorphs computer program (similar to the Biomorphs program[1]), explaining how it works while a volunteer uses the computer to selectively breed more and more generations.\n\nAt this point, Dawkins switches from explaining artificial selection to explaining natural selection. In order to demonstrate natural selection in a computer program, Dawkins uses a program written by Peter Fuchs to simulate the evolution of the spiderweb. The program builds &quot;genetic&quot; variations of a parent web, as if the web was actually being built by a child spider. For each generation, a simulation is run which randomly generates flies - some of which will hit the web, and others that will miss it. The child web that is able to capture the highest number of flies is selected as the parent for the next generation of webs. Dawkins shows the audience the &quot;fossil record&quot; that the program recorded after simulating a large number of generations overnight. The web starts off very simple and inefficient, but by the end it has evolved into a web that is highly efficient and highly complex. This is the same process that has led to the existence of all designoid objects.\n\nDawkins now discusses the most popular alternative to natural selection, which is known as creationism. He explains that creationists mistakenly believe designoid objects to be designed objects created by a divine being. Quoting from William Paley&amp;#039;s Natural Theology, Dawkins discusses the argument from design using the example of the watch and the watchmaker. Even though designoid objects appear to be designed, Darwin proved that this is not the case. Although Darwin&amp;#039;s theory was discovered well after Paley developed his watchmaker argument, Dawkins explains that the argument of a divine watchmaker was still a bad argument, even in Paley&amp;#039;s day. Paraphrasing David Hume, Dawkins explains that anything capable of creating humans must itself be highly complicated. Thus, the argument from design actually explains nothing - &quot;shooting itself in the foot.&quot; While it is true that designoid objects cannot come about by chance, evolution provides a non-random method of creation - namely, natural selection.\n\nAfter developing the argument against a divine creator, Dawkins examines a number of designoid objects that contain imperfections, which is something you would not expect to find in an object that is supposedly created by a divine being. Showing the audience a halibut flatfish, he explains how they evolved from an upright swimming ancestor with one eye on each side of the head into a bottom-hugging flatfish with a distorted set of eyes on one side of the body. Dawkins claims that this is poorly designed, as any proper engineer would design an organism more like a skate, which flattened out on its belly instead of on its side. This is an example of something you would expect from an evolved/designoid object, but not something you would expect from a created/designed object.\n\nUsing labeled building blocks, Dawkins shows the audience how designed objects came to be. He starts off by placing the simple block on the bottom, and explaining that you don&amp;#039;t have to start with a complex being, but can start with a very simple foundation. If you have a simple foundation, you can place the next block on top - the designoid block. From this block, you can get complex organisms. Only after complex designoid objects come to be can you get the final building block of design (microscopes, clay pots, etc).\n\n\n\nPart 3: Climbing Mount Improbable \n\nPart 4: The Ultraviolet Garden \n\nPart 5: The Genesis of Purpose \n\n? Life makes the wonders of technology seem commonplace. So where does life come from? What is it? Why are we here? What are we for? What is the meaning of life? There&amp;#039;s a conventional wisdom which says that science has nothing to say about such questions. Well, all I can say is that if science has nothing to say, it&amp;#039;s certain that no other discipline can say anything at all. But in fact, science has a great deal to say about such questions. And that&amp;#039;s what these five lectures are going to be about. Life &quot;grows up&quot; in the universe by gradual degrees - evolution - and we grow up in our understanding of our origins and our meaning. ? \n? The present century is a tiny spotlight, inching its way along a gigantic ruler of time. Everything before the spotlight is the darkness of the dead past. Everything after the spotlight is in the darkness of the unknown future. We live in the spotlight. Of all the 200,000,000 centuries along the ruler of time, 199,999,999 centuries are in darkness. Only one is lit up, and that is the one in which we happen - by sheer luck - to be alive. The odds against our century happening to be the present century are the same as the odds against a penny tossed out at random on the road from London to Istanbul happening to fall on a particular ant. ? \n? We do of course, have an ordinary life to get on with. We do have a living to earn. We&amp;#039;ve got to earn our living being a solicitor or a lavatory cleaner or something like that. But nevertheless, it is worthwhile also from time to time shaking off the anesthetic of familiarity and awakening to the wonder that is really all around us all the time. ? \n? Natural selection - nature - is constantly choosing which individual shall live, [and] which individual shall breed. And the result, after many generations of natural selection, is much the same as the result after many generations of artificial selection. ? \n? In any case, all creation, all design, all machines and houses and paintings and computers and airplanes, everything designed and made by us, everything made by other creatures, is only made possible because there are already brains put together as designoid objects - and designoid objects come about only through gradual evolution. Creation, when it does occur in the universe, is an afterthought. When creation appeared on this planet it came locally, and it came late. Creation does not belong in any account of the fundamentals of the universe. Creation is something that, rather late in the day, grows up in the universe. ? \n\n\n========================\n\n\nThank you for downloading. Please seed in the name of education.\n\nCheers,\n\nThe Good Folks at ResponsiveWeb\nwww.responsiveweb.com\n1(888)RW2-HOST\t","torrent":{"xt":"urn:btih:a279a7efc48512ff990ec8c5a7e1302c444f952a","amp;dn":"Richard+Dawkins%3A+Growing+Up+in+the+Universe+Part+1%2C+2%2C+3%2C+4%2C+%26+5","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a279a7efc48512ff990ec8c5a7e1302c444f952a","infoHashBuffer":{"type":"Buffer","data":[162,121,167,239,196,133,18,255,153,14,200,197,167,225,48,44,68,79,149,42]},"announce":[],"urlList":[]}}