{"title":"Augustus Pablo - King Tubbys Meets Rockers Uptown (FLAC)","uid":4917444,"size":517626512,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:a287ae028b3fc4e4046faa1e003984cb2788bd6b&amp;dn=Augustus+Pablo+-+King+Tubbys+Meets+Rockers+Uptown+%28FLAC%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"tbelgar","files":-1,"time":1243498246,"description":"For everyone who's been waiting for it. Seed and enjoy.\n\n\n\n\nIf you had to pick one album that best represents the pinnacle of the art of dub, you'd cull the candidates down pretty quickly to ten or 12, and it would get very difficult after that. Few would fault you for ending up with this one, though, which stands as perhaps the finest collaboration between two of instrumental reggae's leading lights: producer and melodica player Augustus Pablo and legendary dub pioneer King Tubby. Among other gems, this album offers its title track -- a dub version of Jacob Miller's &quot;Baby I Love You So&quot; -- which is widely regarded as the finest example of dub ever recorded. But the rest of the album is hardly less impressive. &quot;Each One Dub,&quot; another cut on a Jacob Miller rhythm, possesses the same dark and mystical ambience, if not quite the same emotional energy, as &quot;King Tubby Meets Rockers Uptown,&quot; and the version of the epochal &quot;Satta Massaganna&quot; that closes the album is another solid winner. Pablo's trademark &quot;Far East&quot; sound (characterized by minor keys and prominent melodica lines) is predominant throughout, and is treated with care and grace by King Tubby, who has rarely sounded more inspired in his studio manipulations than he does here. Absolutely essential. --  Rick Anderson   5 of 5 stars\n\n\n","torrent":{"xt":"urn:btih:a287ae028b3fc4e4046faa1e003984cb2788bd6b","amp;dn":"Augustus+Pablo+-+King+Tubbys+Meets+Rockers+Uptown+%28FLAC%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a287ae028b3fc4e4046faa1e003984cb2788bd6b","infoHashBuffer":{"type":"Buffer","data":[162,135,174,2,139,63,196,228,4,111,170,30,0,57,132,203,39,136,189,107]},"announce":[],"urlList":[]}}