{"title":"Wall Street Raider 5.0","uid":4828615,"size":2194957,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:a3087468ccb9f5dd8318bf2cc43ba0ff73e69ac2&amp;dn=Wall+Street+Raider+5.0&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bobo66","files":1,"time":1239044657,"description":"NEWS FLASH! Version 5.0 of W$R is now available, now including executive stock options if you are a company CEO, 5-year stock charts for each company, plus short-selling and put and call options trading! For update information and a description of new features in 5.0, click here.\n\n\n\nWALL STREET RAIDER (for Windows) is the ultimate in sophisticated financial simulations, a corporate takeover and stock market game and simulation, in which you strive to build your corporate empire by fair means or foul, all the while trying to stay one step ahead of the SEC, IRS, Justice Department, EPA, Congress, powerful unions and no end of ruthless competitors -- not to mention various manmade and natural economic and other disasters.\n\nIn this highly realistic simulation, 1 to 5 players (including the computer) compete to amass fortunes, investing in, or taking over and managing, any of up to 1590 companies in 70 industry groups.  Once in control of a company, you'll use all the tricks of the trade of real Wall Street corporate raiders to expand your empire and net worth:\n\n        * startups/IPOs\n        * tender offers\n        * greenmail\n        * stock-for-stock mergers\n        * LBO's\n        * &quot;white knight defenses&quot;\n        * antitrust suits and other litigation\n        * restucturings\n        * excessive CEO salaries and lavish stock options\n        * firing management\n        * asset restructuring\n        * mass layoffs\n        * tax avoidance\n        * asset-stripping liquidations\n        * industry domination \n\n... and much more, in the quest for the Almighty Dollar. The individual player can also engage in risky (but sometimes lucrative) activities for his or her own account, such as short selling of stocks, or buying and shorting put and call options.\n\nAnd, of course, you'll have ample &quot;ethical choices&quot; thrust upon you from time to time, where you will have to choose between playing it straight or making a quick killing and (possibly) winding up in serious legal or financial trouble if you decide to &quot;go for the gold,&quot; rather than &quot;do the right thing.&quot;\n\nAll your investment research and financial wheeling and dealing occur against the backdrop of a nonstop &quot;live&quot; stock ticker tape, scrolling financial news tape, and a constantly shifting economic and political environment in which all the companies and industries in Wall Street Raider must operate and try to cope. Speedy decision-making is of the essence, and sweaty palms are a certainty, as you try to cope and keep your company's earnings on an upward track -- or at least keep yourself out of Bankruptcy Court!","torrent":{"xt":"urn:btih:a3087468ccb9f5dd8318bf2cc43ba0ff73e69ac2","amp;dn":"Wall+Street+Raider+5.0","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a3087468ccb9f5dd8318bf2cc43ba0ff73e69ac2","infoHashBuffer":{"type":"Buffer","data":[163,8,116,104,204,185,245,221,131,24,191,44,196,59,160,255,115,230,154,194]},"announce":[],"urlList":[]}}