{"title":"FSX H36 Dimona.rar","uid":6544832,"size":186661460,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:a338b0f8e4ac4df9b068210c5d752dc9dc126e0e&amp;dn=FSX+H36+Dimona.rar&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mickyfinny","files":1,"time":1310813096,"description":"\nThe Hoffmann H36 Dimona is not your regular small aircraft. It`s in the rather exclusive class of touring motor gliders; aircraft that are a cross between motor aircraft and gliders. They got the long wings of a glider but a standard (though often rather small) aircraft engine. You can either use them as a normal aircraft or switch off the engine and glide for a while.\n\nTruth be told, most of them are not brilliant in either capacity but all of them have special characteristics. You will need a few hours to get fully acquainted with the Dimona. But after those hours you will have found a new friend. Because it might not be the best motor aircraft and certainly not the most efficient glider, but it most certainly has character. You will love it quirks and peculiarities as it is truly entertaining to fly.\n\nThere has never been a high quality motor glider for MS Flight Simulation. And this one is certainly high end. At the base of the product is one of the most detailed flight/engine models ever done for FSX. Accurate down to the altitude you lose in a spin. The aircraft is meticulously modeled and has superb non-standard animations. Though there are not that many systems, those that are included are programmed with great depth. The C4 Flight Computer alone needs dozens of pages in the manuals! Where FSX poses limitations the developers simply did not use the FSX options and programmed their own system. The H36 Dimona is a high end simulation of a special aircraft. \n\nHave fun :+)","torrent":{"xt":"urn:btih:a338b0f8e4ac4df9b068210c5d752dc9dc126e0e","amp;dn":"FSX+H36+Dimona.rar","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a338b0f8e4ac4df9b068210c5d752dc9dc126e0e","infoHashBuffer":{"type":"Buffer","data":[163,56,176,248,228,172,77,249,176,104,33,12,93,117,45,201,220,18,110,14]},"announce":[],"urlList":[]}}