{"title":"R-Drive Image v4.7 Build 4708  + Reg Key -TrT","uid":5585092,"size":10763987,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:a33b1d215a0f8649c5517360b02c10309a7bd818&amp;dn=R-Drive+Image+v4.7+Build+4708++%2B+Reg+Key+-TrT&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bigwimpie","files":-1,"time":1274676212,"description":"R-Drive Image v4.7 Build 4708\nFulle version with Reg. Key\n\n\nR-Drive Image is a potent utility providing disk image files creation for backup or \nduplication purposes. A disk image file contains the exact, byte-by-byte copy of a hard drive, \npartition or logical disk and can be created with various compression levels on the fly without \nstopping Windows OS and therefore without interrupting your business. \nThese drive image files can then be stored in a variety of places, including various \nremovable media such as CD-R(W)/DVD, Iomega Zip or Jazz disks, etc. R-Drive Image restores \nthe images on the original disks, on any other partitions or even on a hard drive's free \nspace on the fly. To restore system and other locked partitions R-Drive Image is switched \nto the pseudo-graphic mode directly from Windows or bootable version created by the utility \nis launched from CD disc or diskettes. R-Drive Image is one of the best backup and disaster \nrecovery solutions to prevent losing your data after a fatal system failure.\n\nUsing R-Drive Image, you can completely and rapidly restore your system after heavy data loss \ncaused by an operating system crash, virus attack or hardware failure. You can also use R-Drive \nImage for mass system deployment when you need to setup many identical computers. In other words, \nyou can manually setup one system only, create an image of the system, and then deploy it \non all other computers, saving your time and costs. If you need to restore only certain files \nfrom a disk image, you can connect that image as a virtual disk and copy those files directly \nfrom the disk image using Windows Explorer or any other file utility.\n\nR-Drive Image features:\n\n* A simple wizard interface - no in-depth computer management skills are required.\n* On-the-fly actions: Image files are created on-the-fly, no need to stop and restart Windows. \nAll other disk writes are stored in a cache until the image is created. Data from image files \nare restored on-the-fly as well, except on a system partition. Data to the system partition \ncan be restored either by restarting R-Drive Image in its pseudo-graphic mode directly \nfrom Windows, or by using specially created startup disks.\n* Image files compression. Image files can be compressed to save free storage space.\n\nInstall Notes:\n\n1) Unpack rar archive\n2) Run installer rdi_en_4.exe\n3) Enter Serial when asked (for serial see serial.txt)\n\n","torrent":{"xt":"urn:btih:a33b1d215a0f8649c5517360b02c10309a7bd818","amp;dn":"R-Drive+Image+v4.7+Build+4708++%2B+Reg+Key+-TrT","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a33b1d215a0f8649c5517360b02c10309a7bd818","infoHashBuffer":{"type":"Buffer","data":[163,59,29,33,90,15,134,73,197,81,115,96,176,44,16,48,154,123,216,24]},"announce":[],"urlList":[]}}