{"title":"Savannah Vampire series - Raven Hart (5 books)","uid":10527943,"size":2675311,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a377e64632b34912bc69fb006abbee3baf2bb432&amp;dn=Savannah+Vampire+series+-+Raven+Hart+%285+books%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ONLYMOBI","files":-1,"time":1405072440,"description":"1. The Vampire Seduction: When it comes to a wild and seductive nightlife, Savannah has bite. Older than the United States and wealthy beyond his years, playboy William Cuyler Thorne is a vampire with a nice long undead lifebs one that includes a steady stream of admirers, a consistent supply of rejuvenating blood, and, best of all, a cover as one of Savannah's s most prominent pillars of society. But all good things must end. Now an ancient enemy has come for William from across the seas. It is his sire, Reedrek, the vampire who created him. And Reedrek will stop at nothing until all that is precious to William's his beautiful mistress, his stable of willing female victims, his glorious estates, and his good-ol-boy vampire sidekick, Jack is within his voracious grasp. But William has an arsenal of his own one that is enhanced by the power of voodoo. And when these two bloodsuckers meet, there will be hell to pay.\n\n2. The Vampire's Secret: Once a mortal with a beloved family, William Cuyler Thorne is now a vampire on the prowl for blood and beautiful women. He has the perfect cover as aadmired citizen of Savannah society. Though Reedrek, the ruthless old-world vampire who tried to destroy William has been defeated, he still has his followers and they will settle for nothing less than all-out war.\nTo counter this vicious band of European bloodsuckers, organizes a vampire empire, which includes the handsomely slick Jack; William's newly made eternity mate, the luscious seductress Eleanor; and a wannabe-badass named Werm. But as William and his team prepare for the ultimate showdown, the only hope for victory may lie with one woman, a vampire with unusual powers who holds the vampires fates in her hot little hands. \n\n3. The Vampire's Kiss: The most powerful member of Savannah's vampire community, William Cuyler Thorne, launches a personal quest for vengeance when he discovers that his wife and son, whom he had believed dead, have been transformed into the undead and are members of a malicious clan of European bloodsuckers that have abducted the young daughter of his voodoo priestess friend.\n\n4. The Vampire's Betrayal: In the fourth novel featuring suave, southern aristocrat and vampire William Cuyler Thorne, the centuries-old blood drinker finds his job of protecting the human population of Savannah from real evil challenged by an apocalyptic prophecy destined to resurrect a powerful Mayan goddess fated to destroy all vampires.\n\n5. The Vampire's Revenge: Jack McShane: lover, killer, seducer, family man, and vampire. In the shadows of Savannah, with its hip nightspots and moss-draped oak trees, Jack is trying to save humankind from a threat it doesn't know it faces: an explosion of the otherworldly, the weird, the wanton, and the wicked.\nTourists are heading to Savannah for St. Patrick's Day and Jack is racing through tunnels below the city to the edge of Hell itself to hold off a plot posed by the double-dead and demented. But Jack must also hold off his own desire for Connie Jones, the beautiful cop he turned into a vampire slayer.\nConnie, her blood running hotter than she can handle, can't imagine the games that Jack is playing with her body and her mind, or that the other monster she's falling in love with is all part of his devious plan.\nWelcome to the world of Jack McShane, a blue-eyed vampire who knows how crazy things can get once you get a little taste for blood.","torrent":{"xt":"urn:btih:a377e64632b34912bc69fb006abbee3baf2bb432","amp;dn":"Savannah+Vampire+series+-+Raven+Hart+%285+books%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a377e64632b34912bc69fb006abbee3baf2bb432","infoHashBuffer":{"type":"Buffer","data":[163,119,230,70,50,179,73,18,188,105,251,0,106,187,238,59,175,43,180,50]},"announce":[],"urlList":[]}}