{"title":"Springer Series in Biomaterials Science and Engineering","uid":13064642,"size":76823606,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a3d467d0325f48d2de4e3afe89e9459a3c1faaf4&amp;dn=Springer+Series+in+Biomaterials+Science+and+Engineering&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":5,"time":1450738775,"description":"ISSN 2195-0644\r\nISSN 2195-0652 (electronic)\r\n\r\nSeries Editor\r\nMin Wang\r\nDepartment of Mechanical Engineering, The University of Hong Kong, Hong Kong, China\r\n\r\nThe Springer Series in Biomaterials Science and Engineering addresses the manufacture, structure and properties, and applications of materials that are in contact with biological systems, temporarily or permanently. It deals with many aspects of modern biomaterials, from basic science to clinical applications, as well as host responses. It covers the whole spectrum of biomaterials – polymers, metals, glasses and ceramics, and composites/hybrids – and includes both biological materials (collagen, polysaccharides, biological apatites, etc.) and synthetic materials. The materials can be in different forms: single crystals, polycrystalline materials, particles, fibers/wires, coatings, non-porous materials, porous scaffolds, etc. New and developing areas of biomaterials, such as nano-biomaterials and diagnostic and therapeutic nanodevices, are also focuses in this series. Advanced analytical techniques that are applicable in R &amp; D and theoretical methods and analyses for biomaterials are also important topics. Frontiers in nanomedicine, regenerative medicine and other rapidly advancing areas calling for great explorations are highly relevant.\r\nThe Springer Series in Biomaterials Science and Engineering aims to provide critical reviews of important subjects in the fi eld, publish new discoveries and significant progresses that have been made in both biomaterials development and the advancement of principles, theories and designs, and report cutting-edge research and relevant technologies. The individual volumes in the series are thematic. The goal of each volume is to give readers a comprehensive overview of an area where new knowledge has been gained and insights made. Significant topics in the area are dealt with in good depth and future directions are predicted on the basis of current developments. As a collection, the series provides authoritative works to a wide audience in academia, the research community, and industry","torrent":{"xt":"urn:btih:a3d467d0325f48d2de4e3afe89e9459a3c1faaf4","amp;dn":"Springer+Series+in+Biomaterials+Science+and+Engineering","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a3d467d0325f48d2de4e3afe89e9459a3c1faaf4","infoHashBuffer":{"type":"Buffer","data":[163,212,103,208,50,95,72,210,222,78,58,254,137,233,69,154,60,31,170,244]},"announce":[],"urlList":[]}}