{"title":"The Manipulation of Human Behavior","uid":3796933,"size":1042642,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a47dfbafe2009d1545acc9687a89e1d6a47f827b&amp;dn=The+Manipulation+of+Human+Behavior+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"sutur","files":1,"time":1189050282,"description":"If you were to begin researching interrogation, interviewing, and brainwashing techniques, you would eventually notice that one particular interesting-sounding volume appears over and over again in the relevant bibliographies: something called The Manipulation of Human Behavior, published in 1961 [by John Wiley &amp; Sons].\n\nBased on the compelling title and the fact that just about every publication in the subject area cites it, you would then probably try to seek it out for yourself--only to discover that it has never been reprinted.\n\nThen you&amp;#039;d find out a bit more: the book is a compilation of seven research reports, and funded at least in large part by the United States government. You can even track down the table of contents online, and your jaw may drop when you read the chapter titles:\n\n* The Physiological State of the Interrogation Subject as it Affects Brain Function\n* The Effects of Reduced Environmental Stimulation on Human Behavior: A Review\n* The Use of Drugs in Interrogation\n* Physiological Responses as a Means of Evaluating Information\n* The Potential Uses of Hypnosis in Interrogation\n* The Experimental Investigation of Interpersonal Influence\n* Countermanipulation through Malingering\n\nThese articles were written by the people who were paid by the US government, mostly in the 1950s, to research brainwashing and interrogation techniques by giving people drugs, placing them under sensory deprivation, hypnotizing them, etc. etc. Many of these experiments essentially involve torture and are likely to be widely regarded as highly unethical. This is fundamental research, and if there was any followup research done, it has not yet been published for public consumption.\n\nThis book is of enormous historical importance, and yet is largely unavailable. If you live in the United States, this is some of what your government was up to in the fifties. I doubt that their funding of these ideas stopped with the publication of this volume.\n\nMore: http://www.dailykos.com/story/2006/9/17/2347/10023","torrent":{"xt":"urn:btih:a47dfbafe2009d1545acc9687a89e1d6a47f827b","amp;dn":"The+Manipulation+of+Human+Behavior+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a47dfbafe2009d1545acc9687a89e1d6a47f827b","infoHashBuffer":{"type":"Buffer","data":[164,125,251,175,226,0,157,21,69,172,201,104,122,137,225,214,164,127,130,123]},"announce":[],"urlList":[]}}