{"title":"Taking Charge: The Johnson White House Tapes By Michael R. Besch","uid":8976323,"size":182836674,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:a5cfd371ef8ef7a1da27a9cdcd5ab3365e6131b4&amp;dn=Taking+Charge%3A+The+Johnson+White+House+Tapes+By+Michael+R.+Besch&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"The_Abee","files":84,"time":1380451766,"description":"Taking Charge: The Johnson White House Tapes By Lyndon B. Johnson, Michael R. Beschloss (Abee)\n___\n &lt;a href=&quot;\nhttp://ecx.images-amazon.com/images/I/51VM0WWG17L.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://ecx.images-amazon.com/images/I/51VM0WWG17L.jpg&lt;/a&gt;\n\nAbout:\n__\n\nAs seen on &quot;Nightline&quot; and &quot;Larry King Live,&quot; and excerpted extensively in Newsweek, the presidential tapes of Lyndon B. Johnson have been unsealed. They are examined in Michael R. Beschloss's Taking Charge: The Johnson White House Tapes, 1963-1964.\n\nThe only president to record his private conversations from his first day in office, LBJ ordered the tapes to be locked in a vault until at least the year 2023. But that request has been preempted and the tapes unsealed, providing a close-up look at a president taking power in a way we have never seen before, beginning with John F. Kennedy's murder in November 1963 and continuing through Johnson's campaign for a landslide victory. In Taking Charge, Beschloss, whom Newsweek has called &quot;America's leading presidential historian,&quot; has transcribed and annotated the secretly recorded tapes, providing historical commentary that allows us to understand fully the people, crises, and controversies that appear on them.\nSignificant events and revelations chronicled in Taking Charge include the aftermath of the Kennedy assassination, including Johnson's conversations with FBI director J. Edgar Hoover about the killing. Although he publicly endorsed the Warren Commission's lone-gunman findings, LBJ privately suspected that President Kennedy was killed by a conspiracy, probably backed by Fidel Castro. \n\nAs early as the spring of 1964, while he prepared for possible military action in Southeast Asia, LBJ privately expressed doubts that the United States could ever win a land war in Vietnam. \n\nJohnson feared, after signing the Civil Rights Act, that blacks, inspired by Communists and the man he called &quot;Muslim X&quot; (Malcolm X), might riot and bring about a national white backlash against civil rights. \n\nThe Johnson White House tapes provide us with an intimate look at Johnson's complex, changing relationships with Lady Bird and the rest of his family, Jacqueline Kennedy, ex-Presidents Truman and Eisenhower, and members of the White House staff. Taking Charge is not only a unique exploration of a momentous presidency but also a highly personal look at the private man who took office after an American tragedy and led the nation into some of its most tumultuous years.\n\nAudio CD\nPublisher: Simon &amp; Schuster Audio; Abridged edition (October 1, 1997)\nLanguage: English\nISBN-10: 0671046470\nISBN-13: 978-0671046477\nProduct Dimensions: 5.7 x 5 x 1 inches\n\nSee a tiny collection of my torrents. And, find your favorite books there.  ;)\n_____________________________________\n                                                                                 &lt;a href=&quot;\nhttp://thepiratebay.se/user/The_Abee/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/The_Abee/&lt;/a&gt;\n_____________________________________\n\t\t\n\n\n `~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~`\n  SEED PLEASE, LET OTHERS GET IT TOO. \n `~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~`\n\n\n                                                     :)__Abee\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\n\t\t","torrent":{"xt":"urn:btih:a5cfd371ef8ef7a1da27a9cdcd5ab3365e6131b4","amp;dn":"Taking+Charge%3A+The+Johnson+White+House+Tapes+By+Michael+R.+Besch","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a5cfd371ef8ef7a1da27a9cdcd5ab3365e6131b4","infoHashBuffer":{"type":"Buffer","data":[165,207,211,113,239,142,247,161,218,39,169,205,205,90,179,54,94,97,49,180]},"announce":[],"urlList":[]}}