{"title":"James Patterson - Honeymoon series (Retail","uid":10270916,"size":1120521,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a645683ba92f9e55a40a272f89aeb6eab2e7a9f4&amp;dn=James+Patterson+-+Honeymoon+series+%28Retail&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"TheRose88","files":2,"time":1401586289,"description":"James Patterson - Honeymoon series - Retail (epub)\n\n01 Honeymoon\n02 Second Honeymoon\n\nHoneymoon\nHow does it feel to be desired by every man and envied by every woman? Wonderful. This is the life Nora Sinclair has dreamed about, the life she's worked hard for, the life she will never give up. Meet Nora Sinclair.\n\nWhen FBI agent John O'Hara first sees her, she seems perfect. She has the looks. The career. The clothes. The wit. The sophistication. The tantalizing sex appeal. The whole extraordinary package - and men fall in line to court her. She doesn't just attract men, she enthralls them. If you dare.\n\nSo why is the FBI so interested in Nora Sinclair? Mysterious things keep happening to people around her, especially the men. And there is something dangerous about Nora when Agent O'Hara looks closer - something that lures him at the same time that it fills him with fear. Is there something dark hidden among the unexplained gaps in her past? And as he spends more and more time getting to know her, is he pursuing justice? Or his own fatal obsession?\n\nSecond Honeymoon \nA walk down the aisle, a resort hotel, a drink on the beach...for these unlucky couples, the honeymoon's over.\n\nA newlywed couple steps into the sauna in their deluxe honeymoon suite--and never steps out again. When another couple is killed while boarding their honeymoon flight to Rome, it becomes clear that someone is targeting honeymooners, and it's anyone's guess which happy couple is next on the list.\n\nFBI Agent John O'Hara is deep into solving the case, while Special Agent Sarah Brubaker is hunting another ingenious serial killer, whose victims all have one chilling thing in common.\n\nAs wedding hysteria rises to a frightening new level, John and Sarah work ever more closely together in a frantic attempt to decipher the logic behind two rampages. SECOND HONEYMOON is James Patterson's most mesmerizing, most exciting, and most surprising thriller ever.\n\n","torrent":{"xt":"urn:btih:a645683ba92f9e55a40a272f89aeb6eab2e7a9f4","amp;dn":"James+Patterson+-+Honeymoon+series+%28Retail","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a645683ba92f9e55a40a272f89aeb6eab2e7a9f4","infoHashBuffer":{"type":"Buffer","data":[166,69,104,59,169,47,158,85,164,10,39,47,137,174,182,234,178,231,169,244]},"announce":[],"urlList":[]}}