{"title":"Scan - QR and Barcode Reader v2.3 APK (Android)","uid":14259143,"size":2784739,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:a76d05b6dbe37cdf7e3e4c1b3d7371e42a047c73&amp;dn=Scan+-+QR+and+Barcode+Reader+v2.3+APK+%28Android%29+&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Pahly","files":1,"time":1460234564,"description":"Scan is the fastest and most user-friendly QR reader and barcode scanner available!\r\n\r\n\r\n[color=&quot;black&quot;&gt;HOW THE APP WORKS\r\nTo scan a QR code or barcode simply open the app, point the camera at the code, and you’re done! There is no need to take a photo or press a button. Scan will automatically recognize any code your camera is pointing at.\r\n\r\nWhen scanning a QR code, if the code contains a website URL, you will automatically be taken to the site. If the code just contains text, you'll immediately see it. For other formats such as phone numbers, email addresses, or contact info, you will be prompted to take the appropriate action.\r\n\r\nPRODUCT BARCODES\r\nScan recognizes all of the popular barcode types (UPC, EAN, and ISBN) and shows you pricing, reviews, and more about any products you scan. Barcode scanning requires a newer device in order to work reliably. Cameras on older devices do not provide the resolution or focus required for barcode scanning.\r\n\r\nFeatures:\r\nView a history list and map of all of your past scans\r\nSync your scan history across the web and all of your devices\r\nToggle your front or rear camera for scanning\r\nSet a default browser to open websites in\r\nScan pictures of QR codes and barcodes from your camera roll\r\nA switch to turn on your device’s light (if it has one) for scanning in low-light circumstances\r\n\r\nDEDICATED TO PERFECTION\r\n\r\nOur goal is to make our app the best scanning app in the store. We can’t do this without you. We are dedicated to your satisfaction and need to hear feedback from you. If you have an issue with Scan, please do not write a review of the app saying &quot;it didn't work.&quot; This does not help us make things better for you. Instead, please contact us at    or on Twitter @scan and we'll do our best to help.\r\n\r\nREQUIREMENTS\r\nIn order to use Scan, your device must have a built-in camera. When scanning codes that redirect to online content, such as websites, you will need Internet connectivity.\r\n\r\nMAKE YOUR OWN QR CODES ON SCAN.ME\r\n\r\nWhat's in this version : (Updated : 16 March 2016)\r\nWhat’s new in version 2.2.4\r\n- Enhancements to the in app browser\r\n- Bug fixes\r\nWhat’s new in version 2.2.3\r\n- Bug fixes\r\nWhat’s new in version 2.2.2\r\n- Bug fixes\r\nWhat’s new in version 2.2.1\r\n- Enhancements to the in-app browser\r\nWhat’s new in version 2.2\r\n- Fixes to minor issues and enhancements\r\n- Create and scan your own QR codes on our site at http://scan.me\r\nRequired Android O/S : 4.0+[/color]","torrent":{"xt":"urn:btih:a76d05b6dbe37cdf7e3e4c1b3d7371e42a047c73","amp;dn":"Scan+-+QR+and+Barcode+Reader+v2.3+APK+%28Android%29+","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a76d05b6dbe37cdf7e3e4c1b3d7371e42a047c73","infoHashBuffer":{"type":"Buffer","data":[167,109,5,182,219,227,124,223,126,62,76,27,61,115,113,228,42,4,124,115]},"announce":[],"urlList":[]}}