{"title":"Magicians - Greg Gleason - Theater Close-Up vol.2 DVDRip Xvid","uid":7561919,"size":732621447,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:a76f45636a8f36544768f5e921b5aee047f840c9&amp;dn=Magicians+-+Greg+Gleason+-+Theater+Close-Up+vol.2+DVDRip+Xvid&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"MagicManPC","files":4,"time":1345761503,"description":"\nGreg Gleason - Theater Close-Up vol.2 - DVDRip Xvid\n &lt;a href=&quot;\nhttp://www.penguinmagic.com/p/S7825&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.penguinmagic.com/p/S7825&lt;/a&gt;\n\nHOT SHOT OPENER - The wrong card jumps out of the deck and magically \nchanges into the selected card. Even if you can't do Daryl's Hot Shot Cut, \nyou will be able to do this.\n\nMATRIX EXPLOSION - A matrix routine where four fifty-cent pieces magically \nappear, assemble under one card, and then multiply until twelve coins \nmagically appear and cover the mat. This routine uses no gimmicked coins, \ngimmicked cards, or gimmicked mat or any other gimmicks!\n\nOSC - The overhand shuffle shift control. Greg's multiple Shift technique \nallowing you to control four cards from four different parts of the deck \nwith the overhand shuffle.\n\nBANNED FROM VEGAS - A fantastic routine where four aces are lost in the \ndeck with several shuffles including one with half the cards face up and \nhalf face down. When the cards are spread every card is face down except \nthe four aces in the center of the spread.\n\nOSC FULL DECK CONTROL - With this control you can retain an entire deck \nstack while apparently losing the four aces into different parts of the \ndeck with an overhand shuffle and riffle shuffle.\n\nINVISIBLE CARD - The invisible deck routine with a straight deck. \nSpectator shuffles the deck, thinks of a card, the deck is spread, one \ncard is reversed. It is the spectator's card. Unbelievable! You will \nalways use this.\n\nTHE LOCK UP - A selected card visually appears under a combination dial \nthat was placed on top of the face-up deck. The dial is then turned \nlocking the cards into a solid block.\n\nSIGNED CARD TO SEALED DECK - A card is selected and signed by several \npeople from a blue backed deck and lost in the deck. The deck is spread \nrevealing the selected card face up, however, there are no signatures. The \ncard is turned over to reveal it has a red back. The magician immediately \nremoves a sealed red deck, shows ALL sides, removes the cellophane, breaks \nthe seal, and removes the deck. The signed blue card is found to have \nreplaced the red mate in its exact position!!! This routine is worth the \nprice of both DVDs!\n\nRunning Time Approximately 63 min.\n\n----------------------------------------------\nYou can download the full DVDs and the rest \nof the series on Usenet at alt.binaries.magic \n(see the included pdf in this download).\n----------------------------------------------\n\nEnjoy!","torrent":{"xt":"urn:btih:a76f45636a8f36544768f5e921b5aee047f840c9","amp;dn":"Magicians+-+Greg+Gleason+-+Theater+Close-Up+vol.2+DVDRip+Xvid","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a76f45636a8f36544768f5e921b5aee047f840c9","infoHashBuffer":{"type":"Buffer","data":[167,111,69,99,106,143,54,84,71,104,245,233,33,181,174,224,71,248,64,201]},"announce":[],"urlList":[]}}