{"title":"VA - THE IN CROWD (UK MOD,R&amp;B AND BEAT 1964-67)","uid":4789185,"size":105015727,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:a7bc7367edc42a01d9066f75ff87fe72f805aaab&amp;dn=VA+-+THE+IN+CROWD+%28UK+MOD%2CR%26B+AND+BEAT+1964-67%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Iron_Horse","files":28,"time":1237654820,"description":"VA - THE IN CROWD [UK MOD,R&amp;B AND BEAT 1964-67]\nCD To Mp3 192 mbit/s\nIncluded: CD Front Cover and this Info\n\nThere's a decent amount of good stuff on this anthology, but it does represent the second to third rung of artists and tracks in this immensely exciting genre. It's something to investigate only after you've digested the Who, the Small Faces, Creation, and the Pretty Things, especially as there are no tracks by any of those groups on this 26-track anthology. And the songs by the biggest names are rather peripheral to their core discographies: The Yardbirds' &quot;Stroll On&quot; is the reworking of &quot;The Train Kept A-Rollin'&quot; that they did for the Blow-Up film, while the Spencer Davis Group's &quot;Keep on Running&quot; is a live radio version, not the original hit single. Getting past these considerations, almost everything here is fair to excellent British R&amp;B-mod, including cuts by some of the better second-division acts on the scene (Brian Auger, Julie Driscoll, the Artwoods, John's Children, the Untamed, the Eyes, Graham Bond) and early recordings by some future superstars like Rod Stewart, Steve Howe (as part of the In Crowd), and David Bowie (as part of the Manish Boys). The Action's blue-eyed soul masterpiece &quot;I'll Keep Holding On,&quot; Gary Farr &amp; the T-Bones' R&amp;B cover of Mongo Santamaria's &quot;Get the Money,&quot; and Les Fleur Des Lys' &quot;Mud in Your Eye,&quot; in fact, are great cuts, and John's Children's &quot;The Love I Thought I'd Found&quot; (also known as &quot;Smashed Blocked&quot;) is mod on the verge of dissolving into psychedelia. &quot;It's Alright,&quot; by the Rocking Vickers, is an oddity in that it's basically Pete Townshend's &quot;The Kids Are Alright&quot; with different lyrics and song structure (though Townshend still gets the songwriting credit). This is really more of a first purchase for listeners just beginning to investigate obscure mod music than one for the specialists, though, since many people interested in these sounds in the first place will already have many or most of the songs on other reissues. There's an extraordinary bonus, however: An enhanced CD track has a three-minute video clip from a 1964 documentary focusing on the Four + 1 (with future members of the psychedelic band Tomorrow), including a snippet of a live performance of Bo Diddley's &quot;Nursery Rhyme.&quot; ~ Richie Unterberger, All Music Guide\n\nTracklist:\n01. Blow Up - The In Crowd\n02. Stroll On - The Yardbirds\n03. Shake - Rod Stewart\n04. That's How Strong My Love Is - The In Crowd\n05. Hey Hey Hey Hey - Chris Farlowe &amp; The Thunderbirds\n06. Keep On Running (live session) - Spencer Davis Group\n07. Finger Poppin' - The In Crowd\n08. Don't Lie To Me - Four + 1\n09. I Take What I Want - The Artwoods\n10. Get The Money - Gary Farr &amp; The T-Bones\n11. I'll Keep On Holding On - The Action\n12. My Baby Is Gone - The Untamed\n13. Take My Tip - Manish Boys\n14. Man With Money - Wild Uncertainty\n15. It's Alright - The Rockin' Vickers\n16. I'm Rowed Out - The Eyes\n17. Mud In Your Eye - Les Fleur De Lys\n18. Love I Thought I'd Found - John's Children\n19. You're On Your Own - The In Crowd\n20. Can I Get A Witness - Steampacket\n21. Time Is On My Side - Four + 1\n22. It's For You - Rupert &amp; The Red Devils\n23. Tiger - Brian Auger &amp; The Trinity\n24. Don't Do It No More - Julie Driscoll\n25. Big Boss Man (live) - Graham Bond Organisation\n26. Slow Down (live session) - Episode Six","torrent":{"xt":"urn:btih:a7bc7367edc42a01d9066f75ff87fe72f805aaab","amp;dn":"VA+-+THE+IN+CROWD+%28UK+MOD%2CR%26B+AND+BEAT+1964-67%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a7bc7367edc42a01d9066f75ff87fe72f805aaab","infoHashBuffer":{"type":"Buffer","data":[167,188,115,103,237,196,42,1,217,6,111,117,255,135,254,114,248,5,170,171]},"announce":[],"urlList":[]}}