{"title":"Hive Jump v0.040","uid":15369408,"size":197992438,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:a89ec8368b38c65b4f91144044171ef1e902170c&amp;dn=Hive+Jump+v0.040&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dauphong","files":1,"time":1469127069,"description":"\nAbout This Game\r\nIn the 24th century, humanity is at war with a hostile alien race. Outnumbered a million to one, mankind’s only hope of survival is the J.U.M.P. Corps. Its mission is to fight the alien menace hive by hive and planet by planet.\r\n\r\nYou and your friends assume the role of JUMPERS, and blast your way through procedurally generated alien hives in chaotic run-and-gun 2D platforming action. Up to 4 Players band together in Local or Online Co-op to kill aliens, avoid traps, collect treasures and discover lost relics. Defeat fierce alien bosses to complete your mission and save the galaxy.\r\nKey Features\r\n\r\n    Action Platforming: Engage swarms of aliens in frenetic combat. Avoid traps, withstand ambushes, discover treasures, rescue survivors, and more.\r\n    Co-op Multiplayer: Play single player, or local 2-4 player co-op. (online play via Steam is coming soon)\r\n    Procedural Levels: Jump into procedurally generated alien hives. Level modifiers like dark levels keep you on your toes and offer new challenges to overcome.\r\n    Unique Permadeath: Keep the transponder backpack in one piece! It is your mobile respawn point and if it is destroyed your team has no more lives.\r\n    Challenging AI: Intelligent and fierce enemies will hunt you throughout the hive.\r\n    Sci-Fi Arsenal: Pulverize aliens with pulse rifles, flamethrowers, and a variety of unlockable and upgradable weapons that persist between missions.\r\n    Hand-Designed Challenges: Plunder challenge rooms and uncover lost relics to boost the power of your jumpers for that mission.\r\n    Dynamic Lighting: Experience pixel-perfect dynamic lighting using Sprite Lamp.\r\n    Daily/Weekly Challenges: Compete with friends and strangers to see who is the greatest jumper in the galaxy with Daily and Weekly Challenge missions with Leaderboards coming soon.\r\n    Strategic Campaigns: The results of your jumps directly impact the ongoing galactic war against the aliens. Manage your planetary campaign between jumps in a turn-based strategy mode. (feature not yet present in Early Access)\r\n    Gamepad Support: Play Hive Jump using your favorite console controller","torrent":{"xt":"urn:btih:a89ec8368b38c65b4f91144044171ef1e902170c","amp;dn":"Hive+Jump+v0.040","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a89ec8368b38c65b4f91144044171ef1e902170c","infoHashBuffer":{"type":"Buffer","data":[168,158,200,54,139,56,198,91,79,145,20,64,68,23,30,241,233,2,23,12]},"announce":[],"urlList":[]}}