{"title":"The Men Who Made Us Fat (1 of 3) 2012 BBC ","uid":7357383,"size":750506028,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:aa61deba09dae7ca0ece003402c9fc6a5eb70467&amp;dn=The+Men+Who+Made+Us+Fat+%281+of+3%29+2012+BBC+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"john1942","files":4,"time":1339814816,"description":"The Men Who Made Us Fat (1 of 3) 2012 BBC \n\n\n781mb/58mns/avi\n\n &lt;a href=&quot;\nhttp://www.bbc.co.uk/programmes/b01jxzv8&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.bbc.co.uk/programmes/b01jxzv8&lt;/a&gt;\n\n\nAround the world, obesity levels are rising. More people are now overweight\nthan undernourished. Two thirds of British adults are overweight and one in\nfour of us is classified as obese. In the first of this three-part series,\nJacques Peretti traces those responsible for revolutionising our eating habits,\nto find out how decisions made in America 40 years ago influence the way we eat\nnow.\n\nPeretti travels to America to investigate the story of high-fructose corn\nsyrup. The sweetener was championed in the US in the 1970s by Richard Nixon's\nagriculture secretary Earl Butz to make use of the excess corn grown by\nfarmers. Cheaper and sweeter than sugar, it soon found its way into almost all\nprocessed foods and soft drinks. HFCS is not only sweeter than sugar, it also\ninterferes with leptin, the hormone that controls appetite, so once you start\neating or drinking it, you don't know when to stop.\n\nEndocrinologist Robert Lustig was one of the first to recognise the dangers of\nHFCS but his findings were discredited at the time. Meanwhile a US Congress\nreport blamed fat, not sugar, for the disturbing rise in cardio-vascular\ndisease and the food industry responded with ranges of 'low fat', 'heart\nhealthy' products in which the fat was removed - but the substitute was yet\nmore sugar.\n\nMeanwhile, in 1970s Britain, food manufacturers used advertising campaigns to\npromote the idea of snacking between meals. Outside the home, fast food chains\noffered clean, bright premises with tempting burgers cooked and served with a\nvery un-British zeal and efficiency. Twenty years after the arrival of\nMcDonalds, the number of fast food outlets in Britain had quadrupled.\n\n-------------------------------------------------------------------------------\nA short sample is included for evaluation.\n-------------------------------------------------------------------------------\n\nMovie (AVI) Name ..: BBC The Men Who Made Us Fat 1 of 3 2012.avi\n","torrent":{"xt":"urn:btih:aa61deba09dae7ca0ece003402c9fc6a5eb70467","amp;dn":"The+Men+Who+Made+Us+Fat+%281+of+3%29+2012+BBC+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aa61deba09dae7ca0ece003402c9fc6a5eb70467","infoHashBuffer":{"type":"Buffer","data":[170,97,222,186,9,218,231,202,14,206,0,52,2,201,252,106,94,183,4,103]},"announce":[],"urlList":[]}}