{"title":"Kathryn Stockett The Help 2009 Retail eBook-BitBook","uid":8233157,"size":2718804,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ab261ee8aa9c09544a1de6765cdbe34fb07de262&amp;dn=Kathryn+Stockett+The+Help+2009+Retail+eBook-BitBook&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"BlackTar","files":3,"time":1362773018,"description":" |                                The Help                                    |\n |                                                                            |\n |                                                                            |\n |                                                                            |\n |                                                                            |\n | DATE: 2012-07-07  SIZE: 1,70MB   DISKS: 01_______4,77MB      PAGES:        |\n |                                                                            |\n | PUBLISHER: Penguin USA                       GENRE: Fiction                |\n |                                                                            |\n | AUTHOR: Kathryn Stockett                                                   |\n |                                                                            |\n | FORMAT: PDF    PROTECTION: DRM     EDITION:                                |\n |                                                                            |\n | URL:                                                  |\n |                                                                            |\n | LANGUAGE: English   ISBN: 9781440697623                                    |\n :                                                                            :\n : Be prepared to meet three unforgettable women:                             :\n :                                                                            :\n : Twenty-two-year-old Skeeter has just returned home after graduating from   :\n : Ole Miss. She may have a degree, but it is 1962, Mississippi, and her      :\n : mother will not be happy till Skeeter has a ring on her finger. Skeeter    :\n : would normally find solace with her beloved maid Constantine, the woman who:\n : raised her, but Constantine has disappeared and no one will tell Skeeter   :\n : where she has gone.                                                        :\n :                                                                            :\n : Aibileen is a black maid, a wise, regal woman raising her seventeenth white:\n : child. Something has shifted inside her after the loss of her own son, who :\n : died while his bosses looked the other way. She is devoted to the little   :\n : girl she looks after, though she knows both their hearts may be broken.    :\n :                                                                            :\n : Minny, Aibileen's best friend, is short, fat, and perhaps the sassiest     :\n : woman in Mississippi. She can cook like nobody's business, but she can't   :\n : mind her tongue, so she's lost yet another job. Minny finally finds a      :\n : position working for someone too new to town to know her reputation. But   :\n : her new boss has secrets of her own.                                       :\n :                                                                            :\n : Seemingly as different from one another as can be, these women will        :\n : nonetheless come together for a clandestine project that will put them all :\n : at risk. And why? Because they are suffocating within the lines that define:\n : their town and their times. And sometimes lines are made to be crossed.    :\n :                                                                            :\n : In pitch-perfect voices, Kathryn Stockett creates three extraordinary women:\n : whose determination to start a movement of their own forever changes a     :\n : town, and the way women-mothers, daughters, caregivers, friends-view one   :\n : another. A deeply moving novel filled with poignancy, humor, and hope, The :\n : Help is a timeless and universal story about the lines we abide by, and the:\n : ones we don't.                                                             :","torrent":{"xt":"urn:btih:ab261ee8aa9c09544a1de6765cdbe34fb07de262","amp;dn":"Kathryn+Stockett+The+Help+2009+Retail+eBook-BitBook","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ab261ee8aa9c09544a1de6765cdbe34fb07de262","infoHashBuffer":{"type":"Buffer","data":[171,38,30,232,170,156,9,84,74,29,230,118,92,219,227,79,176,125,226,98]},"announce":[],"urlList":[]}}