{"title":"Samurai Shodown III Blades of Blood (PS1) (NTSC/U)","uid":10403266,"size":153231,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:ab7ee0b09fe96a2af30b85a65502d88676367937&amp;dn=Samurai+Shodown+III+Blades+of+Blood+%28PS1%29+%28NTSC%2FU%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"razalgul1979","files":-1,"time":1403406773,"description":"This torrent is just the link to download the game, I'm hosting my PS1 games on 4shared.PS1 Games hosted has  more advantage is fast and you do not need to seed, seed my link only \n\nI recommend Alcohol 120% to burn.I like Alcohol 120% and always used for Playstation.\n\nI recommend Internet Download Manager to download at 4shared works fine!\n\nThe game was tested on my PSone baby Ntsc and works 100%\n\n\nSNK's arcade hit SAMURAI SHODOWN III: Blades of Blood has finally come to the PlayStation in a near-perfect conversion. You can choose your warrior from among 12 different characters, each with unique attacks, weapons, and combinations. Furthermore, every character has two distinct personalities that alter which of the characters attacks are available. While other fighting games focus on fast, furious attack combinations, the SAMURAI SHODOWN games have always focused on patience. Players must defend and look for opportunities to get in attacks. Mashing buttons in hopes of pulling off one spectacular move will lead to certain death. Besides challenging the computer-controlled opposition, you can also challenge your friends to a match. Try to destroy the competition in SAMURAI SHODOWN III: Blades of Blood.\n\nRelease Date: December 1, 1996\nT for Teen: Blood, Animated Violence\nGenre: Fighting\nPublisher: Sony Computer Entertainment\nDeveloper: SNK\n\nSupported Functions\nNumber Of Players: 1-2\nMemory Card\n\n12 unique characters with different special moves and combo attacks; detailed 2D rendered characters and background; two-player Versus mode; based on the classic arcade game","torrent":{"xt":"urn:btih:ab7ee0b09fe96a2af30b85a65502d88676367937","amp;dn":"Samurai+Shodown+III+Blades+of+Blood+%28PS1%29+%28NTSC%2FU%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ab7ee0b09fe96a2af30b85a65502d88676367937","infoHashBuffer":{"type":"Buffer","data":[171,126,224,176,159,233,106,42,243,11,133,166,85,2,216,134,118,54,121,55]},"announce":[],"urlList":[]}}