{"title":"Feminist Interpretations of Hans-Georg Gadamer.pdf","uid":4866760,"size":4198787,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:abbc8609bb50c2f98948c095c1eb05c890a08919&amp;dn=Feminist+Interpretations+of+Hans-Georg+Gadamer.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Gorra09","files":1,"time":1240566384,"description":"Feminist Interpretations of Hans-Georg Gadamer\n\nEdited by Lorraine Code | 2002 | PDF | ISBN 978-0-271-02243-7\n\nImages of and references to women are so rare in the vast corpus of his published work that there seems to be no &quot;woman question&quot; for Hans-Georg Gadamer. Yet the authors of the fifteen essays included in this volume show that it is possible to read past Gadamer's silences about women and other Others to find rich resources for feminist theory and practice in his views of science, language, history, knowledge, medicine, and literature.\n\nWhile the essayists find much of value in Gadamer's work, he emerges from their discussion as a controversial figure. Some contributors see him as promoting genuine respect for and engagement with Otherness: others claim that in a Gadamerian conversation the Other has no voice. For some, Gadamer's immersion in tradition is an impediment to feminist inquiry; for others, cognizant of the need to understand tradition well in order to contest its intransigence or benefit from its insights, his way of engaging tradition is especially productive. Some contributors take issue with the separation he maintains between philosophy and politics; others find problems in his relative silence on matters of embodiment; still others maintain that a &quot;fusion of horizons&quot; amounts to a colonizing of difference. But a common aim of each of these controversies is to discern what feminists can learn from Gadamer as well as what limitations feminist reinterpretations of his work must inevitably encounter.","torrent":{"xt":"urn:btih:abbc8609bb50c2f98948c095c1eb05c890a08919","amp;dn":"Feminist+Interpretations+of+Hans-Georg+Gadamer.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"abbc8609bb50c2f98948c095c1eb05c890a08919","infoHashBuffer":{"type":"Buffer","data":[171,188,134,9,187,80,194,249,137,72,192,149,193,235,5,200,144,160,137,25]},"announce":[],"urlList":[]}}