{"title":"Biblical Archeology, Volume 1-3 - Dr. Johnson Philip","uid":11773383,"size":859437,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ac8112a96efce220be51ae7c2789e84a1b8e9900&amp;dn=Biblical+Archeology%2C+Volume+1-3+-+Dr.+Johnson+Philip&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"starxteel","files":3,"time":1427166170,"description":"\nBible and its message are completely dependent upon history. Events like temptation and fall in Eden, promise of a virgin-born savior, and the suffering, crucifixion, and resurrection of the savior are foundational to the Christian faith.\n\nVolume 1: Offers an &quot;introduction&quot; to Biblical Archeology. It does not list or describe discoveries, which will come only in a future volume.\n\nVolume 2: Students of Archeology and Biblical Archeology often ask &quot;how do they determine that a certain object is several thousand years old&quot;. This book takes a look at methods of finding dates. Dating is a technical subject, but the authors have tried to make this book a simple as possible. This book is of interest to those people who want to know more about Dating Methods in Archeology, but without too much technical jargon or mathematics.\n\nVolume 3: This 3rd Volume in the Biblical Archeology series explains why Biblical Archeology is highly important for Christian apologetics and apologists. Of all the religions and faiths in the world, the Christian faith is different and unique in its historical component. While all the other religions and faiths &quot;contain&quot; histories, the Christian faith is &quot;based&quot; upon history. Even if the historical content of all other faiths is removed, their basic philosophy or substance is not affected. But this cannot be done with the Bible. Remove the historical content, and the Christian faith [and the Jewish faith] comes to a naught.\n\n\nAbout the author:\nDr. Philip is a Writer-Publisher based in India. He has been a student, researcher and communicator all his life. Physics is his first love and in 1991 he was awarded the PhD in Quantum-nuclear Physics. It was based upon his work on the quark-structure of protons and neutrons.\n\nHowever, his life took him to theology before he could complete his research in Physics. Thus he was awarded the ThD in Christian Apologetics in 1984 based upon his work on Bible and Modern Science.\n\nHe then got interested in Alternative Medicines and was awarded the DSc in 2003 based upon his dissertation on the Empirical Foundations of Alternative Medicine. In 2004 he was awarded DNYS, a degree in Indian Naturopathy.\n\nArcheology has always interested him and soon he added numismatics to it and after several years of work his dissertation on Middle Eastern Archeology and Numismatics brought him the degree of PhD in that field.\n\nThey say it is time for him to stop. So his formal studies came to an end at the age of 58 (2012), but he continues to be a student. He loves knowledge. He also loves to share it and that is the primary reason he decided to post revised versions of most of his books as Kindle eBooks.\n\nSo far he has authored more than 100 books in several fields. He has also published more than 10,000 articles in a number of fields. his life is now totally dedicated to communication of ideas","torrent":{"xt":"urn:btih:ac8112a96efce220be51ae7c2789e84a1b8e9900","amp;dn":"Biblical+Archeology%2C+Volume+1-3+-+Dr.+Johnson+Philip","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ac8112a96efce220be51ae7c2789e84a1b8e9900","infoHashBuffer":{"type":"Buffer","data":[172,129,18,169,110,252,226,32,190,81,174,124,39,137,232,74,27,142,153,0]},"announce":[],"urlList":[]}}