{"title":"Beck - The New Pollution [promo].VOB","uid":9012162,"size":270501888,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:ac8f312422ed4c51d76ac8ea0c4915e2bf8ab0e7&amp;dn=Beck+-+The+New+Pollution+%5Bpromo%5D.VOB&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"SgtRlee","files":-1,"time":1381120608,"description":"Beck - The New Pollution [promo].VOB\n\n\nHQ rare promo music video from a promo DVD. &quot;The New Pollution&quot; is a single by Beck, taken from his album Odelay.\n\nThe music video, directed by Beck himself, features 1960's-style dancing and background. The video was nominated for 5 1997 MTV VMA awards such as Video Of The Year, and Best Alternative Video, and he won Best Direction In A Video, Best Choreography In A Video, and Best Art Direction In A Video. The video features actress Mary Lynn Rajskub.\n\nOdelay is the fifth studio album by American alternative rock artist Beck, originally released on June 18, 1996, by DGC Records.\n\nOdelay featured several hit singles, including &quot;Where It's At&quot;, &quot;Devils Haircut&quot;, and &quot;The New Pollution&quot;. The album peaked at #16 on the Billboard 200 chart and eventually sold over 2 million copies in the United States. It was also Beck's first hit album in the United Kingdom, making #17; it has since gone platinum in the UK.\n\nOdelay was nominated for the Grammy Award for Album of the Year and won a Grammy Award for Best Alternative Music Album in 1997, as well as a Grammy Award for Best Male Rock Vocal Performance for &quot;Where It's At&quot;. It was ranked 16 in Spin's &quot;100 Greatest Albums, 1985-2005&quot;. Odelay was awarded Album of the Year by the American magazine Rolling Stone. It was voted as the best album of the year in The Village Voice Pazz &amp; Jop critics poll, and also in the NME's annual critics poll. In 1998, Q magazine readers voted Odelay the 51st greatest album of all time. In 2003, the album was ranked number 305 on Rolling Stone magazine's list of the 500 greatest albums of all time. Voters in Channel 4's 2005 &quot;100 Greatest Albums&quot; poll placed it at number 73. The music website Pitchfork Media ranked it at #19 on their top 100 albums of the 1990s.\n\nBeck Hansen (born Bek David Campbell, July 8, 1970), known by the stage name Beck, is an American musician, singer-songwriter and multi-instrumentalist. Beck rose to fame in the early 1990s with his lo-fi, sonically experimental sound, and he became well known for creating musical collages of a wide range of styles. His later recordings encompass everything from folk, funk, soul, hip hop, alternative rock, and country to psychedelia. Beck has released ten studio albums, as well as several non-album singles and a book of sheet music.\n\nWith a pop art collage of musical styles, oblique and ironic lyrics, and postmodern arrangements incorporating samples, drum machines, live instrumentation and sound effects, Beck has been hailed by critics and the public throughout his musical career as being amongst the most creative and idiosyncratic musicians of 1990s and 2000s alternative rock. Beck is currently working on two new studio albums.\n(video has a 5 semi-transparent blue dots at the bottom right)\n\n\n\n    &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/The_New_Pollution&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/The_New_Pollution&lt;/a&gt; \n      &lt;a href=&quot;\nhttp://bayimg.com/IAAbNaAFj&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/IAAbNaAFj&lt;/a&gt; \n   \n\n\nFile properties info using Media Player Classic: \n   Video: MPEG2 Video 720x576 (4:3) 25fps 8000kbps\n   Audio: LPCM 48000Hz stereo 1536kbps [DVD LPCM, 16 bit]\n   Duration: 00:03:43\n\n\n\n\n*Install the &quot;Media Player Classic&quot; player if you can't play this file, \nor for better visual and audio quality playback of all your videos. \nIt's 100% free to download and use. Latest stable build is v1.7.0\n\n\n*Media Player Classic Home Cinema*  &lt;a href=&quot;\nhttp://mpc-hc.sourceforge.net/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://mpc-hc.sourceforge.net/&lt;/a&gt; \n\n\nSgtRlee (Sgt.R.Lee) \n\t","torrent":{"xt":"urn:btih:ac8f312422ed4c51d76ac8ea0c4915e2bf8ab0e7","amp;dn":"Beck+-+The+New+Pollution+%5Bpromo%5D.VOB","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ac8f312422ed4c51d76ac8ea0c4915e2bf8ab0e7","infoHashBuffer":{"type":"Buffer","data":[172,143,49,36,34,237,76,81,215,106,200,234,12,73,21,226,191,138,176,231]},"announce":[],"urlList":[]}}