{"title":"Pet Shop Boys - Release","uid":6630851,"size":349852011,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:aca73dad161c546304be6486a9df257d97e60ddc&amp;dn=Pet+Shop+Boys+-+Release&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"cdda-flac","files":-1,"time":1314319061,"description":"\n &lt;a href=&quot;\nhttp://g-ecx.images-amazon.com/images/G/01/ciu/a0/fb/e340225b9da0be96744d6110.L.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://g-ecx.images-amazon.com/images/G/01/ciu/a0/fb/e340225b9da0be96744d6110.L.jpg&lt;/a&gt;\n\n\nTitle: Release\nArtist: Pet Shop Boys\nAudio CD  (April 23, 2002)\nNumber of Discs: 1\nGenre: Pop\nFormat: Free Lossless Audio Codec\n\n\nTrack Listing:\n\n01. Home and Dry\n02. I Get Along\n03. Birthday Boy\n04. London\n05. E-Mail\n06. The Samurai in Autumn\n07. Love Is a Catastrophe\n08. Here\n09. The Night I Fell in Love\n10. You Choose\n\n\nAllmusic Review:\nThe Pet Shop Boys have never made a bad album, but with Nightlife, they started to seem a little worn out, as if they had explored their sound as far as it would go. But Neil Tennant and Chris Lowe are among the smartest, pop-savvy groups to ever record, so they not only realized they were stagnating, they knew what to do about it, bringing Tennant's Electronic partner and former Smiths guitarist Johnny Marr for several songs, and moving the group toward careful, considered, mature pop for their eighth album, Release (another pun-worth title, worthy of Please). For most artists, the adjective &quot;mature&quot; would seem an epithet, but here it's an accurate description for this elegant, eloquent, knowing music -- it's maturation achieved through experience and worldliness, not an exorbitant bank account. On that level, this is about the most mature pop album released this decade, exhibiting a refined sense of craft and a keen sense of purpose, marrying the particular sentiment of a song with the right production. It's hard to call Release an album of its time, since it hardly falls prey to trends, but it's aware of its time -- an album that's proudly out of step with the particulars of hipness, but knows what they constitute, knows what they feel like, knows what modernism means for somebody who's lived their life with the burden of being hip, whose always felt a compulsion to stay on top of things -- and feeling that desire fade as you get older. So, that means that while Release occasionally sings of the new -- synth lines, vocoders, beats, a song designed to respond to Eminem's homophobia (the exquisite &quot;The Night I Fell in Love&quot;) -- it's from the vantage of people who have lived through all of this before, and know particulars will pass while the song remains the same. The great thing is, even if this sentiment has been present in previous Pet Shop Boys albums, they have brought the dance-club to the background (partially due to Marr's presence) and have brought the songs to the forefront, resulting in a record that feels like the Pet Shop Boys, even when it doesn't sound like them. And that's a good thing, since it retains their greatest attributes while giving them a new spin, and it makes for the best Pet Shop Boys album in nearly ten years.","torrent":{"xt":"urn:btih:aca73dad161c546304be6486a9df257d97e60ddc","amp;dn":"Pet+Shop+Boys+-+Release","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aca73dad161c546304be6486a9df257d97e60ddc","infoHashBuffer":{"type":"Buffer","data":[172,167,61,173,22,28,84,99,4,190,100,134,169,223,37,125,151,230,13,220]},"announce":[],"urlList":[]}}