{"title":"Thao &amp; Mirah(2011)[FLAC]","uid":6354628,"size":258398687,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:ace0112f2e251699148d9fbe2e50a4d0fe23f7a4&amp;dn=Thao+%26+Mirah%282011%29%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dickspic","files":14,"time":1304111567,"description":" &lt;a href=&quot;http://image.allmusic.com/00/amg/cov200/drp800/p864/p86422ec0w0.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://image.allmusic.com/00/amg/cov200/drp800/p864/p86422ec0w0.jpg&lt;/a&gt;\n\nApr 25, 2011 Kill Rock Stars KRS538\n\n[img]http://i128.photobucket.com/albums/p180/SonAfterDark/tracklistlatest.png[/img]\n\n1\t\tEleven\t                 4:01\n2\t\tFolks\t\t2:53\n3\t\tLittle Cup\t\t3:35\n4\t\tRubies and Rocks\t4:03\n5\t\tTeeth\t\t2:52\n6\t\tSpaced Out Orbit\t4:24\n7\t\tHow Dare You\t2:59\n8\t\tSugar and Plastic\t2:02\n9\t\tLikeable Man\t3:34\n10\t\tHallelujah\t\t4:08\n11\t\tSquareneck\t3:39\n\nFor a collaboration between a couple of noted songwriters, it's striking that the songs are often the least interesting thing about Thao &amp; Mirah. There are a handful which stand out on their own merits -- Thao Nguyen's singsongy &quot;How Dare You,&quot; an R&amp;B-tinged call-and-response that's the only proper duet here; Mirah Zeitlyn's characteristically hushed, thoughtful &quot;Hallelujah,&quot; which dares to brush against the deathless Leonard Cohen classic and fares impressively well, considering. But by and large, the album is more notable and enjoyable as an exploration of sounds and textures (both instrumental and vocal) than as a collection of melodies and lyrics. The tip-off comes early, with the joyfully dense, clattering opener &quot;Eleven,&quot; an energetic if loosely structured three-way collision with Merrill Garbus of tUnE-yArDs, who provides not only the simple, lusty vocal hook (tellingly, and perhaps a little troublingly, the most memorable one here) but also a hefty dose of her band's percussion-heavy, chant-friendly, loopy D.I.Y. spirit. Garbus also co-produced the album and contributes instrumentally or vocally to all but one song (that's two more than Nguyen, who sits out on three of Zeitlyn's five solo compositions), and it's tempting to imagine what they might work up together as a fully collaborative trio -- Mirah, Thao &amp; Merrill, which might have been a more accurate title here anyway. Nothing else bears Garbus' influence quite so overtly, though it's not hard to hear her fingerprints on, for instance, Zeitlyn's breathily sultry &quot;Rubies and Rocks,&quot; whose simmering, Afro-tinged groove and swirling horn riffs eventually develop into a full-on jazz-funk blowout. Of course, there's also plenty of room for the distinct and notably divergent voices of the much-loved marquee duo. And they manage a more successful and satisfying merger than on their previous collaborative venture, a joint 2010 tour wherein Thao's livelier, rockier numbers alternated incongruously and sometimes disruptively with Mirah's softer acoustic folk. Here the pair find a wide-ranging middle ground, with some fruitful artistic stretching on both sides -- Thao trading rangy rock for tender prettiness on &quot;Teeth&quot; and &quot;Folks&quot; (but letting it out on the scrappy, screwball slide-fest &quot;Squareneck&quot;); Mirah taking a playfully bluesy turn on &quot;Sugar and Plastic&quot; (and saving her habitual solemnity for the oddly humorless sci-fi oddity &quot;Spaced Out Orbit&quot; ). It's not an especially coherent album, nor a very revealing one, offering surprisingly little insight into Thao &amp; Mirah's relationship either as musical or romantic partners. But it does sound like they're having fun, and that counts for a good deal.\n\ncd ripped by dBpoweramp\n\nplease seed\n &lt;a href=&quot;\nhttp://dickthespic.org/2011/03/14/thao-and-mirah/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://dickthespic.org/2011/03/14/thao-and-mirah/&lt;/a&gt;","torrent":{"xt":"urn:btih:ace0112f2e251699148d9fbe2e50a4d0fe23f7a4","amp;dn":"Thao+%26+Mirah%282011%29%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ace0112f2e251699148d9fbe2e50a4d0fe23f7a4","infoHashBuffer":{"type":"Buffer","data":[172,224,17,47,46,37,22,153,20,141,159,190,46,80,164,208,254,35,247,164]},"announce":[],"urlList":[]}}