{"title":"ABC Four Corners - Cyber War (2016)","uid":15717316,"size":234677129,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:ad28e4126d94ca3cc5084a9973511a344b6321ef&amp;dn=ABC+Four+Corners+-+Cyber+War+%282016%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"haydent","files":1,"time":1472638103,"description":"** Featuring Kevin Mitnick **\r\n\r\nCyber War: How hackers are threatening everything from your bank account to the nation's secrets.\r\n\r\nIn a room, deep inside a Las Vegas hotel, the world's best hackers are gathering.\r\n\r\n&quot;You have to go into a backroom... there you're going to find about a dozen teams playing against each other, no more than a hundred people. These are really the world's cyber elite.&quot; Artificial Intelligence developer\r\n\r\nThey're here to compete against each other and they're being watched by cyber warfare agencies the world over, not for prosecution, but for recruitment. They have the skills needed to wage espionage and warfare in the modern age.\r\n\r\nOn Monday night Four Corners takes you into the world of cyber hacking, where the weapon of choice is computer code.\r\n\r\n&quot;In WWII we bombed and destroyed the electrical infrastructure of our enemies. Now we have the ability through a cyber attack to just shut the grid down.&quot; Former CIA Director Michael Hayden\r\n\r\nFeaturing an interview with the former head of the CIA and the NSA, Michael Hayden, he explains how the intelligence business has changed with young hackers parachuted into sensitive operational activities.\r\n\r\n&quot;Right ok, take out the power grid... Red Team power is going down, what I want you to look at now, do as much damage as you can.&quot; Australian Cyber Trainer\r\n\r\nWe take you into the cutting edge facility where Australian soldiers are being trained in the arts of cyber warfare - where their computer skills can be used to shut down a power grid or cut off a city's water supply.\r\n\r\n&quot;The Australian Government knows it needs to protect these things... and will continue to strive to stay ahead of whatever the threat environment is.&quot; Australian Govt Cyber Adviser\r\n\r\nAnd will reveal the strategic Australian companies and institutions that have found themselves hacked.\r\n\r\n&quot;They're so deep inside our network it's like we had someone sitting over our shoulder for anything we did.&quot; IT manager\r\n\r\nIt's not just nation states that are in the hacking business, it's also criminals, and as the program demonstrates, it's frighteningly easy to hack our lives. If you have a smart phone, if you use internet banking, if you store your information &quot;in the cloud&quot; then you are at risk.\r\n\r\n&quot;Cybercrime poses one of the greatest challenges to law enforcement this century. No longer do we have that individual who carries a firearm and wears a balaclava to disguise their identity. It's a lot more profitable and a lot easier for someone to pick up a laptop, sit in the comfort of their lounge room behind the anonymity of the internet and take the bank for millions of dollars.&quot; Australian Police Officer","torrent":{"xt":"urn:btih:ad28e4126d94ca3cc5084a9973511a344b6321ef","amp;dn":"ABC+Four+Corners+-+Cyber+War+%282016%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ad28e4126d94ca3cc5084a9973511a344b6321ef","infoHashBuffer":{"type":"Buffer","data":[173,40,228,18,109,148,202,60,197,8,74,153,115,81,26,52,75,99,33,239]},"announce":[],"urlList":[]}}