{"title":"[Kung Fu] Drunken Master (Jackie Chan, Simon Yuen, 1978) CN, Rem","uid":3859903,"size":412856722,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:ae10688ddd340486891af88bc310c44031848d71&amp;dn=%5BKung+Fu%5D+Drunken+Master+%28Jackie+Chan%2C+Simon+Yuen%2C+1978%29+CN%2C+Rem&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"JamesKees","files":8,"time":1193421331,"description":"Drunken Master (Jackie Chan, Simon Yuen, 1978) CN, Remastered - Rmvb\n\nHKFlix Says:  \nThis was the first film that really caused the world to sit up and take notice of Jackie Chan, and righfully so. This is a great example of his physical and comedic genius, the film is truly a joy. \n\nAvg. Rating:  4.2 / 5 (based on 44 ratings). What did you think of it?  \n\nPlot: Under the guidance of Sam Seed (Yuen Siu Tien), Wong Fei Hung (Jackie Chan) endures some of the most torturous training ever devised in a bid to master the devastating art of Drunken Boxing. \n \nOverview: Stunning, groundbreaking martial arts from the world&amp;#039;s most famous action star. On the year of its original release, &quot;Drunken Master&quot; sent Jackie Chan&amp;#039;s rising star soaring into orbit, and gave martial arts cinema one of its most accomplished and best-loved action adventures. \nWith a brilliant tongue-in-cheek portrayal of indestructible folk hero Wong Fei Hung, later played with single-minded determination by Jet Li in the &quot;Once Upon A Time In China&quot; series, Jackie Chan shines as the young fighter with a talent for trouble and the potential to become a legend. \n\nUnder the guidance of Sam Seed (Yuen Siu Tien), Fei Hung endures some of the most torturous training ever devised in a bid to master the devastating art of Drunken Boxing. His climactic battle with ace kick-fighter Hwang Jang Lee, which highlights the forms of the Eight Drunken Mortals, is a breathtaking showcase and a glowing tribute to the awesome physical talents of both performers. \n\n&quot;Drunken Master&quot; is a must for any serious collector of martial arts cinema. Known to be one of Jackie&amp;#039;s personal favorites, the star often recalls performing take after take to perfect the incredible physical maneuvers required for the role. The result is one of the most innovative, fun-filled, action-packed martial arts adventures ever to grace the silver screen. You&amp;#039;d need to be drunk to miss it!! \n\nCast: Jackie Chan  ||  Simon Yuen  ||  Hwang Jang Lee  ||  Lam Kau  ||  Yuen Shun-Yi  ||  Dean Shek Tin  ||  Hsu Hsia  ||  Brandy Yuen (Jan Yeung)  ||  Linda Lin Ying  ||  Tino Wong Cheung  ||  Yuen Wo Ping  ||  Fung Ging Man  ||  San Kuai  ||  Lee Chun Wa  ||  Huang Ha  ||  Chiang Kam  ||  Tong Jing  ||  Wang Han Chen  \n &lt;a href=&quot;\nhttp://www.hkflix.com/xq/asp/filmID.537210/qx/details.htm&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.hkflix.com/xq/asp/filmID.537210/qx/details.htm&lt;/a&gt;\n\nP.S.\nSubtitles file for &quot;New Crouching Tiger, Hidden Dragon&quot; available at:\n\n_________________\nDo not break the share chain! Once you have completed download, seed for the next person in the chain as you possibly can. If this torrent link is dead or not well seeded, PM me for a re-seed!\n","torrent":{"xt":"urn:btih:ae10688ddd340486891af88bc310c44031848d71","amp;dn":"%5BKung+Fu%5D+Drunken+Master+%28Jackie+Chan%2C+Simon+Yuen%2C+1978%29+CN%2C+Rem","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ae10688ddd340486891af88bc310c44031848d71","infoHashBuffer":{"type":"Buffer","data":[174,16,104,141,221,52,4,134,137,26,248,139,195,16,196,64,49,132,141,113]},"announce":[],"urlList":[]}}