{"title":"Duffer (1971) Gay Interest","uid":9495489,"size":733861924,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:b0da51ba1c4a2ccf2820126c480fba816e6e68ec&amp;dn=Duffer+%281971%29+Gay+Interest&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":3,"time":1390092807,"description":"'Duffer' (1971) is a rarely seen cult British movie that has languished in the vaults of the British Film Institute for the best part of forty years until they decided to release it on DVD/BluRay for the first time last month. It's a black and white movie set in a declining Notting Hill with pretty much no dialogue spoken by those taking part in it. Almost everything is spoken as a commentary by Duffer, a lost teenage boy whose life bounces between homosexual and heterosuxual worlds. This movie anticipates David Lynch's 'Eraserhead' by five years.\n \nThe grimly surreal story concerns a teenage boy called Duffer (brilliantly played by Kit Gleave) who alternates between two sexual partners - Louis Jack (James Roberts), a sadistic, psychopathic, misogynist, Catholic older man, with whom he submits to bizarre and violent S&amp;M sex (sodomy, asphyxiation, worms poured over his naked body while being filmed etc.) and Your Gracie (Erna May), a kindly, large prostitute. The film follows Duffer as he moves between Louis Jack's dark world and Your Gracie's soft, light, playful existence.\n \nLouis Jack and Your Gracie are simultaneously surrogate parents as well as sexual partners for Duffer. This unique oedipal/omnisexual/role playing psychodrama grows ever more disturbing as Louis Jack's madness seems to infect Duffer. He walks the shadowy, menacing streets of Notting Hill in an ever mounting state of derangement. It is obvious that there will be blood, sooner or later. With haunting piano music by Galt MacDermot (composer of the musical 'Hair') and electronic interjections from the BBC Radiophonic Workshop's acclaimed Delia Derbyshire (she originated the ground breaking Doctor Who theme), 'Duffer' is a rough, compelling and rewarding ride into a netherworld of diverse sexuality, madness and obsession.\n \n","torrent":{"xt":"urn:btih:b0da51ba1c4a2ccf2820126c480fba816e6e68ec","amp;dn":"Duffer+%281971%29+Gay+Interest","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b0da51ba1c4a2ccf2820126c480fba816e6e68ec","infoHashBuffer":{"type":"Buffer","data":[176,218,81,186,28,74,44,207,40,32,18,108,72,15,186,129,110,110,104,236]},"announce":[],"urlList":[]}}