{"title":"Kenny G - Wishes - A Holiday Album - Christmas Jazz","uid":9329350,"size":93197306,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:b11db24540e6c90976e3d443bcb59cdc1cc11335&amp;dn=Kenny+G+-+Wishes+-+A+Holiday+Album+-+Christmas+Jazz&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Big-Papi","files":13,"time":1386699325,"description":"Source: 2002 CD Volume Normalized\n-\nKenny G - Wishes - A Holiday Album 320cbr (Big Papi) 2002 Christmas Jazz Music\n \n-\nBy Pastor Roger\nI'm a huge fan of Kenny G. I fell in love with his music when &quot;Songbird&quot; first hit the airwaves in the 80's. I can't say that he's ever recorded a bad song or CD. But there are some that I like better than others. This is one of them. To go one better, I found this for sale in the internet from a used CD shop less than a month after it came out! To go one better, it was less than $$$ and in brand new condition! That in itself was excellent!\n\nI have Kenny G's other 2 holiday CD's. While I love all 3 of them, this is the best by far. 7 of the songs of this disc are what people refer to as religious holiday music. Don't get me wrong. I love holiday music, whether spiritual or secular. But my preference is for the sacred. My favorites on this disc are &quot;Oh Holy Night,&quot; &quot;Joy To The World,&quot; and &quot;God Rest Ye Merry Gentlemen.&quot; Kenny G adds his own unmistakeable smooth style as he does the rest of his music.\n\nI do have 2 complaints about this CD. First, the last song on it is &quot;Auld Lang Syne, The Freedom Mix.&quot; It has some of the same stuff from the 20th Century that's included in &quot;Auld Lang Syne, The New Millennium Mix&quot; on his last holiday collection. The only difference is that he added a few extra historic items that happened since 1999. My other complaint is that this collection is only 38 minutes long. I think Kenny G could have lengthen it a bit. But these 2 complaints are minor. It's still an excellent holiday collection.\n\nOnce again, hats off to Kenny G!","torrent":{"xt":"urn:btih:b11db24540e6c90976e3d443bcb59cdc1cc11335","amp;dn":"Kenny+G+-+Wishes+-+A+Holiday+Album+-+Christmas+Jazz","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b11db24540e6c90976e3d443bcb59cdc1cc11335","infoHashBuffer":{"type":"Buffer","data":[177,29,178,69,64,230,201,9,118,227,212,67,188,181,156,220,28,193,19,53]},"announce":[],"urlList":[]}}