{"title":"Dead Can Dance - Into The Labyrinth (1993) 2008 MFSL-SACD-DFF","uid":11129798,"size":2764109787,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:b219311f4d82b62cecf8fa4cfceb625402f9dc42&amp;dn=Dead+Can+Dance+-+Into+The+Labyrinth+%281993%29+2008+MFSL-SACD-DFF&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"hal4000","files":-1,"time":1412023306,"description":"Dead Can Dance is an English-Australian musical project that formed in 1981 in Melbourne by Lisa Gerrard and Brendan Perry. The band relocated to London, England, in May 1982. Australian music historian Ian McFarlane described Dead Can Dance's style as &quot;constructed soundscapes of mesmerising grandeur and solemn beauty; African polyrhythms, Gaelic folk, Gregorian chant, Middle Eastern mantras and art rock.&quot;\n\nWith a regular American deal in place for the first time ever, thanks to 4AD's linkup with the WEA conglomerate, Dead Can Dance made a splash on commercial alternative radio with &quot;The Ubiquitous Mr. Lovegrove,&quot; the first single from Into the Labyrinth. Raga drones, a strange clattering beat, a haunting wind instrument, orchestral shading, and Perry's ever-grand voice make it one of the more unlikely things to be heard on the airwaves in a while. It all begins with yet another jaw-dropper from Gerrard, &quot;Yulunga (Spirit Dance),&quot; with keyboards and her octave-defying voice at such a deep, rich level that it sweeps all before it. Wordless as always but never without emotional heft, the song slowly slides into a slow but heavy percussion piece that sounds a bit like &quot;Bird&quot; from A Passage in Time, but with greater impact and memorability. As the album slowly unwinds over an hour's length, the two again create a series of often astounding numbers that sound like they should be millennia old, mixing and matching styles to create new fusions. Perhaps even more impressive is that everything was performed solely by Perry and Gerrard -- no outside guests here, and yet everything is as detailed, lush, and multifaceted as many of their past albums. New classics from the band appear almost track for track: Gerrard's a cappella work on &quot;The Wind That Shakes the Barley,&quot; the gentle beauty of &quot;Ariadne,&quot; the rhythmic drive and chants of the title song. The conclusion is a slightly surprising but quite successful cover -- &quot;How Fortunate the Man With None,&quot; an adaptation of a classic Bertolt Brecht tune about the turn of fortune's wheel. Given a restrained arrangement and Perry's singing, it brings Labyrinth to a satisfying end.\n\nDFF files extracted with Scarletbook\n    &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/10942620/Scarletbook-SACD-Extractor&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/10942620/Scarletbook-SACD-Extractor&lt;/a&gt;\n\nfrom the 2008 Mobile Fidelity Sound Lab SACD.\n\nSACD-ISO-DFF-1Bit-2.8Mhz.\n","torrent":{"xt":"urn:btih:b219311f4d82b62cecf8fa4cfceb625402f9dc42","amp;dn":"Dead+Can+Dance+-+Into+The+Labyrinth+%281993%29+2008+MFSL-SACD-DFF","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b219311f4d82b62cecf8fa4cfceb625402f9dc42","infoHashBuffer":{"type":"Buffer","data":[178,25,49,31,77,130,182,44,236,248,250,76,252,235,98,84,2,249,220,66]},"announce":[],"urlList":[]}}