{"title":"Once Upon A Time Season 1","uid":8033476,"size":7660527998,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:b23aec8d202c8aa42d3f03b573aab5b41318d7d4&amp;dn=Once+Upon+A+Time+Season+1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Amounet","files":-1,"time":1358470769,"description":"Note: Season Two will be uploaded as soon as I get the last few episodes :] ~Amounet\n\nStoryline\n\nEmma Swan gets the surprise of her life when Henry, the son she gave up 10 years ago, arrives on her doorstep. Returning the boy to his adoptive mother becomes complicated when Henry reveals a stunning theory to Emma. Everyone in Storybrooke, Maine is a fairytale character under a curse, and Emma - as the long lost daughter of Snow White and Prince Charming - is the one who can save them all. The story unfolds; interweaving scenes of the drama in the sleepy New England town and the inhabitants' past lives in the world of fairy tales. The timeless battle of good vs evil is ready to begin again. Written by L. Hamre \n\n\nEpisodes:\n\n1 \t&quot;Pilot&quot; \nDescription:\nBail bondsman Emma Swan is confronted by Henry, the child that was given up for closed adoption 10 years ago. He asks her to come to his home of Storybrooke with him and explains that the people there are fairy tale characters who don't remember who they are. The boy insists that his adoptive mother, Mayor Regina, doesn't love him, and that Emma has a destiny to fight in a final balance and help good win once and for all.\n\n\n2 \t&quot;The Thing You Love Most&quot;\nDescription:\nRegina tries to force Emma out of Storybrooke and out of her and Henry's lives permanently. Meanwhile, it is revealed how the Evil Queen released the curse upon the fairytale world.\n\n\n3 \t&quot;Snow Falls&quot;\nDescription:\nMary Margaret is astonished at the outcome after she reads to John Doe from the storybook while visiting him at the hospital. Back in fairytale world, Snow White and Prince Charming meet up for the first time.\n\n\n4 \t&quot;The Price of Gold&quot;\nDescription:\nEmma tries to aid a young pregnant woman who is escaping from Mr. Gold. Meanwhile, in the fairytale world, Cinderella regrets making a deal with Rumplestiltskin.\n\n\n5 \t&quot;That Still Small Voice&quot;\nDescription:\nAs Sheriff Graham chooses a new deputy for Storybrooke, a mysterious sinkhole appears at the edge of town and threatens to have dire consequences. Back in fairytale world, Jiminy Cricket must make a life-changing decision.\n\n\n6 \t&quot;The Shepherd&quot;\nDescription:\nWhile Emma discovers that Graham is lying, David Nolan must choose between his wife and Mary Margaret after he falls in love with the latter. Meanwhile, in the fairytale world Prince Charming confronts his destiny.\n\n\n7 \t&quot;The Heart Is a Lonely Hunter&quot;\nDescription:\nAfter kissing Emma, Sheriff Graham begins to remember his real life as the curse weakens. Meanwhile, in the fairytale world, the Queen attempts to find someone who will kill Snow for her.\n\n\n8 \t&quot;Desperate Souls&quot;\nDescription:\nRegina and Gold find themselves on opposite sides in Emma's attempt to run for Sheriff, but Emma soon discovers that the price of the election may be too great to pay. In the fairy tale world, a human Rumplestiltskin begins his quest to help his son by finding the power necessary to avoid war.\n\n\n9 \t&quot;True North&quot;\nDescription:\nEmma tries to find the birth father of two children to keep them from meeting the same fate she had as a child. In the fairy tale world, the Evil Queen uses Hansel and Gretel steal an artifact for her from a rival.\n\n\n10 \t&quot;7:15 A.M.&quot;\nDescription:\nEmma and Regina share a common suspicion over a newcomer to Storybrooke, while David and Mary Margaret try to cope with their feelings. Meanwhile, in the fairytale world, Prince Charming's wedding with King Midas' daughter approaches while Snow tries to cope with her feelings.\n\n\n11 \t&quot;Fruit of the Poisonous Tree&quot; \t\nDescription:\nWhile Sydney seeks out Emma's help against Regina, Mary Margaret and David continue their clandestine meetings. Meanwhile, in the fairytale world, Snow's father King Leopold receives three wishes from a Genie, who warns him to be careful what he wishes for.\n\n\n12 \t&quot;Skin Deep&quot;\nDescription:\nAs Valentine's Day arrives, Mary Margaret plans a night out with Ruby and Ashley. Meanwhile, Belle makes a deal and Gold plans vengeance on the thief who robbed him. \n\n\n13 \t&quot;What Happened to Frederick&quot;\nDescription:\nDavid promises Mary Margaret that he will tell Kathryn about his true feelings. In the fairytale world, Prince Charming offers to help Abigail while looking for Snow.\n\n\n14 \t&quot;Dreamy&quot;\nDescription:\nWhile Mary Margaret and Leroy rekindle an old and unremembered friendship during the Miners Day festival, Emma looks into the disappearance of Kathryn, David's wife. Meanwhile, in the fairy tale world Grumpy falls in love with a fairy.\n\n\n15 \t&quot;Red-Handed&quot;\nDescription:\nEmma hires Ruby to help her at the sheriff's office, and to give the woman a chance to determine what she's good at. Meanwhile, the sheriff questions David about his possible involvement in Kathryn's disappearance, while in the fairytale world, Red Riding Hood and her fellow villagers are trapped in their village by a bloodthirsty wolf.\n\n\n16 \t&quot;Heart of Darkness&quot;\nDescription:\nWhile Mary Margaret is arrested for the murder of Kathryn, in the fairy tale world James tries to stop Snow from killing Evil Queen Regina.\n\n\n17 \t&quot;Hat Trick&quot;\nDescription:\nEmma is kidnapped by a crazed man obsessed with hats. Meanwhile, the Evil Queen convinces a magic wielder to send her out of the fairy tale world and transport her to Wonderland so she can steal an artifact from the Queen of Hearts.\n\n\n18 \t&quot;The Stable Boy&quot;\nDescription:\nEmma continues to try and prove Mary Margaret's innocence in the murder of Kathryn Nolan. Meanwhile, in the fairytale world, Regina must choose between marrying for true love, or accepting her mother Cora's choice for her husband.\n\n\n19 \t&quot;The Return&quot;\nDescription:\nWhile Emma confronts Regina about Kathryn's disappearance, David tries to make amends to Mary Margaret and Mr. Gold tries to learn August's real identity. Meanwhile, in the fairytale world, Baelfire gets his transformed father to agree to return to his original self, untainted by magic.\n\n\n20 \t&quot;The Stranger&quot;\nDescription:\nWhile August offers to show Emma how she can defeat Regina and gain custody of Henry, Regina plans to seduce David. Meanwhile, in the fairytale world Gepetto agrees to save Snow and Charming's daughter, but seeks to save his son Pinocchio as well.\n\n\n21 \t&quot;An Apple Red as Blood&quot;\nDescription:\nWhile Regina schemes to get Emma out of Storybrooke for good, Henry begs Emma to stay. Meanwhile, in the fairytale world Snow calls upon her allies to save Prince Charming and defeat the Evil Queen.\n\n\n22 \t&quot;A Land Without Magic&quot;\nDescription:\nRegina and Emma share common cause when they try to find a cure for Henry. Meanwhile, in the fairytale world James tries to escape the Queen's dungeon and save Snow... unaware that he's too late.","torrent":{"xt":"urn:btih:b23aec8d202c8aa42d3f03b573aab5b41318d7d4","amp;dn":"Once+Upon+A+Time+Season+1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b23aec8d202c8aa42d3f03b573aab5b41318d7d4","infoHashBuffer":{"type":"Buffer","data":[178,58,236,141,32,44,138,164,45,63,3,181,115,170,181,180,19,24,215,212]},"announce":[],"urlList":[]}}