{"title":"Hellhounds on His Trail - The Robert Johnson Story(BBC R2)[roger","uid":5640127,"size":68062197,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:b2f3d96a0bff4abbda2811d8dd5bda7ea342e03b&amp;dn=Hellhounds+on+His+Trail+-+The+Robert+Johnson+Story%28BBC+R2%29%5Broger&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"rogercc","files":6,"time":1277065544,"description":"HELLHOUNDS ON HIS TRAIL -THE ROBERT JOHNSON STORY\nBBC Radio 2 May-June 2006\n6 Episodes of approx 30 mins each.\n\n\nIn a this  six part series, Paul Sexton explores the intriguing story of Robert Johnson - the music and myths.\nThey call the man 'The King of the Delta Blues'. Robert Johnson's colossal influence permeates the work of the Rolling Stones, Led Zeppelin, Cream, Bob Dylan and so many others in blues, rock and beyond. Listen to early Fleetwood Mac or to the monumental guitar playing of rock icons Eric Clapton, Keith Richards, the late Duane Allman and the Robert Johnson influence abounds. Yet, in a career that lasted less than a decade, this enigmatic legend left just 29 recorded songs. Eerie, hauntingly, they call to us from beyond the grave. \n\nThe life and times of Robert Johnson have been wrapped in a heady mix of mystery and mystique, controversy and conjecture. Born into poverty as the illegitimate son of a sharecropper's daughter, he was dead by the age of 27 and was buried in a pauper's grave, unmarked at the time. \n\nIn this six-part series, which, intriguingly, begins in London's Winchmore Hill, Paul Sexton follows the often obscure trail of Johnson through deepest Mississippi to the grave, where he stumbles on the 90th birthday party of Rosa Estridge, wife of the gravedigger and now the sole survivor of the handful who attended the interment. There, he settles at last the long-running debate over just where the bluesman who supposedly sold his soul to the devil at the crossroads, found his final lonely resting place. Or does he? - for there are several other sites that lay claim to the body, just as there are a number of possible crossroads . \n\nWe hear from blues veteran Honeyboy Edwards, who was there at the juke joint on the night Johnson downed that fateful bottle of spiked whisky, and from Carroll Seabrook Leatherman, the best-selling chronicler of life in the Deep South, on whose family cotton plantation Johnson was raised. We meet Johnson family members - 'kin folk' - friends and the lawyer who successfully fought for the inheritance of Johnson's illegitimate son, Claud. \n\nOther contributors include Robert Plant, Groundhog guitarist Tony McPhee, blues writer and archivist Michael Roach, Yardbird Chris Dreja, John Hammond, Kink Dave Davies, ex-Fleetwood Mac bassist Bob Brunning, Rob Love from the Alabama 3, Blues Band guitarist Dave Kelly, veteran blues producer Mike Vernon, Mike Davis from the San Antonio Blues Society and Professor Barry Lee Pearson from the University of Maryland.\n\n\nGeneral Information\nEncoder..............: LAME\nBitrate..............: 56 (CBR)\nHz...................: 24,000\nChannels.............: Stereo\nSource...............: internet radio\n\n","torrent":{"xt":"urn:btih:b2f3d96a0bff4abbda2811d8dd5bda7ea342e03b","amp;dn":"Hellhounds+on+His+Trail+-+The+Robert+Johnson+Story%28BBC+R2%29%5Broger","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b2f3d96a0bff4abbda2811d8dd5bda7ea342e03b","infoHashBuffer":{"type":"Buffer","data":[178,243,217,106,11,255,74,187,218,40,17,216,221,91,218,126,163,66,224,59]},"announce":[],"urlList":[]}}