{"title":"P.G. Wodehouse - Laughing Gas","uid":4326854,"size":275454484,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:b2f58a36c3f350ba6a02c062e86f0a4ff4a26904&amp;dn=P.G.+Wodehouse+-+Laughing+Gas&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"deandominic","files":10,"time":1217811427,"description":"General Information\n===================\n Title............: Laughing Gas\n Author...........: P.G. Wodehouse\n Read By..........: Simon Prebble          \n Genre............: Humor          \n Publisher........: Recorded Books; Unabridged edition (1995)\n\nOriginal Media Information\n==========================\n Media............: 7 CDs  \n Condition........: Very Good\n \nFile Information\n================\n Number of MP3s...: 7\n Total Duration...: 7 hours 54 minutes\n Total MP3 Size...: 260 MB\n Ripped by........: deandominic             \n Ripper...........: Exact Audio Copy                                 \n Encoder..........: LAME 3.98          \n Encoder Settings.: ABR 80 kbit/s 44100 Hz Mono          \n ID3 Tags.........: v1.1, v2.3 (includes embedded album art)\n\nBook Description\n================\n\nLaughing Gas is a comic novel by P.G. Wodehouse, first published in the United Kingdom on September 25, 1936 by Herbert Jenkins, London, and in the United States on December 4, 1936 by Doubleday Doran, New York. It is set in Hollywood in the early 1930s (the Depression is mentioned twice) and is a light-hearted and exclusively humorous look at the film industry and in particular at child stars.\n\n Reginald Swithin, the third Earl of Havershot (&quot;Reggie&quot;) is 28, unmarried, and has a face like a gorilla. As the new head of his family, he is assigned a delicate task by his Aunt Clara and by Plimsoll, the family lawyer: He is to go to Hollywood and look for Aunt Clara&amp;#039;s son, his cousin Eggy, who it seems has got himself into trouble over there, and bring him back home. In particular, Reggie is to prevent Eggy from getting engaged, let alone married, to some American gold-digger that would undoubtedly be far beneath the titled family.\n\nOn the train from Chicago to Los Angeles, Reggie meets the famous film actress April June, and immediately falls head over heels in love with her. Once in Hollywood, he completely forgets to look for Eggy until, one night, he bumps into him at a party April June is giving. What is more, Eggy is accompanied by Ann Bannister, Reggie&amp;#039;s ex-fiancÃƒÂ©e who is now engaged to Eggy. According to Eggy, Ann wants to reform him: make him drink less and get him a job as well. As the host of the party, the seemingly wonderful, tender and caring April June (&quot;Money and fame mean nothing to me, Lord Havershot&quot;) is difficult to get hold of. When he finally succeeds in doing so and is just about to propose to her, Reggie&amp;#039;s tooth -- in the nick of time, as it turns out later -- starts hurting so badly that he has to postpone all his plans, hurry home and make an appointment with a dentist.\n\nOn the following afternoon, he is in I.J. Zizzbaum&amp;#039;s waiting-room when he gets to know Joey Cooley, the 12 year-old movie star and darling of all American mothers. He is also going to have a tooth out; but Joey is going to be operated on by B.K. Burwash, Zizzbaum&amp;#039;s rival -- they have a common waiting-room --, exactly at the same time as Reggie. Presently reporters storm the dentist&amp;#039;s practice in order to take photos of the kid suffering from toothache and interview him.\n\nBoth Reggie and Joey get laughing gas as anaesthetic. When Reggie regains consciousness again he finds himself spoken to by B.K. Burwash, and also in the latter&amp;#039;s chair. He concludes that there has been a switch in the fourth dimension: Joey&amp;#039;s and his souls have changed bodies. Before he can clear up the situation, he is shoved into a car and brought &quot;home&quot;. Mayhem ensues...","torrent":{"xt":"urn:btih:b2f58a36c3f350ba6a02c062e86f0a4ff4a26904","amp;dn":"P.G.+Wodehouse+-+Laughing+Gas","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b2f58a36c3f350ba6a02c062e86f0a4ff4a26904","infoHashBuffer":{"type":"Buffer","data":[178,245,138,54,195,243,80,186,106,2,192,98,232,111,10,79,244,162,105,4]},"announce":[],"urlList":[]}}