{"title":"Roccos.Obsession.With.Teen.SuperSluts.3.XXX.DVDRiP.XviD-DivXfacT","uid":9566400,"size":1459989123,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:b3168c1e202b51a95f9ced615ab9e0fe6273261e&amp;dn=Roccos.Obsession.With.Teen.SuperSluts.3.XXX.DVDRiP.XviD-DivXfacT&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"xxxlavalxxx","files":4,"time":1391524025,"description":"Mr. Siffredi mixes the action between the sexy teens of the title and several older ladies to whom he likes to refer as &quot;extreme MILFs.&quot; They're not middle-aged porn stars, but elderly broads who will do absolutely anything, including help teach the young generation of Eurobabes how to please the big-dicked horndogs of Rocco's entourage.\nEszter portrays an elderly maid abused by Dr. Omar Galanti; sexy young redhead Marsha Lord plays Dr. Omar's assistant, helping him sexually dominate the older servant, and cute blondes Carla Cox and Nesty show up with young stud Jean Valjean. The teen hotties have a group sex session including lots of anal, a double penetration on Marsha, and a cocksucking demonstration by Eszter.\nIn the second scene, thin, pretty brunette Gina blows Kid Jamaica while she's wearing a police uniform. When covergirl Lauryn May joins in, boyfriend Steve Holmes and Mick Blue show up, royally pissed off at the situation. They get more than even, by double-fucking Lauryn in a wild group tangle that includes POV footage with spitting, fingering and buttfucking, then dump their cum into Lauryn's open mouth.\nNext, there's another anal marathon, with four girls and three guys in a big room which features a gynecological chair that gets put to perverse use. Little Kalie sucks Mike Angelo's dick and naughty old lady Lara helps out; pretty Cameron and Linda move the action to the living room, and a full-fledged interracial orgy ensues with some anal gaping.\nFinally, at an outdoor wedding, young Kira and Martina have a poolside fourway with black cocksmen Wesley Nike and Mike Chapman. It's generational warfare in every direction!\n\nNesty, Lara, Kalie, Lauryn May, Gina Bitch, Kira (General), Luba Love, Martina Snajder, Eszter, Cameron (F), Carla Cox, Linda, Marsha Lord, Kid Jamaica, Mick Blue, Mike Angelo, Jean Val Jean, Omar Galanti, Mike Chapman, Rocco Siffredi, Steve Holmes, Wesley Nike\n\n &lt;a href=&quot;\nhttp://imgdone.com/viewer.php?file=33230498764962815773.jpeg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgdone.com/viewer.php?file=33230498764962815773.jpeg&lt;/a&gt;\n    \t\n &lt;a href=&quot;\nhttp://imgdone.com/viewer.php?file=99322768835756936969.jpeg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgdone.com/viewer.php?file=99322768835756936969.jpeg&lt;/a&gt;\n    \t &lt;a href=&quot;\nhttp://imgdone.com/viewer.php?file=80362575659980953395.jpeg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgdone.com/viewer.php?file=80362575659980953395.jpeg&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:b3168c1e202b51a95f9ced615ab9e0fe6273261e","amp;dn":"Roccos.Obsession.With.Teen.SuperSluts.3.XXX.DVDRiP.XviD-DivXfacT","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b3168c1e202b51a95f9ced615ab9e0fe6273261e","infoHashBuffer":{"type":"Buffer","data":[179,22,140,30,32,43,81,169,95,156,237,97,90,185,224,254,98,115,38,30]},"announce":[],"urlList":[]}}