{"title":"Oxford Handbook Of Genitourinary Medicine, HIV, and AIDS (1st Ed","uid":7966661,"size":3554788,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b55357c795f463af5aebd72d1ccc33cea612524a&amp;dn=Oxford+Handbook+Of+Genitourinary+Medicine%2C+HIV%2C+and+AIDS+%281st+Ed&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"shafi3803","files":-1,"time":1356703783,"description":"Oxford Handbook of Genitourinary Medicine, HIV, and Sexual Health (Oxford Handbooks)\n\nGeneral Information\nPublication Date: November 19, 2010 \n ISBN-10: 019957166X \n ISBN-13: 978-0199571666 \n Edition: 2\n\nBook Description\nThe new edition of this successful handbook provides a balance of evidence-based information on Genitourinary Medicine (GUM), including HIV/AIDS. It provides high quality, digestible clinical detail and also practical information on the ever-increasing medico-legal, ethical, and procedural issues of growing importance when dealing with these complex topics. Designed primarily for the trainee in GUM, it is also a valuable reference and resource for the specialist physician, nurse, and other professionals working in the field of sexual health. The new edition remains relevant to those working in this field and features practical enhanced sections on contraception and genital dermatology written by specialist contributors, and information for general practitioners in order to provide services for STIs.\n\nThe book consists of three easy-to-follow sections. The first section deals with routine management within GUM; medico-legal and ethical issues, the standard patient, special situations, and routine clinical and laboratory processes that include simple flow chart guidance on common clinical presentations. The second section details GUM conditions in a disease-orientated style, including STIs and also other genitourinary problems that may present. The third section on HIV provides a contemporary epidemiological overview of this infection, basic viral biology and pathogenesis, a disease-orientated description of conditions both directly related and opportunistic, and their management and data on special situations such as pregnancy. Finally guidance on commonly used abbreviations is shown together with a useful resource directory for staff. \n\nIn essence this handbook provides a wealth of simple and easy to follow information on STIs and the principles of providing a service including administrative and medico-legal issues that are sometimes difficult to locate. This book will be of global use to all those with an interest in sexual health whatever their level of expertise and wherever they may practice.","torrent":{"xt":"urn:btih:b55357c795f463af5aebd72d1ccc33cea612524a","amp;dn":"Oxford+Handbook+Of+Genitourinary+Medicine%2C+HIV%2C+and+AIDS+%281st+Ed","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b55357c795f463af5aebd72d1ccc33cea612524a","infoHashBuffer":{"type":"Buffer","data":[181,83,87,199,149,244,99,175,90,235,215,45,28,204,51,206,166,18,82,74]},"announce":[],"urlList":[]}}