{"title":"JESSICA","uid":9927111,"size":1466768671,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:b697f867eb87c08387ba2bf2fd6daf01138c76ba&amp;dn=JESSICA+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ObiVan25","files":2,"time":1397076415,"description":"Title:JESSICA\nGenre:Drama\nRelease date:2004\nResolution:720X214\nVide codec:H264, MP4\nAudio codec:AAC ,audio chanel:stereo\nBitrate:128\nFrame rate: 25\nSubtitle:NOT PRESENT\n\nJessica is an Australian television miniseries based on the historical novel by Bryce Courtenay. Originally broadcast by Australia's Network Ten in 2004 and set in the Australian outback at the turn of the twentieth century, this family based drama follows a young woman who is unjustly institutionalised. Jessica won a 2005 Logie award for best mini-series or telemovie, plus two awards at the 2004 Chicago International Film Festival - one of them for the direction of Australian Peter Andrikidis.\n\nPlot:\nThe Bergman sisters could not be more different. Jessica (Leeanna Walsman) is a feisty tomboy who loves to help her father work their farmland. Her beautiful sister Meg (Megan Dorman) is eagerly being groomed by her mother Hester (Lisa Harrow) to be the perfect wife, so that she can marry her way out of poverty. However, when the man, Jack Thomas (Oliver Ackland), who Meg has set her sights on falls in love with Jessica and gets her pregnant, Hester schemes to wrench the couple apart to claim Jessica's son, Joey for Meg. Later she commits Jessica to a mental asylum. It is here that Jessica receives news of her lover's death and almost loses hope, but after enlisting the help of Mr. Runche (Sam Neill), a down and out lawyer battling alcoholism, she is eventually released.\nYears later, it is the reformed Runche who gives Jessica the courage to fight for the return of her child. Eventually Meg and Hester call an uneasy truce with Jessica, and allow her to play a role in Joey's life as his aunt. Jessica later dies from a snake bite and the film ends with Joey (aged 16) visiting Jessica's grave.\n\n\nThe movie is splited on 2 parts\n\nEnjoy and please seed after\n","torrent":{"xt":"urn:btih:b697f867eb87c08387ba2bf2fd6daf01138c76ba","amp;dn":"JESSICA+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b697f867eb87c08387ba2bf2fd6daf01138c76ba","infoHashBuffer":{"type":"Buffer","data":[182,151,248,103,235,135,192,131,135,186,43,242,253,109,175,1,19,140,118,186]},"announce":[],"urlList":[]}}