{"title":"Sunny (2011) DC BluRay 1080p 5.1CH x264 SmallAndHD","uid":10227137,"size":2276985820,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:b78a66755eb9c4c0deaf88eae082e2e53683e4f9&amp;dn=Sunny+%282011%29+DC+BluRay+1080p+5.1CH+x264+SmallAndHD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ganoolbt","files":1,"time":1401101422,"description":"aka Sseo-ni\nInfo: http://www.imdb.com/title/tt1937339/\nRelease Date: 4 May 2011 (South Korea)\nGenre: Drama\nStars: Ho-jeong Yu, Eun-kyung Shim, Hee-kyung Jin\nQuality: BluRay 1080p\nEncoder: SmallAndHD\nSource: Sunny.2011.DC.LIMITED.1080p.BluRay.x264-GiMCHi\nSize / Length: 2.1GB (135min)\nSubtitle: http://subscene.com/subtitles/sunny-sseo-ni\n\nSynopsis: New high-school transfer student Na-Mi comes from a small town in Jeolla Province to her new school in the capital city of Seoul. When she is nervous, her small town dialect comes out &amp; she starts to shake. On her first day at her new school she is bullied by others. Coming to her help is a group of girls. The girls are Choon-Hwa - known for her strong sense of loyalty &amp; excellent fighting skills, heavyset Jang-Mi - who badly wishes to have plastic surgery to get double eye-lids, Jin-Hee - excellent when it comes to spewing profanity, Geum-Ok - interested in literature, Bok-Hee - dreams of one day becoming Ms. Korea and Su-Ji - always arrogant. Na-Mi quickly becomes part of their group. When the group confronts rival girls known as Sonyeo Sidae (&quot;Girls Generation&quot;), Na-Mi spews curse words she picked up from her grandmother. Because of Na-Mi the girls are able to avoid a crisis. These seven girls then form their own group named &quot;Sunny&quot;. They also vow to stay together forever. The girls then prepare for a performance at an upcoming school festival, but on the day of their performance a terrible event occurs leading the girls to eventually going their own separate ways. Twenty five years later, Na-Mi is married to a successful businessman and has a beautiful daughter. Her life seems perfect from afar, but there's something lacking in her life. One day, Na-Mi bumps into high school friend Choon-Hwa in the hospital. They are ecstatic to see each other, but Na-Mi receives a phone call and has to leave. On her way out she ask Choon-Hwa if there is anything she can do for her. Choon-Hwa at first says no, but after a moment of reflection she makes a simple request to Na-Mi. Choon-Hwa asks Na-Mi to find the other members of &quot;Sunny,&quot; so she can see them one more time.","torrent":{"xt":"urn:btih:b78a66755eb9c4c0deaf88eae082e2e53683e4f9","amp;dn":"Sunny+%282011%29+DC+BluRay+1080p+5.1CH+x264+SmallAndHD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b78a66755eb9c4c0deaf88eae082e2e53683e4f9","infoHashBuffer":{"type":"Buffer","data":[183,138,102,117,94,185,196,192,222,175,136,234,224,130,226,229,54,131,228,249]},"announce":[],"urlList":[]}}