{"title":"A Cruz da Minha Vida (Come Back Little Sheba)","uid":4602305,"size":734482242,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:b7c2c9f5f7e9c38338306a43f66071f7f7616870&amp;dn=A+Cruz+da+Minha+Vida+%28Come+Back+Little+Sheba%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"andreasmonte","files":9,"time":1230287740,"description":"A movie version of the play by William Inge, COME BACK, LITTLE SHEBA is the story of &quot;Doc&quot; and &quot;Lola&quot; Delaney -- a sadly aging couple whose attention seems drawn undistractably to lost dreams and failed ambitions. A grim and cold recovering alcoholic, Doc seems only able to numb the pain of his black-and-white existence with drink. Lola, on the other hand, desperate for warmth and affection, still longs for the little lost dog named &quot;Sheba&quot; missing for nearly a year which had provided her so much companionship and joy. Into this mix comes Marie, a carefree young co-ed happily dabbling at love and romance. When she rents a room from the Delaneys, their home is suddenly inhabited with the ghosts of their own failings -- Doc's professional failings, Lola's failings as a wife and mother, and the shared failings of their marriage.\n\n\nBaseado na peÃƒÂ§a clÃƒÂ¡ssica de William Inge, A Cruz da Minha Vida ÃƒÂ© a comovente histÃƒÂ³ria de um casal cansado da vida que reencontra a esperanÃƒÂ§a nas ruÃƒÂ­nas do passado.\nShirley Booth, num papel que lhe valeu um Oscar da Academia, ÃƒÂ© Lola, a desmazelada dona-de-casa e esposa de Doc Delaney (Burt Lancaster), um alcoÃƒÂ³atra em recuperaÃƒÂ§ÃƒÂ£o. A vida dos Delaney ÃƒÂ© aborrecida e monÃƒÂ³tona, mas dÃƒÂ¡ uma dramÃƒÂ¡tica reviravolta quando o casal aceita uma encantadora hÃƒÂ³spede, Marie (Terry Moore).\nMarie torna-se a filha que os Delaney nunca tiveram. Mas quando arranja um namorado, Doc inicia uma espiral de ciÃƒÂºme que o leva a enfrentar de novo a tentaÃƒÂ§ÃƒÂ£o da bebida. Um filme inesquecÃƒÂ­vel que brilha com uma intensidade real e dramÃƒÂ¡tica, e que tambÃƒÂ©m mereceu uma nomeaÃƒÂ§ÃƒÂ£o para o Oscar de Melhor Montagem. \n\nSubtitles: Eng, Port","torrent":{"xt":"urn:btih:b7c2c9f5f7e9c38338306a43f66071f7f7616870","amp;dn":"A+Cruz+da+Minha+Vida+%28Come+Back+Little+Sheba%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b7c2c9f5f7e9c38338306a43f66071f7f7616870","infoHashBuffer":{"type":"Buffer","data":[183,194,201,245,247,233,195,131,56,48,106,67,246,96,113,247,247,97,104,112]},"announce":[],"urlList":[]}}