{"title":"Duck Soup (The Marx Brothers)ENG_SPA_ITA_GER_FRE","uid":3899848,"size":4413468719,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:b9f5f7b0f4de009235b39b1274d4ae72809eeea3&amp;dn=Duck+Soup+%28The+Marx+Brothers%29ENG_SPA_ITA_GER_FRE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"silvia-","files":15,"time":1195501321,"description":"DUCK SOUP (The Marx Brothers)\n\n[img]http://www.gorila.sk/i/imgs_orig/835/8835.jpg[/img]\n\nYear: 1933\nDirector Leo McCarey \nCast Groucho Marx, Harpo Marx, Chico Marx, Zeppo Marx, Margaret Dumont, Raquel Torres, Louis Calhern, Edmund Breese, Leonid Kinskey \nLength 65 min \nVideo Pal\nWidescreen , 4:3 \nLanguages Dolby Digital 2.0: English, German, French, Italian, Spanish \nSubtitles English, French, Italian, Spanish, German, Arabic, Danish, Finnish, Greek, Hebrew, Norwegian, Portuguese, Russian, Swedish, Turkish, Dutch \n\nSynopsis\n\nIn this 1933 Marx Brothers film, the mythical country of Freedonia is broke and on the verge of revolution. Mrs. Teasdale (Margaret Dumont), Freedonia&amp;#039;s principal benefactress, will lend the country 20 million dollars if the president withdraws and places the government in the hands of the &quot;fearless, progressive&quot; Rufus T. Firefly (Groucho Marx). At his inauguration, Firefly shows up late, insults everyone in sight, and sings a song about how he intends to abuse his power. Naturally, the crowd cheers wildly. Meanwhile, Ambassador Trentino (Louis Calhern) of neighboring Sylvania schemes to oust Firefly and take over Freedonia himself. To gather enough evidence to discredit Firefly, he sends his most trusted spies, Chicolini (Chico Marx) and Pinky (Harpo Marx). Five minutes after they show up in Freedonia, both spies become important members of Firefly&amp;#039;s cabinet, though Chicolini keeps his day job as a peanut vendor. Firefly eventually declares war on Sylvania, an absurd farrago with Firefly changing uniforms from scene to scene, Chicolini going to the other side because the food is better, and Pinky parading around the battlefield with a sandwich board reading &quot;Join the army and see the navy.&quot;\n\nOther features\nInteractive Menus, Scene Access, Black And White Film","torrent":{"xt":"urn:btih:b9f5f7b0f4de009235b39b1274d4ae72809eeea3","amp;dn":"Duck+Soup+%28The+Marx+Brothers%29ENG_SPA_ITA_GER_FRE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b9f5f7b0f4de009235b39b1274d4ae72809eeea3","infoHashBuffer":{"type":"Buffer","data":[185,245,247,176,244,222,0,146,53,179,155,18,116,212,174,114,128,158,238,163]},"announce":[],"urlList":[]}}