{"title":"Hannibal - Thomas Harris-VINY","uid":6401985,"size":1122192,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:bb43d73b7e96a809a2bc1694b0c276a5f815eacf&amp;dn=Hannibal+-+Thomas+Harris-VINY&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"daemonx0x","files":-1,"time":1305705983,"description":"Hannibal - Thomas Harris-VINY\n\n\nHannibal. Dr Hannibal Lecter. &quot;A brief silence follows the name, always, in any civilized gathering,&quot; wrote Thomas Harris at the beginning of his stunning The Silence of the Lambs in 1988. You don't want him in your head, you don't want you in his head. Now, a decade later, Lecter is back--ready to take up his place as one of the cult figures of contemporary fiction. Almost a modern myth, in fact, if the scale, and thrill, of the publication of Hannibal is anything to go by. Harris's book is &quot;news&quot;: not only &quot;book news&quot; but &quot;real&quot; news, one of the biggest publishing events of the decade in terms of print run (one million copies worldwide), film rights (Hollywood has paid six million dollars for the book: Anthony Hopkins and Julianne Moore will star) and cultural cachet.\n\nThe serial killer--like his counterpart, the psychologist-profiler--is a figure for our times; &quot;In the contemporary mind,&quot; as one psychoanalyst, Christopher Bollas, has put it, &quot;the serial killer is the statement of evil&quot;. Psychiatrist and killer, Lecter gives a peculiar twist to that evil (and Harris has always been interested in the precarious division between killer and cure). In Red Dragon, published in 1981, Will Graham was one of the first of the fictional profilers thinking and feeling his way into the minds of the killers he pursued. Behind bars, Lecter was a charged, but compelling, presence--an enigma who promised to be a key to psychopathic crime if only someone were genius enough to understand him. Jack Crawford tried, and then Clarice Starling. Now, as if in response to those who wanted to know more, comes Hannibal, a novel which constantly threatens to bring Lecter to life through its (sometimes grisly) pages. &quot;Dr. Hannibal Lecter's fingerprint card is a curiosity and something of a cult object&quot;: Harris is the one who knows, who has &quot;been there&quot;, and takes his readers into Lecter's world of curious courtesy and exquisite taste, sickening cruelty and loving murder. Both Red Dragon and The Silence of the Lambs were masterpieces of plot and suspense; though complex and plotted, this is rather more &quot;Hannibal's book&quot;: no-one who wants to know, and suffer with, Lecter--his past victims, his past life, his strange feelings for Starling--can miss this brilliant piece of mythmaking.","torrent":{"xt":"urn:btih:bb43d73b7e96a809a2bc1694b0c276a5f815eacf","amp;dn":"Hannibal+-+Thomas+Harris-VINY","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bb43d73b7e96a809a2bc1694b0c276a5f815eacf","infoHashBuffer":{"type":"Buffer","data":[187,67,215,59,126,150,168,9,162,188,22,148,176,194,118,165,248,21,234,207]},"announce":[],"urlList":[]}}