{"title":"VA-House For Life 2010 (2009)-[oalbums.com]","uid":5242304,"size":1040370872,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:bbbeaf14459de464d0858898407ba073d859c4d9&amp;dn=VA-House+For+Life+2010+%282009%29-%5Boalbums.com%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"klein155","files":78,"time":1261827847,"description":" VA-House For Life 2010 (2009)\n\n\nTitulo: House For Life 2010 \nCalidad: Mp3 | 320 kbps \nTracks: 77 \nTamaÃƒÂ±o: 992Mb \nGenre: House, Electro House\n\nTrack\n1. Crazy P - Love On The Line (Funkagenda Reprise)\n2. Lello Mascolo feat. Danny - Favelas Beat (Franco Lippi Remix)\n3. DJ Antoine ft. Chista Rigozzi - This Time (Romario Farinas Edit)\n4. Deadmau5 and Tony Awake - Strobe Wanted (Airplay47 and Jason Mill MashUP)\n5. The Golden Boys - Out Of The Nation (The Loose Cannons Remix)\n6. Ester Dean feat. Chris Brown - Drop It Low (Spin Sista Club Mix)\n7. Deep Active Sound feat. Cotry - Sunrise (Mrak and Koba Remix)\n8. Jordan Evane - Need Love (Cold N What Remix)\n9. Adrian Bahil, Carlos Mendes - El Gitano (Peter Brown Remix)\n10. Niels Van Gogh, Yvan, Dan Daniel - Take Me Back (Yvan, Dan Daniel Club Mix)\n11. Jaimy and Kenny D - Keep On Touchin (Erick Morillo Edit)\n12. Spencer And Hill - Cool (Jack Styles Remix)\n13. Noob Brodinski - Peanuts Club (Savoy J Flash Remix)\n14. Big World - Gadzo (Oscar G. Tropicasa Mix)\n15. Axwell - Watch The Sunrise 2010 (eSQUIRE Remix)\n16. Menini and Viani - Rock n Roll (Criminal Vibes Extended Mix)\n17. George Acosta - Something About You (Acosta and Cueto Mix)\n18. Lisa Pure - Cant Say No (Tommyboy Vocal Remix)\n19. Scotty God is A DJ 2009 (Insomnia Booty Mix)\n20. Stress feat Jaba - Vers La Lumiere (Remady Remix)\n21. John Shepard feat DHT - Listen To Your Heart (Club Vocal Mix)\n22. Kev and Lex - The Night Is Young (Cute Poison and Sound Players 2010 Remix)\n23. Stanley Ross - Schmutzige Musik (Rino Cabrera Get Dirty Remix)\n24. Brown Sugar, Niko De Luka, Terri B. - Keep On Knocking (Nino Anthony's Tribalism Mix)\n25. Foamo - Movin it over here (Hey Now remix)\n26. Lypocodium and Helen Brown feat. Linda Lugnet - Here I Go (Pieter Stavorra Remix)\n27. Chris Nasty - Dedicated To The People ( Nastty Goes To Eivissa Mix)\n28. Michelangelo - Sky (Van Date and Dirty Bass Project Remix)\n29. Pitbull - I Know You Want Rio De Janeiro (Infis Booty 09)\n30. Juan Kidd Vs Lee Cabrea and Thomas Gold - Now You're Shakin It (Denzal Park Bootleg)\n31. Dirty Midget - Sitting On The Toilet (Electro Club Mix)\n32. Sash - Move Mania (Morel and Bristol Da Boom Mix)\n33. Endaxi - It's Not Over (Henri Leo Theisen Houseboy Radio Edit)\n34. Schuhmacher and Vanerra (feat. freda) - Maybe (Glamour Mix)\n35. DJ Smash feat. Arturich - Uletai (New Club Version 2009)\n36. Funk D - Ah Yeah (Chaosz Remix)\n37. Pulsedriver - Superstar (Djs form Mars Remix)\n38. Chuckie - Let the Bass Kick ( Djmc RMX 2010 Benny Benassi)\n39. Rank 1 L E D - There Be Light (Alex Chief Remix)\n40. Christopher S and Fannie Luescher - Help Me! (Streamrocker Remix)\n41. Greg Stainer - Come With Me feat. Spin (Jay Santi Remix)\n42. BT feat. Dave Darell - Suddenly (Double Deejays Full Edit)\n43. Groovebusterz - Talk To Me 2009 (Sopot Choir Version)\n44. Julio Navas and David Amo Heart Beat (Abel Ramos Oslo With Love Remix)\n45. D and J presents Charles Simmons - Show No Mercy (Envy Remix)\n46. Bjorn Berglund feat Robert Manos - On Me (Tony Senghore's Jamais Vu Remix)\n47. Mr. Pink and Max Robbers - Pink Passion (Max Robbers Mix)\n48. Mendo - Do It (George Morels Re Edit)\n49. Byron Stingily - Real Man (the Jinks Remix Radio Edit)\n50. Masters Of South Ft. Cliff Randall - Only The Dark (R-Max Remix 4 Paulin)\n51. Inaya Day - Nasty Girl (Peter Rauhofer Reconstruction Mix)\n52. Bass Blasterz - California Dreaming 2k10 (Original Club Mix)\n53. Paul Deighton - Can't stop 'em (Mark Webb Remix)\n54. Darius and Finaly - Do It All Night (Dj A. Morozov Remix)\n55. Moguai - The Trip (Moguai S Shore Club Penthouse Mix)\n56. The Snipplers - All Around ( Supabeatz Remix)\n57. Space Cowboy feat. Paradiso Girls, Far East Movement, Cinema Bizarre and Cherry Cherry Boom Boom - I Came 2 Party (Jump Smokers Remix)\n58. EasyTech - I'm The Sexy Girl (Dj Zaku and Dj Smok 2009 Remix)\n59. DJ Crapman - Uhh la la la (Discofreakz 2010 Remix)\n60. Deadmau5 - Strobe (Plump DJs Remix)\n61. Sitting On A Toilet ( Electro Club MIx )\n62. Harlem Hustlers ft. Linda Lee Hopkins - All About The Paper (Rivaz Club Remix)\n63. Sonido - Miss California (Doc Phatt's Made in Holland Remix)\n64. Incartey Pres. David Guetta - Sexy Bitch (Dj Feed Back Creazy Remix)\n65. DJ Antoine - Don't You Hide (Original Radio Edit by Romario Farinas)\n66. Laidback Luke - My G.O.D. is Walking On a Dream(Fiesta Electronica Bootleg)\n67. The Guesta Project - Love is in the Air (Muthagroove Mix)\n68. Starchaser - The Happiest Man (Plastic Beats And Alex Oskin Remix)\n69. The One Hundred - Break Me Down (Bellatrax Remix)\n70. Paul Gardner, Hugh Gunnell - Come Get My Lovin' feat. Marcella Woods (Mish Mash Mix)\n71. Benassi Bros feat. Sandy - Get Better (Sfact Reloaded Version)\n72. Ksky - Spells feat. Jake Childs (Dj Slider Remix)\n73. Joshy Rotten - Catch You (Electro Mix)\n74. Dany Sweet - Piano Spammer (Mr Lopez Db Club Mix)\n75. Sherrita - I Will Survive 2k9 (US GLobal Deejays Electro Mix)\n76. Melleefresh And Cyber Sutra - White Trashy And Blonde (Mellefreesh Vs Deadmau5 Vs Spydabrown Vs Cyber Sutra Mashup)\n77. Marco Van Bassken - Wire to Wire (Alex Davey Remix)","torrent":{"xt":"urn:btih:bbbeaf14459de464d0858898407ba073d859c4d9","amp;dn":"VA-House+For+Life+2010+%282009%29-%5Boalbums.com%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bbbeaf14459de464d0858898407ba073d859c4d9","infoHashBuffer":{"type":"Buffer","data":[187,190,175,20,69,157,228,100,208,133,136,152,64,123,160,115,216,89,196,217]},"announce":[],"urlList":[]}}