{"title":"Smelling Of Roses - S01 to 04 - Audio Comedy - MP3 - Slimoo","uid":5550789,"size":642408879,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:bc0902cf3c77eaeeef14604938cc9cce4b2d4010&amp;dn=Smelling+Of+Roses+-+S01+to+04+-+Audio+Comedy+-+MP3+-+Slimoo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"_Slimoo_","files":24,"time":1273536660,"description":"Smelling Of Roses - Series 01 to 04 - Audio Comedy - BBC Radio 7 \n24 x 30 Minute Episodes - 128Kbps - Mp3 - Slimoo\n\n\nSmelling of Roses was a BBC Radio 4 comedy series starring Prunella Scales and written by Simon Brett. There were four series, each of six episodes, broadcast from 2000 to 2003. Scales stars as Rosie Burns, manager of her own event management business in Brighton, &quot;In Any Event&quot;. The series also stars Arabella Weir as Rosie's daughter Kate, Rebecca Callard as Kate's daughter Jo, Duncan Preston as Bob, the company accountant, harbouring unrequited passion for Rosie, and Annette Badland as Tess, the remaining member of staff, whose love life with her (unheard) partner Kevin is a recurring topic. Typically of Brett, intergenerational female relationships were the unifying theme of the series: Kate has just returned to England after a long spell working abroad during which she has left her daughter to be brought up by Rosie. The format of the show allowed different, and usually difficult, clients to appear in each episode.\n\n &lt;a href=&quot;\nhttp://www.radiolistings.co.uk/programmes/smelling_of_roses.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.radiolistings.co.uk/programmes/smelling_of_roses.html&lt;/a&gt;\n\n\nCast:\nPrunella Scales\nArabella Weir\nRebecca Callard\nDuncan Preston\nAnnette Badland\nMichael Fenton Stevens\nStephen Thorne.\n\nWritten by Simon Brett\n\n\nSmelling Of Roses - S01 - E01 - Wise After The Event \nSmelling Of Roses - S01 - E02 - Out To Launch \nSmelling Of Roses - S01 - E03 - Positive Thinking \nSmelling Of Roses - S01 - E04 - Sleeping Partners \nSmelling Of Roses - S01 - E05 - Survival Of The Fittest \nSmelling Of Roses - S01 - E06 - A Good Cause \n\nSmelling Of Roses - S02 - E01 - Romance Is Dead \nSmelling Of Roses - S02 - E02 - French Connections \nSmelling Of Roses - S02 - E03 - The Comeback Kid \nSmelling Of Roses - S02 - E04 - Trade Secrets \nSmelling Of Roses - S02 - E05 - Bill Of Fare \nSmelling Of Roses - S02 - E06 - Party Party \n\nSmelling Of Roses - S03 - E01 - Private Views \nSmelling Of Roses - S03 - E02 - Promises, Promises \nSmelling Of Roses - S03 - E03 - A Closed Book \nSmelling Of Roses - S03 - E04 - Leading A Merry Dance \nSmelling Of Roses - S03 - E05 - A Cheeky Little Number \nSmelling Of Roses - S03 - E06 - The Queen Of Song \n\nSmelling Of Roses - S04 - E01 - A Supporting Role \nSmelling Of Roses - S04 - E02 - Verse Dramas \nSmelling Of Roses - S04 - E03 - Sustainable Development \nSmelling Of Roses - S04 - E04 - Talking To One Person \nSmelling Of Roses - S04 - E05 - Going Back To One's Roots \nSmelling Of Roses - S04 - E06 - The Comfort Man \n\n\n\n\nAudio Format : MP3\nDuration : 28mn 1s\nBit rate mode : Constant\nBit rate : 128 Kbps\nChannel(s) : 2 channels\nSampling rate : 44.1 KHz\nResolution : 16 bits\n\n\n\n[b]\nA number of people are posting my torrents on other trackers.\nI have no problem with that - (Not much need as I already do this) - But a name check would be nice\nI was the one who spent weeks,months,years recording them.\n\nThere is little point in downloading a &quot;Torrent&quot; and then recreating a &quot;Torrent&quot; using the same files.\n\nThe fact there was a torrent for you to download is clear you don't need to use the files to make another exactly the same version,\n\nAll you will do is split seeders over 2 torrents with the &quot;same&quot; files and make both have less seeders.\n\n\n\n[/b]\n","torrent":{"xt":"urn:btih:bc0902cf3c77eaeeef14604938cc9cce4b2d4010","amp;dn":"Smelling+Of+Roses+-+S01+to+04+-+Audio+Comedy+-+MP3+-+Slimoo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bc0902cf3c77eaeeef14604938cc9cce4b2d4010","infoHashBuffer":{"type":"Buffer","data":[188,9,2,207,60,119,234,238,239,20,96,73,56,204,156,206,75,45,64,16]},"announce":[],"urlList":[]}}