{"title":"Descent 3","uid":3917255,"size":1606641978,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:bc5ee5a482bb47957ce7b410032e4a4a4f25572a&amp;dn=Descent+3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"SubGate","files":9,"time":1196550644,"description":"Descent is a 3D first-person shooter video game which spawned two direct sequels (Descent II and DescentÃƒ?Ã‚Â³). The Descent name was also used for an unrelated space simulator released by Volition, Inc. called Descent: FreeSpace due to trademark issues.[1] Descent was developed by Parallax Software and released in 1995. Although unsophisticated by modern gaming standards, it is still cherished by a strong community of fans, particularly for online multiplayer, and new levels continue to be developed.\n\nThe series has a strong following due to its unique \\&quot;six degrees of freedom\\&quot; gameplay. However, because this gameplay can be challenging and strongly favors the use of a joystick, Descent never gained the popularity of more conventional ground-based 3D first-person shooter games.\n\nCompared to other 3D shooter games, Descent never became particularly popular; probably due to its increased demand to the player\\&amp;#039;s ability to keep his orientation in a fully 3D environment with a 6dof flight model. Also learning to effectively exploit (tri-) chording - increasing movement speed by simultaneously pressing the acceleration controls for several movement directions - steepened the learning curve. The challenge this poses attracted and still attracts players even 10 years after the first game of the franchise appeared.","torrent":{"xt":"urn:btih:bc5ee5a482bb47957ce7b410032e4a4a4f25572a","amp;dn":"Descent+3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bc5ee5a482bb47957ce7b410032e4a4a4f25572a","infoHashBuffer":{"type":"Buffer","data":[188,94,229,164,130,187,71,149,124,231,180,16,3,46,74,74,79,37,87,42]},"announce":[],"urlList":[]}}