{"title":"Windows 98 Second Edition ISO inc.Key","uid":4960962,"size":728183591,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:bc6e040d2b1b8338e0128a6341e8ca4235def949&amp;dn=Windows+98+Second+Edition+ISO+inc.Key&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"16spendl","files":-1,"time":1245307240,"description":"Windows 98 Second Edition ISO inc.Key\n\n\nSerial:\n\nC4GMB - B23QQ - QPRCH - QX2C8 - 9CJVW\n\n-----------------------------Review-----------------------------------------------\n\n\nLet me get one thing clear straight away, Windows 98 Second Edition is really just a whole load of bug fixes and code enhancements. If you are thinking of buying Windows 98 SE believing that you will get a number of new features not seen in plain old Windows 98 then you will clearly be disappointed.\nWell What Is There To Make Me Upgrade?\nWindows 98 Second Edition includes the latest Year 2000 patches, every other patch that has been released since Windows 98 first shipped (There are a lot of them), A new version of Internet Explorer 5.0, and new versions of several Microsoft services or applications, including NetMeeting, DirectX 6.1, ACPI, 1394, USB, WebTV, VPN services, and standard Windows fonts (that contain the Euro currency symbol). It also adds support for Device Bay and Windows Driver Model modems. The only completely new feature is the Internet Connection Sharing (ICS), which automatically assigns IP addresses to networked Windows computers and lets them share a single Internet connection.\nWon't Most Of These Features Be Available In A Service Pack?\nMicrosoft has announced recently that there will indeed be a Service Pack 1 release for the original Windows 98. It will, as expected, only include basic bug fixes and none of the new drivers and extra &quot;features&quot; included in Windows 98 Second Edition.\nOther bits and pieces such as DirectX 6.1, NetMeeting 3 and Internet Explorer 5 are all available to download off of the Internet, although they do tend to run faster and better when installed directly via Windows 98 Second Edition.\nThe Service Pack 1 release for Windows 98 should appear on the Windows Update site a few weeks after the official public release of Windows 98 Second Edition has hit stores.\nSetup And First Impressions\nI installed Windows 98 Second Edition the full version off of the CD directly over a well-used Windows 98 Gold system. The system had many programs on it and also included Internet Explorer 5a that was recently released, I felt that this setup would put Windows 98 Second Edition though its paces.\nWindows 98 Second Edition installed with no problems at all, it upgraded my Internet Explorer 5 version (I'd still recommend that you uninstall Internet Explorer 5 before installed Win 98 SE just in case) to the new one that comes with the OS. The first thing I noticed (After I deleted the annoying MSN Setup Icon that appeared on my desktop) was that there is a lot more support for various bits of hardware (SoundBlaster Live!, DVD Hardware) but from a first look, very little had changed. The only noticeable mention of it being Windows 98 Second Edition is when you go into the System properties via the Control Panel and it shows the name and the version number (2222 A).\nWhilst browsing around my new OS I did notice that Internet Explorer 5 seems to add a bit more speed to browsing around various folders and settings pages such as Control Panel, this is as expected as Internet Explorer 5 replaces Windows 98's IE4.\nNext on my list of tasks was to test out all of my programs I had installed on my drive...Here is a list of each program and how they all faired.\nAs you can probably tell, everything apart from those two EA Sports games worked first time, which was a major plus point for upgrading an operating system. Next up I checked up on the clock settings for my PC (They used to get messed up sometimes when upgrading) and I noticed that Microsoft has finally combined the Date &amp; Time bits into one tab.\nInternet Explorer 5 And The Rest\nAlthough not a major new feature, I was still pleased with it. For those of you who have not had the opportunity to use Internet Explorer 5, you will notice a number of new features such as FTP support, greater control over favorites, improved autocomplete and a new and improved Outlook Express, although the bug with large newsgroups still hasn't been fixed, which is a real pain as it sounds like it is destroying my hard drive half the time I use it.\nNetMeeting 3 makes big changes over previous versions. It now includes a new interface and is a little bit easier to use for new users. Sound and Video is also improved over the last release, with very little slow down when connected via the internet or a network. The only thing I would I have liked to have seen done better are the directories, which are very hard to search through. I am wondering though what version will be released to the public as a new beta has only just been released and that was on May 12th (Win 98 SE went gold May 5th)\nDirectX 6.1 is also a big improvement over DirectX 5 that shipped with Windows 98 with far better Direct3D support. ICS provides what turns out to be a basic personal proxy service. It allows a computer with fast network access--such as T1, cable modem, leased line, asynchronous digital subscriber line (ADSL) or ISDN--to share that access with other computers on a small-office or home network. It is also the only really new feature.\nAny Outstanding Bugs?\nThe majority of bugs that were in Windows 98 Gold have finally been put to rest, but that doesn't mean that Windows 98 Second Edition is bug free. Any upgrade of an operating system is likely to have some problems crop up no matter how small. I have personally noticed one problem so far which is far less than the original Windows 98 had.\nThose of you with USB devices will be very pleased to hear that Windows 98 Second Edition has far, far better support for devices, and Microsoft have fixed the annoying restart in MS-DOS error that cropped up when USB devices were plugged into your PC.\n\nFinal Comments\nHow It Grades\nInstallation: A-\nInterface: B\nEase Of Use: B+\nHardware Support: B+\nCost: B+\nOverall: B+\n\nFrom a personal view, I can't see any problem in paying nothing for this upgrade for Windows 98 users (because you are downloading a torrent) , nor can I see any problem for those users who might upgrade from 3.1 or 95.\n","torrent":{"xt":"urn:btih:bc6e040d2b1b8338e0128a6341e8ca4235def949","amp;dn":"Windows+98+Second+Edition+ISO+inc.Key","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bc6e040d2b1b8338e0128a6341e8ca4235def949","infoHashBuffer":{"type":"Buffer","data":[188,110,4,13,43,27,131,56,224,18,138,99,65,232,202,66,53,222,249,73]},"announce":[],"urlList":[]}}