{"title":"ExploitedCollegeGirls: Sarah [XXX] x264 ","uid":12159423,"size":639325911,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:bca8d06da09060e3165b4023470ebf0f555a5bf6&amp;dn=+ExploitedCollegeGirls%3A+Sarah+%5BXXX%5D+x264+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Chinu685","files":1,"time":1437851278,"description":"Category: Anal, All Sex, Toys, Anal Creampie\n\n\nCast: Sarah (Zarena Summers)\n\n\n.:Description:.\nGentlemen, this is how a teen anal queen looks like. 19 year old Sarah really surprised everyone. Brace yourself for one intense assfucking session. There's more teen anal sex going on in this video than in some other sites' entire members area. And it all started so tame...\nIt's hard to describe everything in just a few sentences here but I'll try. We watch Jay pick up Sarah from the airport, cute real amateur first timer from Mississippi. Really shy, not super bright, but sweet and willing to give this a go. Sexy southern drawl. She doesn't want to disclose exactly where she's from but it slips out later anyway. And then she drops a bomb: Sarah got fucked in the ass before she even lost her virginity. And as it turns out, this is still how she prefers to cum to this day. With a cock in her ass. Read on.\nJay talks Sarah into giving him roadhead, which is surprisingly easy because she's blown her boyfriend in the car before. So nothing really new here for her. What is new is when Jay dares her to fuck him in the parking lot. After some back and forth, she agrees. As she's riding his dick in the car, Sarah confesses that she can cum better with a cock in her ass. Jay is more than happy to help her out, so he switches to the passenger seat to allow for more room. Sarah gets on top of him and he glides his cock into her waiting asshole. Pain! Sarah says his big cock will take some time for her ass to get used to. After a bit of managed breathing and relaxing, Sarah leans back and lets Jay fuck her in the ass as he wishes. Her pussy creams up when she orgasms, and she says she can't wait to have him do that to her again in the hotel room...\nAnd that's how it continues - it's one massive anal fest today. Jay doesn't even bother with Sarah's cookie anymore, it's all about the teenage ass from now on. Sarah orgasms multiple times throughout, first when Jay uses the double-headed dildo on her (pussy and ass), and then several times as he fucks her ass again and again and again. You'll love her facial expressions and involuntary body movements when she cums. Lots of picture-in-picture action so you don't miss a thing. It's so bizarre and hot to watch our girl next door get off on getting assfucked. And hard, too. Watch the &quot;doggy&quot; segment. Or the part where Jay pins her down and fucks her ass lying on top of her - until he gives her an anal creampie, which she totally wanted him to do. Crazy. You just don't expect this from her. I mean just look at this little Southern angel! Ha! Today's video is an absolute MUST HAVE for all anal lovers. Right-click the video download link, and select &quot;Save Link As&quot; right now. Best move you make all week. - Steve\nTake a look at screenshots! Enjoy!\n &lt;a href=&quot;\nhttp://teenimage.org/img-55b3c2cf99082.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://teenimage.org/img-55b3c2cf99082.html&lt;/a&gt;\n &lt;a href=&quot;\nhttp://teenimage.org/img-55b3c2d630f39.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://teenimage.org/img-55b3c2d630f39.html&lt;/a&gt;\n\n\n\n\n.:Download more Stuff :):.             &lt;a href=&quot;\nhttps://thepiratebay.vg/user/Chinu685/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://thepiratebay.vg/user/Chinu685/&lt;/a&gt;","torrent":{"xt":"urn:btih:bca8d06da09060e3165b4023470ebf0f555a5bf6","amp;dn":"+ExploitedCollegeGirls%3A+Sarah+%5BXXX%5D+x264+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bca8d06da09060e3165b4023470ebf0f555a5bf6","infoHashBuffer":{"type":"Buffer","data":[188,168,208,109,160,144,96,227,22,91,64,35,71,14,191,15,85,90,91,246]},"announce":[],"urlList":[]}}