{"title":"Rise Against  - The Black Market 320k  mp3  ak2014","uid":10521795,"size":111658964,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:bcf96fb9afef04212b5e4b2b02c5a216663dd5f2&amp;dn=Rise+Against++-+The+Black+Market+320k++mp3++ak2014&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"analogkid6103","files":16,"time":1404991894,"description":"Rise Against  - The Black Market 320k  mp3  ak2014 What we got....Rise Against is an American punk rock band from Chicago, Illinois, formed in summer 1999. The band currently consists of Tim McIlrath (lead vocals, rhythm guitar), Zach Blair (lead guitar, backing vocals), Joe Principe (bass guitar, backing vocals) and Brandon Barnes (drums, percussion).\n\nRise Against spent its first five years signed to the independent record label Fat Wreck Chords, on which it released two studio albums, The Unraveling (2001) and Revolutions per Minute (2003). Both the albums met with considerable underground success, and in 2003 the band signed with the major label Geffen. Their major label debut Siren Song of the Counter Culture brought the band mainstream success, producing several successful singles. Their next two albums, The Sufferer &amp; the Witness and Appeal to Reason, were also successful and peaked at number ten and number three on the Billboard 200 chart, respectively. Appeal to Reason was followed three years later by Endgame. All four albums released via Geffen were certified platinum in Canada, while Siren Song of the Counter Culture, The Sufferer &amp; the Witness and Appeal to Reason were certified gold in the United States.\n\nRise Against is also known for their advocacy of progressive organizations such as Amnesty International and It Gets Better Project. The band actively promotes animal rights and most members are straight edge (excluding Barnes), PETA supporters, and vegetarian.","torrent":{"xt":"urn:btih:bcf96fb9afef04212b5e4b2b02c5a216663dd5f2","amp;dn":"Rise+Against++-+The+Black+Market+320k++mp3++ak2014","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bcf96fb9afef04212b5e4b2b02c5a216663dd5f2","infoHashBuffer":{"type":"Buffer","data":[188,249,111,185,175,239,4,33,43,94,75,43,2,197,162,22,102,61,213,242]},"announce":[],"urlList":[]}}