{"title":"The Dream of Reason - A History of Philosophy from the Greeks to","uid":3461315,"size":522195807,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:bd7e24401f5280c6c148d7b4cbd935c4c55005bb&amp;dn=The+Dream+of+Reason+-+A+History+of+Philosophy+from+the+Greeks+to&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ghost3x","files":357,"time":1143096420,"description":"Writing a history of more than 2,000 years of philosophy is no mean feat, and writing it in fewer than 500 pages of intelligent but graceful prose is more difficult still. Yet this is just what Anthony Gottlieb accomplishes in The Dream of Reason, which guides the reader from the earliest Greek philosophers to the pre-Cartesian Renaissance. Gottlieb&amp;#039;s project is undeniably ambitious, and by necessity it is big-picture philosophy. But it is exactly this big-picture context that is often lamentably absent from other works of this sort. Gottlieb&amp;#039;s skill at rendering historical context makes his account both unusually engaging and surprisingly illuminating.\n\nGottlieb is an admirable guide through the little-understood pre-Socratic philosophers of ancient Greece, giving fair measure to philosophers who are too often simplified or lampooned. His account of Plato and Aristotle is good too, as is his treatment of the later Hellenistic schools, Epicureanism, Stoicism, and Skepticism. Gottlieb&amp;#039;s treatment of medieval philosophy, particularly Thomist and Arabic philosophy, is lean, as the author chooses to focus more heavily on antiquity and the modern era (to be continued in a second volume), and the narrative history that bridges the two. Ever enthusiastic, Gottlieb&amp;#039;s storytelling voice and character-driven approach make The Dream of Reason compelling reading. It is an ideal book for nonexperts interested in an appealing and informative history of philosophy as well as for students looking for a lucid and comprehensive account of premodern thinkers.","torrent":{"xt":"urn:btih:bd7e24401f5280c6c148d7b4cbd935c4c55005bb","amp;dn":"The+Dream+of+Reason+-+A+History+of+Philosophy+from+the+Greeks+to","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bd7e24401f5280c6c148d7b4cbd935c4c55005bb","infoHashBuffer":{"type":"Buffer","data":[189,126,36,64,31,82,128,198,193,72,215,180,203,217,53,196,197,80,5,187]},"announce":[],"urlList":[]}}