{"title":"The Bible VS Joseph Smith (2010) Uncompressed DVD","uid":7376324,"size":3659933156,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:be7413fb1512618cd9a0bf9ce799c1a0a3bfc81f&amp;dn=The+Bible+VS+Joseph+Smith+%282010%29+Uncompressed+DVD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mft57","files":11,"time":1340370986,"description":"Untouched !\n\nDirectors: Living Hope Ministries , SourceFlix\nFormat: NTSC, Dolby, Full length, Widescreen, Color\nAspect Ratio: 16:9\nRegion Free\nLanguage: English\nSubtitles: No\nRuntime: 78 minutes\nStudio: Living Hope Ministries / SourceFlix\n\n[IMG]http://i247.photobucket.com/albums/gg157/bromft/Bible_vs_Joseph_.jpg[/IMG]\n\nFrom the creators of &quot;The Bible vs. The Book of Mormon,&quot; &quot;DNA vs. The Book of Mormon,&quot; &quot;Jericho Unearthed,&quot; &quot;The Jesus Tomb Unmasked&quot; and &quot;Lifting the Veil of Polygamy,&quot; I think this is their best film to-date. Produced entirely in Israel by Living Hope Ministries/SourceFlix, this one tests the predictions of Biblical and Mormon prophets. Director Joel Kramer sits down with a devout Mormon to dialogue about one of the most important questions of faith: How do we know if a prophet is speaking the truth of God. Listen in on their fascinating discussion. Follow along as they travel some of the Holy Land in search of facts. Watch as they put Biblical and Mormon prophets to the test in order to find out if their predictions actually took place in history. \n\n\nIn this unique documentary a Christian and a Mormon sit down to dialogue about one of the most important questions of faith: How do we know if a prophet is speaking the truth? Listen in on their fascinating discussion and follow along as they travel throughout the Israel in search of facts. They will put Biblical prophets and Mormon prophets, especially Joseph Smith to the test in order to find out if their predictions actually took place in history. If even one prediction fails to come true, then that prophet fails the test. --- &quot;Thank you so much for putting the tools into the hands of Christian people everywhere to compassionately and honestly share the truth of the Gospel, as found in the Bible, with their Mormon friends and family members. Many who would never take the time to read books on Mormonism will take the time to view these critical resources. The Body of Christ is stronger and better informed because of your efforts. Thank you for speaking the truth in love. May God richly bless you for your faithful service.&quot; -- David Sykes ","torrent":{"xt":"urn:btih:be7413fb1512618cd9a0bf9ce799c1a0a3bfc81f","amp;dn":"The+Bible+VS+Joseph+Smith+%282010%29+Uncompressed+DVD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"be7413fb1512618cd9a0bf9ce799c1a0a3bfc81f","infoHashBuffer":{"type":"Buffer","data":[190,116,19,251,21,18,97,140,217,160,191,156,231,153,193,160,163,191,200,31]},"announce":[],"urlList":[]}}