{"title":"The Trophy Taker - Lee Weeks.epub","uid":8950722,"size":442752,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:bed254b533353bfd0e6423f3589d726193760e74&amp;dn=The+Trophy+Taker+-+Lee+Weeks.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"420weedman","files":1,"time":1379878146,"description":"In the crowded, humid streets of Hong Kong a serial killer is on the prowl. Hunting lone Western women, lured to the island by the promise of easy money, his killing spree is intensifying - and becoming more brutal. Bags of body parts are turning up all over the city and every woman fears she may be the next victim. It's Detective Johnny Mann's first big case since being sidelined after bringing down a corruption racket. Haunted by the death of his father, killed at the hands of a Triad gang, he's intent on revenge at any cost. He's a liability the police force could do without but he's the only man who can get to the bottom of this perplexing case. Scouring the city's hostess clubs - magnets for the rich and perverted - Mann unearths chilling evidence which leads him to suspect the killings may have begun decades before. When yet another corpse is found on a remote farm, Mann is in for the shock of his life. The murders have now become personal and Mann must put his own life on the line in order to prevent losing someone else precious to him! \n\nGenre: Fiction, Mystery/Thriller","torrent":{"xt":"urn:btih:bed254b533353bfd0e6423f3589d726193760e74","amp;dn":"The+Trophy+Taker+-+Lee+Weeks.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bed254b533353bfd0e6423f3589d726193760e74","infoHashBuffer":{"type":"Buffer","data":[190,210,84,181,51,53,59,253,14,100,35,243,88,157,114,97,147,118,14,116]},"announce":[],"urlList":[]}}