{"title":"Zvezda AKA The Star","uid":4200644,"size":1844177877,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:bedfb85ff2107e55bdd4d9630ffd6f2d06dfa760&amp;dn=Zvezda+AKA+The+Star&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"lord_terabyte","files":12,"time":1211479587,"description":" &lt;a href=&quot;http://www.imdb.com/title/tt0326450/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.imdb.com/title/tt0326450/&lt;/a&gt;\n\n[QUOTE]The film is based on the eponymous book by Emmanuil Kazakevich. In the summer of 1944 the Nazi Armies prepare a massive Tank Division named &amp;#039;Viking&quot; for the offensive on occupied Russian land. The Russian Army&amp;#039;s special group of seven snipers named &quot;Zvezda&quot; is sent for a reconnaissance operation behind the enemy lines in the back of the Nazi Tank Division. Two previous Russian groups never came back. The seven Russians know that they are going to an almost certain Death for the sake of Victory.[/QUOTE]\n\n[IMG]http://i277.photobucket.com/albums/kk75/otr2damascus/zvezdaposterzo8.jpg[/IMG]\n\n[IMG]http://i277.photobucket.com/albums/kk75/otr2damascus/1111.png[/IMG]\n\n[IMG]http://i277.photobucket.com/albums/kk75/otr2damascus/2222.png[/IMG]\n\n[IMG]http://i277.photobucket.com/albums/kk75/otr2damascus/4444.png[/IMG]\n\n[IMG]http://i277.photobucket.com/albums/kk75/otr2damascus/5555.png[/IMG]\n\n[IMG]http://i277.photobucket.com/albums/kk75/otr2damascus/6666.png[/IMG]\n\n[IMG]http://i277.photobucket.com/albums/kk75/otr2damascus/7777.png[/IMG]\n\n[QUOTE]\nThis movie is about romance that went without a touch, every word of which was sent through the airwaves in form of a code.\n\nA newly recruited radio operator girl falls for a young handsome reconnaissance officer. Zvezda is the call-sign of his squad that steals into the night on a mission that may turn deadly.\n\nWatching a movie set in the middle of a war, we instinctively try to guess who will survive until the end. In this movie, we hope they all will as we bond with the 6 guys on the squad to the point of our hearts starting to beat with theirs in unison.\n\nCommunications on a reconnaissance mission is about signs and looks. That&amp;#039;s the way a viewer gets to communicate with the characters. The contact takes place on the eye level: the eyes on the screen are larger than life, as well as what we see in them. And what we see there is very often the fear-a feeling very familiar to us, something that makes us bond with the characters even stronger. `Which one would I&amp;#039;ve been like?&amp;#039; is a question drilling through our heads. The plot is far from schematic and the axiom that `the ours will always win&amp;#039; is subject to a reasonable doubt. Tears are inevitable.\n\nA masterpiece music score accompanies the movie shot in beautiful landscapes. The cast is perfect: the actors are not well-known and free from unnecessary stigma. Don&amp;#039;t miss a chance to see it. [/QUOTE]\n\n-----my rip-------\n\nI had to do a little work syncing the subs...\n\nIncludes all DVD extras, most of which I assume to be deleted scenes.\n\nThe scene sucks. axxo sucks. Their rips suck. The community needs more custom rippers who care about quality, not the outdated 1CD-2CD sizes.\n\n","torrent":{"xt":"urn:btih:bedfb85ff2107e55bdd4d9630ffd6f2d06dfa760","amp;dn":"Zvezda+AKA+The+Star","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bedfb85ff2107e55bdd4d9630ffd6f2d06dfa760","infoHashBuffer":{"type":"Buffer","data":[190,223,184,95,242,16,126,85,189,212,217,99,15,253,111,45,6,223,167,96]},"announce":[],"urlList":[]}}