{"title":"Jaideva Singh - 1991 - Spanda Karikas","uid":11678403,"size":11034721,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c0c7217ad6d83c0fe21ffdac3cdfcb8483df0bdb&amp;dn=Jaideva+Singh+-+1991+-+Spanda+Karikas&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Anomalous","files":1,"time":1422973169,"description":"Jaideva Singh - 1991 - Spanda Karikas - The Divine Creative Pulsation (OCR) (237p)\n\nPaperback: 209 pages\nPublisher: Motilal Banarsidass Pub; 2012 edition (August 27, 2014)\nLanguage: English\nISBN-10: 8120808215\nISBN-13: 978-8120808218\nLanguage: Sanskrit, Transliteration, English Translation, Exegesis\n\nThe spandakarikas are a number of verses that serve as a sort of commentary on the Siva-sutras. According to Saivagama, the divine consciousness is not simply cold, inert intellection. It is rather spanda, active, dynamic, throbbing with life, creative pulsation. In Siva-sutras, it is the prakasa aspect of the divine that is emphasized; in Spandakarikas, it is the vimarsa aspect that is emphasized. Together, these two books give us integral view of Saivai philosophy. Ksemaraja has written a commentary on Spandakarikas, titled Spandanirnaya. He is fond of sesquipedalian compounds, long and windy sentences, but he is very profound in the comprehension of the subject and so cannot be ignored. The author tried to provide a readable translation of both the karikas and the Spanda-nirnaya commentary. Each karika (verse) is given both in Devanagari and Roman script, followed by its translation in English. This is followed by Ksemaraja s commentary in Sanskrit. Then follows an English translation of the commentary. After this, copious notes are added on important and technical words. Finally, a running exposition of each karika in author s own words given.\n\nLike Shakti for Shiva, like Venus for Mars, the Spanda-Karikas are required reading for the person who has delved into Jaideva Singh's compilation of the Siva Sutras.\nThe Spanda-Karikas are Sri Vasugupta's commentary verses on the Siva Sutras he had received from Lord Shiva. 52 in all, here in this book they are wedded to Sri Ksemaraja's commentaries, plus a bonus 53rd verse from Sri Ksemaraja. Cool hey?!! 11 centuries before music companies started dishing our free bonus album CDs, or MacD's gave the world that extra decked Big Mac, the Kashmiri Saivites had known all about bonus goodies. :-)\nThe texts are all expertly translated by the incredibly meticulous and conscientious Jaideva Singh. Here, and in his Siva Sutras &amp; Pratyabhijnahrdayam too, Singh (pupil of Lakshman Joo; the last doyen of the Kashmir Trika lineage) really took pains to clarify the teachings of the Trika sect; carefully differentiating the Trika teachings from the strawman fallacies made out of them by careless Western academics. You will be hard challenged to find a better preserver and defender of the Trika philosophy elsewhere.\nWhile the Siva Sutras laid out the foundational doctrines of the Trika sect, describing Supreme Lord Shiva's relationship to the material world and sentient beings, the Spanda Karikas elucidate instead primarily on Lord Shiva's power or ParaShakti, his divine consort. Together, the Siva Sutras and Spand Karikas constitute the cornerstones of Trika philosophy","torrent":{"xt":"urn:btih:c0c7217ad6d83c0fe21ffdac3cdfcb8483df0bdb","amp;dn":"Jaideva+Singh+-+1991+-+Spanda+Karikas","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c0c7217ad6d83c0fe21ffdac3cdfcb8483df0bdb","infoHashBuffer":{"type":"Buffer","data":[192,199,33,122,214,216,60,15,226,31,253,172,60,223,203,132,131,223,11,219]},"announce":[],"urlList":[]}}