{"title":"The Anthony Cumia Show 2015-05-07 Chuck C. Johnson MP4 MP3","uid":11894215,"size":322023344,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:c0e121920d793eab71758d623d262fe5b3f2f553&amp;dn=The+Anthony+Cumia+Show+2015-05-07+Chuck+C.+Johnson+MP4+MP3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mothergoose58","files":2,"time":1431107580,"description":"*** CAUTION: 100% UNCENSORED CONTENT!!! ***\n\n-NOT FOR VIEWING BY CHILDREN OR THE FAINT OF HEART-\n\nFresh off his &quot;separation&quot; from SiriusXM, Anthony Cumia, formerly of The Opie and Anthony Show launches his live, uncensored HD video webcast at AnthonyCumia.com Monday-Thursday 4pm-6pm EST. Current events, politics, news and anything can and will be discussed with celebrity guests and comedians stopping by as well. This show is not for those who are inclined to be &quot;politically correct&quot; and will contain boundary-pushing language and topics. Proceed with caution...\n\nGuest: Chuck C. Johnson\n\nEpisode 159 - Another TACS week comes to an end with a recap of yesterday's show with Chris Hansen, Ant talks about virtual headsets, Larry David, virtual reality integrating into your reality, Disney, and we see a lovely #TBT picture. Anthony recalls Eddie Murphy in the 80's and plays Eddie's new music video, we take a look at part of a sketch from Amy Schumer, see &quot;elevator guy&quot;, hear charges were dropped on a hot teacher in a teen sex case, the callers join the party, and Ant moves to the poker table to meet Chuck C. Johnson. The guys talk about Chuck's schooling, his industry backstory, starting his website GotNews.com, Andrew Breitbart, the media taking themselves too serious, trolling Twitter, getting help from social media, and the Fox News misreporting story. They get into the right versus the left, offending others ideology, predictability, Hillary Clinton, talking about taboo topics, handling stories with kid gloves, &quot;rape culture&quot;, playing off of the &quot;outrage machine&quot;, emotion taking over facts, the credibility of new journalism, and Chuck talks about having the freedom to take risks. Chuck then tells us what he's researching currently, they discuss the media dehumanizing people, loss of privacy, crossing party lines, lies in stats, the way folks view government, Mike Huckabee, and people's fear of talking.\n\n\nIncludes an MP4 video file and an MP3 audio file; download both or only what you need and please seed!\n\nNew ups at: http://thepiratebay.se/user/mothergoose58/\n\nSubscribe at AnthonyCumia.com!!!","torrent":{"xt":"urn:btih:c0e121920d793eab71758d623d262fe5b3f2f553","amp;dn":"The+Anthony+Cumia+Show+2015-05-07+Chuck+C.+Johnson+MP4+MP3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c0e121920d793eab71758d623d262fe5b3f2f553","infoHashBuffer":{"type":"Buffer","data":[192,225,33,146,13,121,62,171,113,117,141,98,61,38,47,229,179,242,245,83]},"announce":[],"urlList":[]}}