{"title":"Imaginary Characters Painting Techniques Karen O'Brien (shailab)","uid":12935618,"size":86256420,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c0f75780fffbccd4bb2155accf08d203f623f23f&amp;dn=Imaginary+Characters+Painting+Techniques+Karen+O%27Brien+%28shailab%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"shailab","files":3,"time":1449574417,"description":"&quot;Imaginary Characters: Mixed-Media Painting Techniques for Figures and Faces&quot; - Karen O'Brien,\r\n\r\nEnglish | ISBN: 1440340250 | 2015 | PDF | 128 pages | 82.2 MB\r\n\r\n\r\nBelieve in magic, trust your intuition and find your individual artistic style!\r\n\r\nIn this book, you're the storyteller and the artist and you're on a quest to bring the soulful characters, mythical creatures and magical landscapes of your imagination to life through mixed-media art. You'll tap into your creative voice to fuse together lush dreamscapes, imaginary characters and found objects to build enchanting scenes, whimsical figures and expressive faces out of layers of acrylic, collage, watercolor and more. Learn the techniques necessary to create one-of-a-kind mixed-media masterpieces.\r\n\r\nOn your journey, you'll discover:\r\n\r\nFive skills to uncover your unique creative voice.\r\nA magical drawing method. Easily find your characters' bodies and faces hidden in random shapes on painted backgrounds; it's like seeing animals in the clouds.\r\nImaginative warm-up exercises. Learn tips for creating a character reference library, secrets for drawing unusual faces, how to develop a color palette and advice on how to play with proportion, light and shading.\r\nMore than 30 exciting mixed-media projects using watercolor, vintage photographs, gouache, pencil, fabric, ink and much more to bring your imaginary characters to life on everything from woodblocks and paintings to fabric collages and paper dolls.\r\nHow to paint without a plan. Trust your intuition to create something out of nothing.\r\nInspirational quotes about creativity from famous artists and thinkers.\r\nEmbrace your curiosity and see what happens!\r\n\r\n\r\nenjoy...\r\n\r\nYOURs INsincerely...\r\n\r\n-----------------------------------------------------------------------------   \r\n\r\n                                      .:.Shailab.:.\r\n\t                  \r\n                          https://thepiratebay.la/user/shailab/\r\n\r\n      \t               \t     https://kat.cr/user/shailab/","torrent":{"xt":"urn:btih:c0f75780fffbccd4bb2155accf08d203f623f23f","amp;dn":"Imaginary+Characters+Painting+Techniques+Karen+O%27Brien+%28shailab%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c0f75780fffbccd4bb2155accf08d203f623f23f","infoHashBuffer":{"type":"Buffer","data":[192,247,87,128,255,251,204,212,187,33,85,172,207,8,210,3,246,35,242,63]},"announce":[],"urlList":[]}}