{"title":"Jack Campbell - The Lost Fleet: Beyond the Frontier [1-3]","uid":12010943,"size":1178589135,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:c206c7493f65f86a181c43c16a1eafe827d0a672&amp;dn=Jack+Campbell+-+The+Lost+Fleet%3A+Beyond+the+Frontier+%5B1-3%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Cybotage","files":53,"time":1434116151,"description":"\n\nDreadnaught (2011)\n(The first book in the The Lost Fleet : Beyond the Frontier series)\n\nAdmiral Geary and Captain Desjani return to their battle cruiser Dauntless. Geary is charged with command of the third fleet, its first mission: to probe deep into the territory of the alien race to find out more...\n\nInvincible (2012)\n(The second book in the The Lost Fleet : Beyond the Frontier series)\n\nAdmiral John &quot;Black Jack&quot; Geary earned his rank after being revived from cryogenic sleep to lead the Alliance to victory against the Syndicate Worlds. But his superiors question his loyalty to the regime. Now in command of the First Fleet, Geary is tasked with exploring the frontier beyond Syndic space, a mission he fears deliberately puts the fleet--and himself--in harm's way.\n\nAn encounter with the alien enigmas confirms Geary's fears. Attacked without warning, he orders the fleet to jump star systems--only to enter the crosshairs of another hostile alien armada. Ignoring all of the First Fleet's attempts to communicate peaceful intentions, this system's species sends its ships into battle on suicide runs while it guards the exiting jump point with a fortress of incalculable power. Now, with a faction of his officers determined to eliminate this new threat at any cost, Geary must figure out how to breach the enemy's defenses so the fleet can reach the jump point without massive casualties--even though the enigmas could be waiting on the other side...\n\nGuardian (2013)\n(The third book in the The Lost Fleet : Beyond the Frontier series)\n\nAdmiral Geary's First Fleet of the Alliance has survived the journey deep into unexplored interstellar space, a voyage that led to the discovery of new alien species, including a new enemy and a possible ally. Now Geary's mission is to ensure the safety of the Midway Star System, which has revolted against the Syndicate Worlds empire - an empire that is on the brink of collapse.\n\nTo complicate matters further, Geary also needs to return safely to Alliance space not only with representatives of the Dancers, an alien species, but also with Invincible, a captured warship that could possibly be the most valuable object in human history. Despite the peace treaty that Geary must adhere to at all costs, the Syndicate Worlds regime threatens to make the fleet's journey back grueling and perilous.\n\nAnd even if Geary escorts Invincible and the Dancers' representatives safely unharmed, the Syndics' attempts to spread dissent and political unrest may have already sown the seeds of the Alliance's destruction","torrent":{"xt":"urn:btih:c206c7493f65f86a181c43c16a1eafe827d0a672","amp;dn":"Jack+Campbell+-+The+Lost+Fleet%3A+Beyond+the+Frontier+%5B1-3%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c206c7493f65f86a181c43c16a1eafe827d0a672","infoHashBuffer":{"type":"Buffer","data":[194,6,199,73,63,101,248,106,24,28,67,193,106,30,175,232,39,208,166,114]},"announce":[],"urlList":[]}}