{"title":"Handel_Rinaldo_Hogwood","uid":4013511,"size":255645647,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:c2846717c89a5b0430fe4a3210be397e7bf99ffb&amp;dn=Handel_Rinaldo_Hogwood&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"citaltras","files":96,"time":1202231049,"description":"G. F.    H A N D E L  -  R I N A L D O  \n\nHWV 7\nHandel&amp;#039;s first London opera\nLondon  1711\n\n\nThe 4th post in a series of baroque operas.\nEnjoy and seed.\nmp3\n192Kbit/s\n\nMore Handel operas in torrents:\n\nAlmira HWV 1 (1705)\nAgrippina   HWV 6 (1709)\nAmadigi di Gaula HWV 11 (1715)\n\n--------------------------------------\n\nRinaldo (HWV 7) is an Italian opera by George Frideric Handel, now a part of the standard operatic repertoire. The Italian libretto was written by Giacomo Rossi based on episodes of Torquato Tasso&amp;#039;s Gerusalemme liberata (&quot;Jerusalem Delivered&quot;. It is a heroic story of battle and love set in the time of the First Crusade (1096?1099).\n\n\nRinaldo was the first opera Handel produced for London and the first Italian opera composed specifically for the London stage. It was first performed in Her Majesty&amp;#039;s Theatre in Haymarket on 24 February 1711. It was a great success thanks in part to the participation of two of the leading castrati of the era, Nicolo Grimaldi and Valentino Urbani. The strains of financing its grand production, however, resulted in liens from the unpaid craftsmen, and the Lord Chamberlain&amp;#039;s office revoked the impresarion Aaron Hill&amp;#039;s license nine days after the opening of Rinaldo.[1]\n\nThe pastoral idyll of the plot (Armida&amp;#039;s hate for the crusaders turned into love for one crusader, Rinaldo) appealed to many Baroque artists. The libretto was initially written in some form by Aaron Hill, who had taken up the management of the Queen&amp;#039;s Theatre for the season 1710-11, and translated into Italian by Rossi, as opera seria in any other language was unthinkable on the London stage. The extent of Hill&amp;#039;s involvement is disputed: in modern terms it might be said that he provided the &quot;treatment&quot; of Tasso&amp;#039;s poem. Hill provided a preface to the published libretto, outlining his artistic purposes, which were to add to recently-heard imported Italian operas, which, however, had been &quot;compos?d for Tastes and Voices, different from those who were to sing and hear them on the English Stage&quot; and to provide the features that London audiences had come to expect &quot;the Machines and Decorations, which bestow so great a Beauty on their Appearance&quot;, which had their London origins in the Restoration spectaculars, or &quot;machine plays&quot;. He hoped therefore &quot;to fill the eye with more delightful Prospects, so to give Two Senses equal pleasure?&quot;. Anthony Hicks writes, &quot;In essence he wanted to re-create the spectacular stage effects which had been a feature of the semi-operas of the previous decade (notably Purcell?s King Arthur) while allowing the music to take the new Italian form dominated by solo arias connected by recitative.&quot;\n(From Wikipedia)\n\n\n\n\nCategory:\tMusic","torrent":{"xt":"urn:btih:c2846717c89a5b0430fe4a3210be397e7bf99ffb","amp;dn":"Handel_Rinaldo_Hogwood","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c2846717c89a5b0430fe4a3210be397e7bf99ffb","infoHashBuffer":{"type":"Buffer","data":[194,132,103,23,200,154,91,4,48,254,74,50,16,190,57,126,123,249,159,251]},"announce":[],"urlList":[]}}