{"title":"close to you by wingtip","uid":4383168,"size":839063046,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:c2b99f9e985f1826c077c0cf62c29ed8dc74c1dd&amp;dn=close+to+you+by+wingtip&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"niwresh","files":1,"time":1220776799,"description":"I&amp;#039;d say about those 3 main characters like John Lloyd, Bea, and Sam - I&amp;#039;d say their act was very outstanding - Seriously! Sam Milby is his first movie ever and his first act on philippine movies was AMAZING, and during this film when he sings, his got a talent there. Also John and Bea, their acting on this film was FANTASTIC, on this film, how drama occur about John&amp;#039;s character not telling the girl (as Bea&amp;#039;s character) that he loves her, the dramatic scenes:their emotions, feelings and all that - Was so heartwarming that makes some people into tears. They didn&amp;#039;t even make a fake cry like putting water in their eyes, its was not fake, it was true. Some other philippine love movies would have fake crying in it but the act is like much more realistic that will make people cry sometimes.\n\nAnyway, this film is an excellent love story which people would enjoy watching it. This is the only love story in the Philippines that has better scenes, better acting, and better scripts than any other films that you would watch.\n\nThere are no problems about this film, not too dramatic, not too painful, its perfect. I&amp;#039;d rate this film a 10 out of 10.\n\n","torrent":{"xt":"urn:btih:c2b99f9e985f1826c077c0cf62c29ed8dc74c1dd","amp;dn":"close+to+you+by+wingtip","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c2b99f9e985f1826c077c0cf62c29ed8dc74c1dd","infoHashBuffer":{"type":"Buffer","data":[194,185,159,158,152,95,24,38,192,119,192,207,98,194,158,216,220,116,193,221]},"announce":[],"urlList":[]}}