{"title":"BlueProject SysTracer Pro v2.10.0.107","uid":13094344,"size":2969217,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:c2f2c2ccf8264f339fce406221abe7200ee880f3&amp;dn=BlueProject+SysTracer+Pro+v2.10.0.107&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ZarkBit","files":2,"time":1451095877,"description":"BlueProject SysTracer Pro v2.10.0.107\r\n\r\nView offer\r\n\t\r\nSysTracer v2.10: trace your system changes\r\n\r\nSysTracer is a system utility tool that can scan and analyze your computer to find changed (added, modified or deleted) data into registry and files.\r\n\r\nSysTracer can scan your system and record information about:\r\n\r\n    changed files and folders\r\n    modified registry entries\r\n    installed programs\r\n    system services\r\n    system drivers\r\n    applications that are configured to run at computer startup\r\n    running processes\r\n    loaded dlls\r\n    opened files, folders and registry\r\n    opened TCP and UTP ports\r\n\r\nEach scan operation performed with SysTracer generates a binary image file representing a snapshot of your system.\r\n\r\nRecording the snapshot usually takes a few minutes depending on your system complexity. You can choose to scan only specific parts from folders or registry, in order to speed up the recording process.\r\n\r\nBy comparing snapshots from before and after a new program installation or execution, you can determine which files or registry entries were added, changed, or deleted.\r\n\r\nYou can create as many snapshots as you may want or need, and you can compare anytime any pair of them, having the possibility to export differences to HTML and PDF.\r\nSysTracer Pro\r\n\r\nSysTracer Pro is an enhanced version of SysTracer. SysTracer Pro have advanced functionality like exporting and importing snapshots, useful in order to compare snapshots taken on different computers.\r\n\r\nWith SysTracer Pro you can search for files, folders and registry information into recorded snapshots.\r\n\r\nSysTracer Pro have command line support, for automating recording snapshots and exporting snapshots differences.\r\n\r\nVisit SysTracer features section for a detailed comparison matrix between SysTracer and SysTracer Pro.\r\nRemote scanning - track changes from network computers\r\n\r\nSysTracer have support for remote scanning, providing you an easy way to take snapshots of your network computers.\r\n\r\nIn order to allow scanning, each computer from your network will have a SysTracer executable installed as windows service.\r\n\r\nThe management of the entire process is done from a single computer (server) with a SysTracer instance running in normal desktop mode. From this server you will be able to control each SysTracer client by selecting scan targets, sending scan commands and receiving resulted snapshots.\r\nPortable version\r\n\r\nSysTracer can be used with or without installation.\r\n\r\nUsing the portable version - without installation - you can take snapshots of your system without making any changes to the current files or Windows registry.\r\n\r\nThe application can be used directly from the HDD or from an USB flash drive.\r\nSystem Requirements\r\n\r\n    Windows XP, 2003, Vista, 2008, Windows 7, XP 64-bit, Vista 64-bit, Windows 7 64-bit, Windows 8, Windows 2012, Windows 10\r\n    Internet Explorer 6.0 or later","torrent":{"xt":"urn:btih:c2f2c2ccf8264f339fce406221abe7200ee880f3","amp;dn":"BlueProject+SysTracer+Pro+v2.10.0.107","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c2f2c2ccf8264f339fce406221abe7200ee880f3","infoHashBuffer":{"type":"Buffer","data":[194,242,194,204,248,38,79,51,159,206,64,98,33,171,231,32,14,232,128,243]},"announce":[],"urlList":[]}}