{"title":"K. E. Lane - And Playing the Role of Herself","uid":8565183,"size":3263026,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c4d94fc2dcf6b8fce0825e858f2012a6bf271cc2&amp;dn=K.+E.+Lane+-+And+Playing+the+Role+of+Herself&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Romanah","files":-1,"time":1370983564,"description":"*Recipient of three &quot;Goldies&quot; from the Golden Crown Literary Society, the premier organization for the support and nourishment of quality lesbian literature. And Playing the Role of Herself won in the categories of Lesbian Romance, Lesbian Debut Author, and the Ann Bannon Popular Choice Award.\n\nActress Caidence Harris is living her dreams after landing a leading role among the star-studded, veteran cast of 9th Precinct, a hot new police drama shot on location in glitzy LA. Her sometimes-costar Robyn Ward is magnetic, glamorous, and devastatingly beautiful, the quintessential A-List celebrity on the fast-track to super-stardom. When the two meet on the set of 9th Precinct, Caid is instantly infatuated but settles for friendship, positive that Robyn is both unavailable and uninterested. Soon Caid sees that all is not as it appears, but can she take a chance and risk her heart when the outcome is so uncertain?\n\nThe leading ladies and the supporting cast of this debut novel by newcomer K.E Lane will charm you, entertain you, and leave you with a smile on your face, eager for Ms. Lane's next offering.","torrent":{"xt":"urn:btih:c4d94fc2dcf6b8fce0825e858f2012a6bf271cc2","amp;dn":"K.+E.+Lane+-+And+Playing+the+Role+of+Herself","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c4d94fc2dcf6b8fce0825e858f2012a6bf271cc2","infoHashBuffer":{"type":"Buffer","data":[196,217,79,194,220,246,184,252,224,130,94,133,143,32,18,166,191,39,28,194]},"announce":[],"urlList":[]}}