{"title":"Shadows Of Knight - Gloria (1966)","uid":5587904,"size":120410114,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:c81792c213605ea2eb6ec92b2e255702cb59c24a&amp;dn=Shadows+Of+Knight+-+Gloria+%281966%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Iron_Horse","files":22,"time":1274762438,"description":"Shadows Of Knight - Gloria (1966)\nmp3 320 kbit/s\n\nBiography\tby Richie Unterberger\n&quot;The Stones, Animals and Yardbirds took the Chicago Blues and gave it an English interpretation. We've taken the English version of the Blues and re-added a Chicago touch.&quot; The Shadows of Knight's self-description was fairly accurate. Although this mid-'60s garage band from the Windy City did not match the excellence of either their British or African-American idols, the teen energy of their recordings remains enjoyable, if not overwhelmingly original. The group took a tamer version of Them's classic &quot;Gloria&quot; into the American Top Ten in 1966, and also took a Yardbirdized version of Bo Diddley's &quot;Oh Yeah&quot; into the Top 40 the same year. Their patchy albums contained a few exciting R&amp;B covers in the Yardbirds/Stones style and a few decent originals in the same vein. The group's original lineup splintered quickly, and the Shadows faded in the late '60s after briefly pursuing a more commercial pop sound. Vocalist Jim Sohns continued fronting various incarnations of the band and was ultimately arrested in 1980, although he only served a three-year sentence for drug charges. In the years that followed, the Shadows of Knight enjoyed something of a comeback as several labels reissued their material, and Sohns pieced together a new touring lineup. Shows with the Romantics and Cheap Trick followed, as did the release of two new albums: 2007's A Knight to Remember and 2008's Rock 'n' Roll Survivors. \n\nReview\tby Cub Koda\nAlthough revisionist historians will claim that any Shadows of Knight best-of that includes &quot;Gloria&quot; will cover just about everything you'll ever need on this Chicago punk band (and usually acting as if Van Morrison's and Them's original was the actual hit -- wrong), true believers have long championed their two original albums for the Dunwich label, especially their debut long-player named after their big hit. Why? Simply because it positively rocks with a raw energy of a band straight out of the teen clubs, playing with a total abandon and an energy level that seems to explode out of the speakers. Equal parts Rolling Stones, Yardbirds, Who, and snotty little Chicago-suburb bad boys, the Shadows of Knight could easily put the torch to Chess blues classics, which make up the majority of the songs included here. Their wild takes on &quot;I Just Want to Make Love to You,&quot; &quot;Oh Yeah,&quot; and &quot;I Got My Mojo Working&quot; rank right up there with any British Invasion band's version from the same time period. Original material was never plentiful on either SOK long-player, but worth checking out are &quot;Light Bulb Blues,&quot; the blues ballad &quot;Dark Side,&quot; and the why-me? rocker &quot;It Always Happens That Way.&quot; Completing the package is the inclusion of three bonus tracks, the single-only &quot;Someone Like Me&quot; and an alternate version, and &quot;I Got My Mojo Working,&quot; which is vastly superior to the take on the original album. A not-too-vastly-different alternate mix of &quot;Oh Yeah&quot; completes the bonus tracks, although the original album version is curiously missing from this otherwise excellent package. Nonetheless, a reissue well worth adding to the collection. If you're only going to own one Shadows of Knight package, you could, and should, start right here. \n\n\nTracklisting:\n01.Gloria 2:34\n02.Light Bulb Blues 2:32\n03.I Got My Mojo Working 3:28\n04.Darkside 2:00\n05.Boom Boom 2:28\n06.Let It Rock 1:52\n07.Oh Yeah 2:45\n08.It Always Happens That Way 1:52\n09.You Can't Judge a Book by Looking at the Cover 2:37\n10.(I'm Your) Hoochie Coochie Man 3:52\n11.I Just Want to Make Love to You 3:49\n12.Oh Yeah 2:45\n13.I Got My Mojo Working 3:14\n14.Someone Like Me 2:18\n\nThe Shadows Of Knight:\nJoe Kelley - Guitar\nJerry McGeorge - Guitar (Rhythm)\nJim Sohns - Vocals\nTom Schiffour - Drums\nWarren Rogers - Bass\n","torrent":{"xt":"urn:btih:c81792c213605ea2eb6ec92b2e255702cb59c24a","amp;dn":"Shadows+Of+Knight+-+Gloria+%281966%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c81792c213605ea2eb6ec92b2e255702cb59c24a","infoHashBuffer":{"type":"Buffer","data":[200,23,146,194,19,96,94,162,235,110,201,43,46,37,87,2,203,89,194,74]},"announce":[],"urlList":[]}}