{"title":"Sexually Broken--Busty Asian Mia Li shackled to sybian and throa","uid":12744391,"size":576822315,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:c8202543af40d2e8191c5bfc744c5263c8e8b269&amp;dn=Sexually+Broken--Busty+Asian+Mia+Li+shackled+to+sybian+and+throa&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"merzedes","files":1,"time":1447282941,"description":"\nBusty Asian Mia Li shackled to sybian and throatboarded without mercy by two hard cocks! | Mia Li | Maestro | Matt Williams \r\n\r\nNovember 11, 2015\r\n\r\n\r\nHigh MP4 only.\r\n\r\n\r\nEager cum slut throat trained on sybian in strict bondage \r\n \r\nEvery time Mia Li shows up, she always gives it her all. She does not hold back, throwing herself into every scene with every fiber of her being. Her dedication to the dick is undeniable and to be appreciated. Today we have a treat in store for our muscular cock slut. Today she gets to suck dick while cumming her brains out, Sexuallybroken style.\r\n\r\nBound down in in a custom made wooden bondage device that shackled her tight pussy directly onto a sybian, Mia is in for the ride of her life. The sybian is a sexual thunderbolt between her legs, she will be so busy cumming that she will not be able to recall her own name. The facefucking is only going to add to the challenge. Multitasking while cumming like a banshee is no easy matter, but today is not meant to be easy.\r\n\r\nOne after the other the hard dick steps up and takes Mia’s face hole. She is quite quickly transformed into a drooling mess, cumming and shrieking and then cumming some more. All the while the cocks are training out her throat to be custom fitted. This is her new purpose in life. A drooling facepussy bound on her knees cumming her brains out. There are worse fates in life.\r\n\r\nWe do not stop until there is nothing left but a moaning wreck of flesh covered in her own drool and cum, glassy eyed and spent. This is the look of someone worked over, Sexuallybroken style. It is our favorite kind of look. Today was a good day, thank you Mia. Until we meet again... \r\n\r\nScreens \nhttp://www.sexuallybroken.com/sexual/bondage/trailer.php?y=2015&amp;p=11_11mli4&amp;u=SexuallyBroken-Mia-Li-Maestro-Matt-Williams-Busty-Asian-Mia-Li-shackled-to-sybian-and-throatboarded-without-mercy-by-two-hard-cocks\r\n\r\nUploaded by Merzedes and Shallow2\r\n\r\n19 000 Femdom/BDSM/Fetish torrentuploads completed. Man.. feels like every 1000 goes by faster and faster ;)\r\n\r\nJust keep on leaving us the nice comments below and we are happy :)\r\n\r\nAny Questions ?? Read our FAQ!!\r\n \nhttps://yuq.me/users/23/079/W2kwa6hEeP.png\r\n \nhttp://s16.postimg.org/rxyfmji7p/Merzedes_Shallow2_FAQ_The_Pirate_Bay.jpg\r\n\r\nCheers :-)","torrent":{"xt":"urn:btih:c8202543af40d2e8191c5bfc744c5263c8e8b269","amp;dn":"Sexually+Broken--Busty+Asian+Mia+Li+shackled+to+sybian+and+throa","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c8202543af40d2e8191c5bfc744c5263c8e8b269","infoHashBuffer":{"type":"Buffer","data":[200,32,37,67,175,64,210,232,25,28,91,252,116,76,82,99,200,232,178,105]},"announce":[],"urlList":[]}}