{"title":"Magic Encounters: Apassionata 2011 Im Licht der Sterne PAL Retai","uid":6912452,"size":4450073911,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:c9056499896b9c86dc134cc79df3a7e460718f5b&amp;dn=Magic+Encounters%3A+Apassionata+2011+Im+Licht+der+Sterne+PAL+Retai&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"NLUPPER002","files":-1,"time":1324891165,"description":"Magic Encounters: Apassionata 2011 Im Licht der Sterne PAL Retail\n.\n[IMG]http://img84.imageshack.us/img84/8752/67622780.jpg[/IMG]\n.\nVoor de paardeliefhebbers onder ons heb ik een mooie dvd gevonden.\n.\n[IMG]http://img717.imageshack.us/img717/3773/ilds02.png[/IMG]\n.\nWebInfo:   &lt;a href=&quot; http://www.apassionata.com/bene/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.apassionata.com/bene/&lt;/a&gt;\n.\nFascinerende IJslandse paarden tÃƒÂ·lten in indrukwekkende quadrilles en formaties door de in nevelen gehulde arena.\nDe equipe van de Portugese grand maÃ‚Â¯tre Luis Valenca laat tijdens het rijden en de dressuurproeven in een prachtige balscÃƒÅ¾ne de prachtigste capriolen zien.\nDie had de ezel &quot;Basile&quot; van Laurent Jahan bijna gemist ÃƒÂ» hij lag zo lekker te slapen onder het dekbed met de teddyberen .... \nDe prachtige Friezen van Petra Geschonneck lieten de Spaanse draf en een perfect uitgevoerde piaf zien. \nAdemloos keek het publiek toe hoe de trickriders van Francois Jacquelin de arena veroverden.\nPiramides maken, onder het paard door rollen en in galop op ski's over een springschans ÃƒÂ» en dat met twee amazones!\nIn enkele steden hielden ze de adem in toen de Ukrainian Cossacks met zijn drieÃƒâ„¢n een menselijke piramide vormden ... te paard!\n.\n[IMG]http://img88.imageshack.us/img88/7339/showbilder301.jpg[/IMG]\n.\nDe betoverende Sylvie Willms bracht het publiek in vervoering met een vrijheidsdressuur zonder zadel en hoofdstel ÃƒÂ» met twee paarden tegelijk.\nEn ook Christophe Hasta Luego liet met zijn vijf Isabellen-Lusitanos een sterk staaltje vrijheid zien.\nMet slechts zijn stem en gebaren stuurde hij hen als door een magische hand geleid over de grote bÃ‚Â³hne! Ook de Shire &quot;Jos&quot;, die samen met vier schattige Shetlandpony's in de arena &quot;speelde&quot;.\nLaury Tisseur uit Zuid-Frankrijk showde de discipline &quot;Working Equitation&quot; op de vurige, temperamentvolle klanken van de Flamenco.\nYannick Gicquel (TAO Horse Show) liet met zijn Henson-paarden de Spaanse stap in de Hongaarse post zien, voordat hij over brandende hindernissen sprong.\nHij werd afgelost door Patrice Raymond die staand op zes galopperende paarden over een dubbele, brandende hindernis sprong en tussen brandende fakkels door slalomde.\n\nDe bekroonde paardenshow werd muzikaal ondersteund door het gezang van de fantastische &quot;Voice of APASSIONATA&quot; Arndis Halla.\nIJslandse volksliederen, operamelodieÃƒâ„¢n en meeslepende cross-klassieke songs maakten van de show een belevenis voor het hele gezin.\n\nMeer dan 545.000 toeschouwers gingen met Leyla mee op haar twee uur durende reis vol avonturen en fantasie - met meer dan 40 paarden, hartstocht en passie, actie en meeslepende muziek!\n.\n[IMG]http://img39.imageshack.us/img39/4010/showbilder101.jpg[/IMG]\n.\nGoogle Translated to English\n.\nFascinating Icelandic horses spins and quadrilles in impressive formations in mist shrouded arena.\nThe crew of the Portuguese grand maitre Luis Valenca late while driving and dressage in a beautiful balscÃƒÅ¾ne see the beautiful antics.\nHe had the donkey &quot;Basile&quot; Laurent Jahan almost missed - he was so nice to sleep under the covers with teddy bears ....\nThe beautiful Petra Geschonneck Frisians left the Spanish trot to perfection Piaf show.\nBreathlessly watched the audience how the trick riders of Francois Jacquelin conquered the arena.\nMake pyramids, including the roles and galloping horse on skis on a ski jump - and two amazons!\nIn some towns they held their breath when the Ukrainian Cossacks with the three formed a human pyramid ... on horseback!\n.\nThe enchanting Sylvie Willms led the audience with a vrijheidsdressuur without saddle and bridle - with two horses at once.\nAnd Christophe Hasta Luego left with his five-Isabelle Lusitano see a prime example of freedom.\nWith only his voice and gestures as he sent them by a magical hand held on the big stage! The Shire &quot;Jos&quot;, together with four adorable Shetland ponies in the arena &quot;played&quot;.\nLaury Tisseur from southern France showed the discipline &quot;Working Equitation&quot; the fiery, spirited sounds of the Flamenco.\nYannick Gicquel (TAO Horse Show) with his left Henson horses of the Spanish stage in the Hungarian post-show, before he jumped over burning obstacles.\nHe was relieved by Patrice Raymond, who stand at six galloping horses on a double jump and fire barrier between flaming torches slalomed.\n\nThe winning horse was backed musically by the sounds of the great &quot;Voice of APASSIONATA&quot; Arndis Halla.\nIcelandic folk songs, operatic melodies and compelling cross-classic songs made the show an experience for the whole family.\n\nMore than 545,000 spectators went along with Leyla at her two-hour journey full of adventure and imagination - with over 40 horses, passion, and passion, action and lively music!\n.\nINFO\n.\nSource: Retail\nGenre: Dokumentation\nVideo: PAL Untouched\nAudio: English and German DD2.0\nRelease.Date: 04.03.2011\nRunning Time: 125  min\nSubTitles: No\nMenu: Yes\nCharper selection: Yes\nExtra's: Yes\n.\nEnjoy\n","torrent":{"xt":"urn:btih:c9056499896b9c86dc134cc79df3a7e460718f5b","amp;dn":"Magic+Encounters%3A+Apassionata+2011+Im+Licht+der+Sterne+PAL+Retai","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c9056499896b9c86dc134cc79df3a7e460718f5b","infoHashBuffer":{"type":"Buffer","data":[201,5,100,153,137,107,156,134,220,19,76,199,157,243,167,228,96,113,143,91]},"announce":[],"urlList":[]}}