{"title":"Motorway.Cops.s07e01.EN.SUB.WEBRIP.[MPup]","uid":12404424,"size":1059237369,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:c9deaa54405dceb0f7c79115d8bfc644ee7d384a&amp;dn=Motorway.Cops.s07e01.EN.SUB.WEBRIP.%5BMPup%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"makinapufterpup","files":2,"time":1442070950,"description":"Motorway Cops s07e01 EN SUB WEBRIP [MPup] Breakdown\n\nFormat: MPEG-4\nSize: 1280x720\nDisplayAspectRatio: 16:9\nFrameRate: 25.000 fps\nAudioCodec: AAC\nChannels: 2 channels\nSamplingRate: 48.0 KHz\n\nReality series revealing the everyday heroism of the traffic police. A father and his two-year-old daughter break down in a live lane of the motorway.\n\n[img]http://extraimago.com/images/2015/09/12/94d286ddb9e1681d68b6db5904b61f6d.jpg[/img]\n\nIn West Yorkshire, five motorways and two major cities meet in one of the country's busiest intersections.\n\nMotorway cops Dave Robson and Phil Stonebanks come on duty to a type of call they always fear - an accident in a live lane of the motorway involving a two-year-old child. Dave and Phil close the motorway, and while the casualties are taken to hospital, the motorway cops begin their investigation - but it's fast approaching the evening rush hour, and time is not on their side.\n\nThe motorways are often a good place to identify drivers who shouldn't be on the road. With help from their automatic number plate recognition camera, PCs Lindsey Pickles and Martin Willis spot an uninsured driver. When Martin approaches the car, to his surprise he finds a mum with three children, one of which is too young to be transported in the front of the car.\n\nWhile responding to a report of a car fire on the A1 motorway, PC Dale Anderson finds his progress blocked by a motorbike rider using hard shoulder. Taking a shortcut through the tailbacks doesn't impress Dale.\n\nPC Matthew Hemingway deals with a distressed motorist who's been involved in a hit-and-run accident on the M62. Matthew is determined to track down the men who caused the accident.\n\nIn the quiet of the night, with less traffic on the roads, West Yorkshire's motorway cops are often asked to help out in the surrounding towns. PCs Lindsey Pickles and Martin Willis come across a driver they'd like to stop - but just as they attempt to stop the driver, he makes off, and a high-speed chase ensues.\n\nAnd, when a drink driver goes the wrong way up the motorway during a police pursuit, the motorway cops are faced with some tragic consequences","torrent":{"xt":"urn:btih:c9deaa54405dceb0f7c79115d8bfc644ee7d384a","amp;dn":"Motorway.Cops.s07e01.EN.SUB.WEBRIP.%5BMPup%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c9deaa54405dceb0f7c79115d8bfc644ee7d384a","infoHashBuffer":{"type":"Buffer","data":[201,222,170,84,64,93,206,176,247,199,145,21,216,191,198,68,238,125,56,74]},"announce":[],"urlList":[]}}