{"title":"Enhanced Oil Recovery Field Case Studies - James J. Sheng","uid":14668483,"size":21499424,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:cbce6d31e42d7d94e30f70ed3f797e11a352c3a6&amp;dn=Enhanced+Oil+Recovery+Field+Case+Studies+-+James+J.+Sheng&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1463838190,"description":"Enhanced Oil Recovery Field Case Studies - James J. Sheng (GPP, 2013).pdf\r\n\r\nISBN 9780123865458\r\n\r\nEnhanced Oil Recovery Field Case Studies bridges the gap between theory and practice in a range of real-world EOR settings. Areas covered include steam and polymer flooding, use of foam, in situ combustion, microorganisms, &quot;smart water&quot;-based EOR in carbonates and sandstones, and many more.\r\n\r\nOil industry professionals know that the key to a successful enhanced oil recovery project lies in anticipating the differences between plans and the realities found in the field. This book aids that effort, providing valuable case studies from more than 250 EOR pilot and field applications in a variety of oil fields. The case studies cover practical problems, underlying theoretical and modeling methods, operational parameters, solutions and sensitivity studies, and performance optimization strategies, benefitting academicians and oil company practitioners alike.\r\n\r\nStrikes an ideal balance between theory and practice\r\nFocuses on practical problems, underlying theoretical and modeling methods, and operational parameters\r\nDesigned for technical professionals, covering the fundamental as well as the advanced aspects of EOR","torrent":{"xt":"urn:btih:cbce6d31e42d7d94e30f70ed3f797e11a352c3a6","amp;dn":"Enhanced+Oil+Recovery+Field+Case+Studies+-+James+J.+Sheng","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cbce6d31e42d7d94e30f70ed3f797e11a352c3a6","infoHashBuffer":{"type":"Buffer","data":[203,206,109,49,228,45,125,148,227,15,112,237,63,121,126,17,163,82,195,166]},"announce":[],"urlList":[]}}