{"title":"Sexually Broken--Innocent Girl  custom leather Maddy O'Reilley  ","uid":9125057,"size":1239784335,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:cd910eedab325aeba59a7734a81ec40f369fff31&amp;dn=Sexually+Broken--Innocent+Girl++custom+leather+Maddy+O%27Reilley++&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"merzedes","files":-1,"time":1383206986,"description":"Innocent Girl Next Door bound in custom leather, fucked hard, and brutally deep throated! | Maddy O'Reilley | Matt Williams\n\nOctober 30, 2013 \n\n \nMP4 only.\n\n\nWelcome back Maddy O'Reilley to the pages of the fastest growing (BaRS) Bondage and Rough Sex site in the world. We take all the pain and uncomfortable corporal punishment out of the equation. Instead we punish girls with bondage and hard cock.\n\nThis was our Meet and Greet with Maddy. It's the first scene we do with a model. The scene is designed to feel out the girl's strengths and weaknesses, so we can exploit their strengths and avoid what the girl don't really like. We push and prod, we find out what turns them on and then we attack. All the bondage is done on screen and the entire scene transforms from one position to the last in front of your eyes.\n\nMaddy is already a bit nervous, this being her first scene here at Sexually Broken. We toss her a blindfold and instruct her to put it on tight. Next we attach her leather cuffs together behind her back and just like that, she is completely helpless. A couple hard face slaps and the bitch is under control. Grabbing her hair and pulling her head down, Maddy instinctively knows that hard cock is coming and her mouth opens in anticipation, and the struggle is on. We start slow, if you go too fast, too soon, all you have a girl gagging on your cock. If you warm the girl up you can go on a face fucking rampage even they didn't think they could handle. Fucking a bound girl's skull is an artform and when it's done right it can send a girl into subspace. \n\nMaddy gets the throat fucking of her life. She struggles for air, and we control her every intake. After one long, holding the cock all the way down her throat, session, we bend her over and lift up her skirt and slide our cock balls deep hard into her already soaked pussy. We ram her tight cunt for a bit and almost let her cum before we bind her again to a box, legs spread, head against the box and vibrator locked on her perfect clit. Now we Throat Board our helpless cocksucker. Throat Boarding is a term we created for a girl who's head is trapped up against a immovable object. The girl cannot escape Cock, she has no choice but to take whatever skull fucking is delivered, and we deliver a beauty. Before you know it, Maddy is face fucked stupid, eyes glazed over, mouth wide open as cock slides down her throat over and over. The vibrator makes her cum over and over, and soon Maddy is lost deep in subspace. It will take about 10 minutes before she will be able to do a coherent interview... \n \nScreens &lt;a href=&quot;\nhttp://sexuallybroken.com/sexual/bondage/2013/10_30moreilley/SexuallyBroken-Maddy-OReilley-Matt-Williams-Innocent-Girl-Next-Door-bound-in-custom-leather-fucked-hard-and-brutally-deep-throated.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://sexuallybroken.com/sexual/bondage/2013/10_30moreilley/SexuallyBroken-Maddy-OReilley-Matt-Williams-Innocent-Girl-Next-Door-bound-in-custom-leather-fucked-hard-and-brutally-deep-throated.php&lt;/a&gt;\n\n12 000 uploads and counting, 13k here we come :) And as usual, if you still like what Shallow2 and I upload, how about leaving us a nice comment below ? :)  \n  \nCheers  :-)  \n\n","torrent":{"xt":"urn:btih:cd910eedab325aeba59a7734a81ec40f369fff31","amp;dn":"Sexually+Broken--Innocent+Girl++custom+leather+Maddy+O%27Reilley++","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cd910eedab325aeba59a7734a81ec40f369fff31","infoHashBuffer":{"type":"Buffer","data":[205,145,14,237,171,50,90,235,165,154,119,52,168,30,196,15,54,159,255,49]},"announce":[],"urlList":[]}}