{"title":"Nashville Teens - Tobacco Road (1964)","uid":4918467,"size":93054037,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:cddbc2fe68cb4761b29932c708b6748e7301ba22&amp;dn=Nashville+Teens+-+Tobacco+Road+%281964%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Iron_Horse","files":35,"time":1243541624,"description":"Nashville Teens - Tobacco Road (1964)\nCD (2000) To Mp3 128 mbi/s\nIncluded: CD Covers and this Info\n\nReview  by Cub Koda  allmusic.com\nThe Nashville Teens were a truly kick-ass rock &amp; roll band from London. Their main claim to fame was providing the kamikaze backup behind Jerry Lee Lewis on his Live at the Star Club LP and recording the massive hit &quot;Tobacco Road.&quot; This disc reissues that entire 1964 album and adds another 14 bonus tracks to it, getting us all the way to 1971 in the group's recorded output. Hot versions Of &quot;Mona,&quot; &quot;I Like It Like That,&quot; &quot;La Bamba,&quot; and &quot;Too Much&quot; are the album's high points, and while the later tracks are a nice touch, they don't quite measure to the group's halcyon days. \n\nThe Nashville Teens are a British pop band formed in Weybridge, Surrey in Summer 1962.\n\nHistory\nLittle is known of the founding musicians, except that Arthur Sharp began his career in music as the manager of Aerco Records in Woking, Surrey, but the 'Mark II' line-up comprised original singers Arthur Sharp and Ray Phillips, with former Cruisers Rock Combo members John Hawken (piano), Mick Dunford (guitar), Pete Harris (bass) and Dave Maine (drums). Additional guitarist Pete Shannon completed the band. Roger Groome replaced Maine shortly afterwards.\n\nIn 1963, third vocalist Terry Crowe joined briefly; but later that same year Dunford and Groome left and were replaced by John Allen and Barry Jenkins. (Crowe and Dunford later formed 'The Plebs' with Danny McCulloch, and were re-united with Hawken in Renaissance in 1970).\n\nWhilst playing in Hamburg (as most British bands of the era did), the Teens backed Jerry Lee Lewis for his Live at the Star Club, Hamburg album. It is widely considered one of the greatest live rock and roll albums ever. Music critic Stephen Thomas Erlewine writes, &quot;Live at the Star Club is extraordinary, the purest, hardest rock &amp; roll ever committed to record.&quot; They later backed Carl Perkins on his hit single &quot;Big Bad Blues&quot;, and also played with Bo Diddley. At one such gig, they were spotted by Mickie Most who subsequently produced their June 1964 debut single, an interpretation of the John D. Loudermilk penned song, &quot;Tobacco Road&quot;, which reached number 6 in the UK Singles Chart and number 14 in the U.S.Billboard Hot 100 chart. Jimmy Page played guitar on the studio cut of &quot;Tobacco Road&quot;. The follow-up, another Loudermilk song, &quot;Google Eye&quot;, reached number 10 in the UK in October 1964.\n\nThe following year they appeared as themselves in the British film, Be My Guest, filmed at the Twickenham Film Studios, which was arranged by their then manager Don Arden.\n\nA further three top fifty singles, &quot;Find My Way Back Home&quot; and &quot;This Little Bird&quot;, followed in February and May 1965; with &quot;The Hard Way&quot; making a brief appearance the following year; but three subsequent records (&quot;I Know How It Feels To Be Loved&quot;, &quot;Forbidden Fruit&quot; and &quot;That's My Woman&quot;) all failed to chart.\n\nJenkins left in 1966 to join the The Animals, and was replaced by his predecessor Roger Groome.\n\nThe Nashville Teens' record producers included Andrew Loog Oldham and Shel Talmy. Although they were musically as competent as any of their contemporaries, the Teens had no distinctive personality as a band, and this contributed to their lack of long-term success, as did Decca's typical lack of promotion. (By 1970, Decca's only remaining rock acts were The Rolling Stones and The Moody Blues, both of whom handled their own promotion). In 1971 they released a single, &quot;Ella James&quot; - a Roy Wood penned song, originally recorded by The Move - on Parlophone, but again without success.\n\nArthur Sharp left in 1972 to join their one-time manager Don Arden, whilst Trevor Williams joined the fray. Despite Phillips' efforts, the Nashville Teens split in 1973.\n\nThey reformed in 1980, however, with Phillips as the only recognisable member joined by Peter Agate (guitar), Len Surtees (bass) and Adrian Metcalfe (drums), and are still playing. The current line-up is Phillips, Metcalfe, Colin Pattenden (bass and vocals), Simon Spratley (keyboards and vocals) and Ken Osborn (guitar).\n\nPhillips joined The British Invasion All-Stars in the 1990s and made three albums with the group, consisting of members of The Yardbirds, Procol Harum, The Pretty Things, Downliners Sect and more. They did a cover of &quot;Tobacco Road&quot;, which still receives airplay on XM Satellite Radio.\n\nMain band members   The following individuals were responsible for the bulk of the group's most successful era :-\nLead Vocalist - Ray Phillips (born Ramon John Phillips, 16 January 1939, Tiger Bay, Cardiff, South Wales).\nPianist - John Hawken (born John Christopher Hawken, 9 May 1940, Bournemouth, Dorset).\nGuitarist / Lead Vocalist - Art Sharp (born Arthur Sharp 26 May 1941, Woking, Surrey).\nBassist - Pete Shannon (born Peter Shannon Harris, 23 August 1941, Antrim, Co Antrim, Northern Ireland).\nDrummer - Barrie Jenkins (born Barry Jenkins, 22 December 1944, Leicester, Leicestershire).\nLead Guitarist - John Allen (born John Samuel Allen, 23 April 1945, St Albans, Hertfordshire).\nBassist - Neil Korner (born 6 October 1942, Ashford, Middlesex). He joined them in April 1966 from The New Vaudeville Band, but left them in late 1969.\nBassist - Roger Dean (born David Roger Bryan Dean, 16 March 1943, Hendon, North West London). He joined in late 1969 and left in 1973.\nLead Guitarist Len Tuckey (born Leonard Tuckey, 15 December 1947, Aberdeen, Aberdeenshire, Scotland). He joined in late 1969. &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/The_Nashville_Teens&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/The_Nashville_Teens&lt;/a&gt;\n\nTracklist:\nTobacco Road LP 1964\n01. Tobacco Road\n02. Mona (I Need You Baby)\n03. Need You\n04. Bread And Butter Man\n05. Hurtin' Inside\n06. Hootchie Kootchie Man\n07. Google Eye\n08. Too Much\n09. Parchment Farm\n10. I Like It Like That\n11. How Deep Is The Ocean\n12. La Bamba\n13. TNT\n14. Devil-In-Law\n15. Find My Way Back Home\nBonus Tracks\n16. What'cha Gonna Do - 1965\n17. I Know How It Feels To Be Loved - 1965\n18. Upside Down - 1966\n19. Forbidden Fruit - 1966\n20. Revived 45 Time - 1966\n21. That's My Woman - 1966\n22. I'm Coming Home - 1967\n23. The Biggest Night Of Her Life - 1967\n24. Last Minute - 1967\n25. All Along The Watchtower - 1968\n26. Sun Dog - 1968\n27. Poor Boy - 1965 (Unreleased)\n28. Ella James - 1971\n29. Tennessee Woman - 1971","torrent":{"xt":"urn:btih:cddbc2fe68cb4761b29932c708b6748e7301ba22","amp;dn":"Nashville+Teens+-+Tobacco+Road+%281964%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cddbc2fe68cb4761b29932c708b6748e7301ba22","infoHashBuffer":{"type":"Buffer","data":[205,219,194,254,104,203,71,97,178,153,50,199,8,182,116,142,115,1,186,34]},"announce":[],"urlList":[]}}