{"title":"Witness To History by Michael Walsh","uid":11338437,"size":1001804,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:cf109ae7a6061291f402e875819bccb78e6606a3&amp;dn=Witness+To+History+by+Michael+Walsh&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"HowdyDooDoo","files":-1,"time":1414774687,"description":"This is an outstanding compilation of quotes of views and observations expressed by the key players of World War Two, primarily from the Allied side; along with important quotes from significant documents - many of which have been overlooked or classified for the past sixty years. Key questions of war goals, war crimes, and justification for aggression are dealt with head-on. Numerous lies and legends that persist to this day are examined forthrightly and in detail, and laid bare to reality by a mountain of evidence provided by quotes from hundreds of unassailable sources. The ongoing tragedy is that, in this supposedly free society, this will be the first opportunity for many to discover much about World War Two that was intended to be censored and cast into an Orwellian &quot;memory hole&quot;. This little book costitutes the equivalent of a Doctorate dissertation on the causes, conduct, and effects of the greatest slaughter of recorded history. Taken as a whole, it casts serious doubt as to the major powers true stated war aims and war guilt","torrent":{"xt":"urn:btih:cf109ae7a6061291f402e875819bccb78e6606a3","amp;dn":"Witness+To+History+by+Michael+Walsh","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cf109ae7a6061291f402e875819bccb78e6606a3","infoHashBuffer":{"type":"Buffer","data":[207,16,154,231,166,6,18,145,244,2,232,117,129,155,204,183,142,102,6,163]},"announce":[],"urlList":[]}}