{"title":"Gurf Morlix - Fishin' In The Muddy [2002] [EAC.Log,Cue.FLAC]","uid":9534149,"size":311032404,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:d02225036f2529635af3f4b1582fde3b7e34c07d&amp;dn=Gurf+Morlix+-+Fishin%27+In+The+Muddy+%5B2002%5D+%5BEAC.Log%2CCue.FLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dickspic","files":16,"time":1390895080,"description":"Artist: Gurf Morlix\nRelease: Fishin' In The Muddy\nReleased: 2002\nLabel: CATAMOUNT \nCatalog#: CCR 010\nFormat: FLAC / Lossless / Log (100%) / Cue\nCountry: USA\nStyle: americana\n\nimage\n\n\n\n01 Torn In Two\n02 I Ain't Goin' That Way\n03 My Lesson\n04 Fishin' In The Muddy\n05 Center Of The Universe\n06 Big Eye\n07 I'm Hungry and I'm Cold\n08 Your Picture\n09 How To Be\n10 Driftin' Apart\n11 There Goes The Bone\n12 Let The Rhythm Rule \n\n\n\n\nOn his second solo outing, guitarist, songwriter, and producer extraordinaire Gurf Morlix (yeah, he was Lucinda Williams' guitar player when she was still writing songs that still meant something) throws a small curveball to those who loved his debut, Toad of Titicaca. There's still plenty of meaty guitar and down-to-the-bone production to keep those lovers of grease and roll happy, but here Morlix displays his real gift for songwriting. Using the same two cats that so rawly adorned Toad, ex-Faces keyboard player Ian McLagan on Hammond B3 and drummer Rick Richards, Morlix weaves tales of terror, depression, nonsense, strange stories, and allegories in the languages of morning after blues, rough and rowdy rockabilly, folk, country, greasy R&amp;B, and Texas rock. The opener, &quot;Torn in Two,&quot; is a shimmering, razored edge tome of desperation and heartbreak. The acoustic guitars shimmy under the verse until the bass drum and snares kick in with the organ and electric guitars on the refrain: &quot;I've got a heart that's torn in two/everyone can see/I'm nothin' without you/my heart's been torn in two.&quot; Morlix's trademark beer bottle slide ushers in the interludes to devastating effect. Morlix's cosmic cowboy sensibilities and humor are everywhere present too. On &quot;Center of the Universe,&quot; with jangling, ringing guitars powering the top of the mix, Morlix runs down another's complete cluelessness. But, like Bob Dylan's &quot;Like a Rollin' Stone,&quot; that it resembles in tone, the track feels good. Its anthemic rock &amp; roll is rooted to a killer backbeat and Morlix's chunky country rock chorded lead is sharp as a stiletto. The shifty bluesabilly of &quot;Big Eye&quot; is a pure good time quaker with Richards double timing the band and Morlix playing his dirtiest slide guitar ever -- and that's something. It's works come straight from the rock and blues pantheon: he's got the big eye on you! In the turnarounds there's all kinds of noise and blurring guitars and organs. And the beat -- it's hypnotic in its banging glory. Hell, this whole record is hypnotic in its shambolic, loose-wound, grooving glory. Just get it ","torrent":{"xt":"urn:btih:d02225036f2529635af3f4b1582fde3b7e34c07d","amp;dn":"Gurf+Morlix+-+Fishin%27+In+The+Muddy+%5B2002%5D+%5BEAC.Log%2CCue.FLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d02225036f2529635af3f4b1582fde3b7e34c07d","infoHashBuffer":{"type":"Buffer","data":[208,34,37,3,111,37,41,99,90,243,244,177,88,47,222,59,126,52,192,125]},"announce":[],"urlList":[]}}