{"title":"David M. Turner - Fashioning Adultery. Gender, Sex and Civility ","uid":10279878,"size":1771645,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d1b53ef632b48b5a0e5f74670970c58bd1c3eaa2&amp;dn=David+M.+Turner+-+Fashioning+Adultery.+Gender%2C+Sex+and+Civility+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Anette14","files":-1,"time":1401682103,"description":"Description\nProduct Details\nBook Title: Fashioning Adultery: Gender, Sex and Civility in England, 1660-1740 (Past and Present Publications)\t\nBook Author: David M. Turner\nSeries: Past and Present Publications\nHardcover: 252 pages\nPublisher: Cambridge University Press (September 16, 2002)\nLanguage: English\nISBN-10: 0521792444\nISBN-13: 978-0521792448\n\n===================================================================================\nBook Description\nPublication Date: September 16, 2002 | ISBN-10: 0521792444 | ISBN-13: 978-0521792448\nA major survey of representations of adultery in later seventeenth and early eighteenth-century England brings together a wide variety of literary and legal sources, it charts and explains shifts in the understanding of marital infidelity. It examines, in particular, challenges to religious perceptions of sexual sin and the development of a more rational understanding of the causes and consequences of adultery.\n\n===================================================================================\nReviews\n&quot;...anyone who seeks to study the Enlightenment marriage, divorce, illicit sex, or the class/economics grid of fornication--whether social or literary historian--will benefit from this useful study.&quot; Canadian Journal of History\n\n&quot;[Turner] presents in clear, crisp prose a series of tightly argued chapters, each organized around the discussion of a particular source genre...Turner has made an important, original contribution to eighteenth-century studies.&quot; William and Mary Quarterly\n\n&quot;Turner has scoured a wide variety of sources dealing with marital breakdown from popular plays and pamphlets to legal treatises and trial records to support his thesis.&quot; Renaissance Quarterly\n\n&quot;Turner's book is not only an important contribution to gender studies; it also furthers our understanding of the social history and class relations of eighteenth-century England.&quot; History\n\n&quot;An important contribution to our understanding of gender relations within the family. It particularly enhances our sense of men as husbands and lovers during a period that began to see the rising dominance of a middle-class, conjugal, domestic ideal, and provides a valuable addition to the growing historical literature on masculinity.&quot; Journal of Interdisciplinary Studies\n\n&quot;...insightful and compelling....&quot; H-Albion (H-Net)\n\n===================================================================================\nBook Description II\nThis book provides the first major survey of representations of adultery in later seventeenth- and early eighteenth-century England. Bringing together a wide variety of literary and legal sources - including sermons, pamphlets, plays, diaries, periodicals, trial reports and the records of marital litigation--it charts and explains shifts in understandings about marital infidelity, examining in particular challenges to religious perceptions of sexual sin and the development of a more rational understanding of the causes and consequences of adultery.\n\n===================================================================================\nAbout the Author\nDavid M. Turner is Lecturer in History, University of Glamorgan. He was educated at Oxford and Durham Universities, and was awarded the first Past and Present Society Postdoctoral Research Fellowship at the Institute of Historical Research, London. This is his first book.\n===================================================================================","torrent":{"xt":"urn:btih:d1b53ef632b48b5a0e5f74670970c58bd1c3eaa2","amp;dn":"David+M.+Turner+-+Fashioning+Adultery.+Gender%2C+Sex+and+Civility+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d1b53ef632b48b5a0e5f74670970c58bd1c3eaa2","infoHashBuffer":{"type":"Buffer","data":[209,181,62,246,50,180,139,90,14,95,116,103,9,112,197,139,209,195,234,162]},"announce":[],"urlList":[]}}