{"title":"Glee [1 al 13][Subtitulado].HDTV.XviD-FQM.[VTV].avi","uid":5250242,"size":3491886264,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:d235df7ef42cbe0a10d9f4c83e646ccfdb51bb8b&amp;dn=Glee+%5B1+al+13%5D%5BSubtitulado%5D.HDTV.XviD-FQM.%5BVTV%5D.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"eldiego90","files":-1,"time":1262308200,"description":"Glee. Episodios del 1 al 13 con subtÃƒÂ­tulos en espaÃƒÂ±ol latino. \n\n\n\n\n\nGlee es una comedia de televisiÃƒÂ³n , emitida por la cadena Fox. La trama se basa en la escuela preparatoria William McKinley, y los integrantes de un coro estudiantil, conocido como club Glee. El episodio piloto fue difundido despuÃƒÂ©s de American Idol el 19 de mayo de 2009 y el resto de la temporada, saliÃƒÂ³ al aire a partir del 9 de septiembre de 2009, en emisiones semanales consecutivas. El show fue creado por Ryan Murphy, Brad Falchuk e Ian Brennan, y al principio fue previsto como una pelÃƒÂ­cula en lugar de una serie de televisiÃƒÂ³n. Murphy selecciona toda la mÃƒÂºsica destacada dentro de la serie ÃƒÂ©l mismo, debido a la necesidad de organizar varias coreografÃƒÂ­as para los nÃƒÂºmeros musicales del espectÃƒÂ¡culo. La respuesta crÃƒÂ­tica fue repartida. Alejandra Stanley, del New York Times, destaca la falta de originalidad del piloto y los personajes estereotipados, pero elogia el talento para el teatro y el hecho de que los personajes se salen del molde. David Hinckley de Daily News opinÃƒÂ³ que el espectÃƒÂ¡culo era imperfecto e inverosÃƒÂ­mil, pero &quot;potencialmente conmovedor&quot;. Por su parte, Robert Bianco de USA Today seÃƒÂ±alÃƒÂ³ problemas de tono en las interpretaciones musicales, pero comentÃƒÂ³ positivamente sobre el humor del espectÃƒÂ¡culo y su funcionamiento. El 13 de diciembre del 2009 el American Film Institute anunciÃƒÂ³ la lista de los AFI Awards 2009, sus premios para las diez mejores pelÃƒÂ­culas y las diez mejores series de televisiÃƒÂ³n del aÃƒÂ±o que estÃƒÂ¡ por terminar; y Glee fue escogida como una de las series premiadas por la prestigiosa instituciÃƒÂ³n. Poco despuÃƒÂ©s, el 15 de diciembre se anunciÃƒÂ³ que Glee habÃƒÂ­a sido escogida como una de las cinco nominadas a Mejor Serie de TelevisiÃƒÂ³n - Comedia o Musical en los premios Globo de Oro del 2010; ademÃƒÂ¡s la serie obtuvo otras nominaciones, entre ellas las de mejor actor y mejor actriz en serie musical o de comedia para Lea Michele y Matthew Morrison.\n\n","torrent":{"xt":"urn:btih:d235df7ef42cbe0a10d9f4c83e646ccfdb51bb8b","amp;dn":"Glee+%5B1+al+13%5D%5BSubtitulado%5D.HDTV.XviD-FQM.%5BVTV%5D.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d235df7ef42cbe0a10d9f4c83e646ccfdb51bb8b","infoHashBuffer":{"type":"Buffer","data":[210,53,223,126,244,44,190,10,16,217,244,200,62,100,108,207,219,81,187,139]},"announce":[],"urlList":[]}}