{"title":"70Ã‚Âº AniversÃƒÂ¡rio da II Guerra Mundial- Pack 3 - Volumes 14,15,1","uid":5884863,"size":6960508288,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:d2a74790c9c62961120845dfcb86b2118e0a8d1c&amp;dn=70%C3%82%C2%BA+Anivers%C3%83%C2%A1rio+da+II+Guerra+Mundial-+Pack+3+-+Volumes+14%2C15%2C1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"eljrago","files":9,"time":1287025124,"description":"Description:\nExcellent collection of documentaries made by April in honor of the 70th anniversary of World War 2.\n70th Anniversary of World War II\n\n14. IN THE BATTLE\nNORTH AFRICA\n\n* Rommel JOIN THE FIGHT\nThe young general Erwin Rommel was Hitler's chosen powder\nto help his Italian ally and recover the north\nfrom Africa to the Axis powers.\n\n\n* TRAINS AND FOREST TARANTO\nin the first months of the war, the Allies had control of the Mediterranean\nguaranteed supply of oil from the Middle Measured to Britain.\nThe entrance of Italy into the war seemed to have changed the situation.\n\n\n* WHAT REALLY HAPPENED TO Rommel\nThe Field Marshal Erwin Rommel was nicknamed &quot;The Desert Fox&quot;\nfor his skill in military campaigns in North Africa. Your participation\nin the plot to assassinate the Fuhrer led to his tragic and premature end.\n15. NORTH AFRICA\nTHE SOUTH OF EUROPE\n\n* El-Alamein and TUNISIA\nA message deciphered the Enigma machine helped the allies defeat\narmy under the command of Erwin Rommel. She revealed the new plan\nattack of Desert Fox southeast of El-Alamein\n\n\n\n* LANDING IN SICILY AND ITALY\nIn January 1943, Britain and America have joined forces to invade\nItaly, seriously weakened by its failures in North Africa\nIt was necessary to decide where to begin the invasion: Sardinia or Sicily?\n\n\n* The man who deceives HITLER\nThe strategy to divert the enemy soldiers and saved hundreds of allies;\nbody of an officer arrived at the Spanish Mediterranean coast with information\nfalse on unemployment of allied troops. Hitler fell into the trap.\n\n\n16. The Tide\nBEGINS TO TURN\n\n* THE BOMBING ATTACK\nThe only way for Germany to beat England would strangle\ntheir supply routes by sea. For the Allies,\nthe solution of the counterattack was the aerial bombardment\n\n\n\n* The REICH IN FLAMES\nAfter the success at Stalingrad, Field Marshal Zhukov. Army Commander\nSoviet established the German Army Group A as objective,\nIn the Caucasus. In early December 1942, troops\nSoviet were already about 190 km from Rostov.\n\n\n\n\n* MEN LIGHT GERMANY\nAn elite force of allied bombing night was trained\nto mark strategic points with signal fires\ncolored in a highly dangerous mission.\n\n\n\n17. THE WOLVES\nSEA\n\n* THE UNDERWATER BEAT RECESSION\nBeing an island, Britain was a problem for\nGerman Army ground forces. Hitler planned to use their\nassault ships against merchant ships to stop\noil supplies and food to the English.\n\n\n\n* Taming the packs WOLVES\nIn addition to extremely agile German submarines on the surface\ncould approach and attack suddenly submerged. The fleet\nBritish merchant was obliged to travel in convoys\n\n\n\n* Battleship\nAt the beginning of World War II, battleships were considered\nfundamental to the fighting at sea. In the course of the conflict,\nunder the threat of submarines and aircraft, their role has changed\n\n18 ROLL\nCOMPRESSOR\nSOVIET\n\n* DEATH OF A FLEET OF FIGHTING\nIn December 1941, Hitler declared war on the United States.\nThen the German Admiral Karl DÃƒÂ¶nitz sent submarines to attack\nAmerican merchant ships, destroying more than 400 in three months\n\n\n\n* THE LIBERATION OF MOTHER RUSSIA\nIn the summer of 1943, on the eastern front, the Russians forced the Army\nGerman to retreat. Hitler's troops also fought on the Western Front\nand Stalin used the German weakness to increase their offensive.\n\n\n\n* THE GAME BOMBING\nBy 1944, the borders allies moved quickly to the east\nAnd to the west of Europe. It was the movement - the key fighter-bombing unit\nDesigned to carry bombs and rockets and launch them into flight.\n\n\n19 KILLINGS\n\n* RELEASE Leningrad\nIn early 1944, Leningrad completed two and half years of\nresistance to German attack, with half a million dead by starvation.\nLife in the city had reached unbearable limits\n\n\n\n* THE BATTLES IN UKRAINE\nIn the spring of 1944, Hitler's armies were in retreat\nThe Soviets had twice as many tanks they told the Germans\nSiberia and the factories were producing 2,000 units per month\n\n\n\n* THE MAN WHO STOOD HITLER\nIn July 1944, Colonel Claus von Stauffenberg managed\nexplode a bomb, a few meters from Hitler. Stauffenberg\nValkyrie believed the plan worked.\n\n20 GERMANY\nKICKING\n\n* ADVANCE FOR POLAND\nIn the spring of 1944, Hitler gave no credit to the German secret services\nindicating major offensive of the Red Army in Belarus - Russia\nhe believed that Stalin wanted to take ownership of the Romanian oil.\n\n\n\n* FREEING THE BALKANS\nIn summer 1944, the Germans were expelled from the east. The Red Army\nWould remain south of Warsaw during the next five months, while\nPolish Nationalist Army fighting the Nazi occupiers\n\n\n\n* THE LAST SECRET WEAPONS OF JAPAN\nIn the winter of 1944, a number of cities and properties\nrural north America was threatened with a weapon\nsecretly sent across the Pacific by the Japanese.\n\n21 OPERATION\nOVERLORD\n\n* The Atlantic Wall\nIn early 1944, with his forces at bay in the direction of the border\nGerman, Hitler suspected but was not sure where and when\noccur to the attacks of allied forces in northwestern France\n\n\n\n* PLANNING THE D-DAY\nBritish commanders have drawn up a creative resource for\nfacilitate the landing: gigantic concrete box\nthat could be towed to the French coast\n\n\n\n* THE MEN BEHIND THE D-DAY\nTo minimize casualties in the Allied landing\nNormandy were employed double agents, weapons\nand special actions to mislead the enemy attention\n\n\n\n\nTHE BEACHES OF NORMANDY 22\n\n* The Longest Day\nAt dawn on June 6, 1944, British planes.\nreach the eastern part of Normandy\n\n\n\n* THE BATTLE FOR RECONSTRUCTION\nOn the second day of the greatest seaborne invasion, thousands of Allied soldiers\npenetrated within the plain Norman\n\n\n\n* ADVANCE FROM NORMANDY\nThe 9:30 am June 25, 1944, more than 1,800 Allied planes\nbombard the German front line south of Cherbourg.\n\n\n* GLIDERS\nGermans and British used gliders to transport\nParatroopers where the risk of anti-aircraft attack was imminent.\n\n\n\n\n\nSize: 6.48 GB\nFormat: DVDRip\nResolution: 620x480\nLanguage: - English\nLegend Type: Flush\nLanguage (s) Subtitles - Portuguese - Brazil\nOriginal title: 70th Anniversary of World War II\nGenre: Documentary\nCountry of Origin: - Brazil\nYear: 2009\nDuration: 50min per episode\nProduction: April colections\n\n\nby-NEWAGE Uploaders.\n\nPACK 2 = Look here=","torrent":{"xt":"urn:btih:d2a74790c9c62961120845dfcb86b2118e0a8d1c","amp;dn":"70%C3%82%C2%BA+Anivers%C3%83%C2%A1rio+da+II+Guerra+Mundial-+Pack+3+-+Volumes+14%2C15%2C1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d2a74790c9c62961120845dfcb86b2118e0a8d1c","infoHashBuffer":{"type":"Buffer","data":[210,167,71,144,201,198,41,97,18,8,69,223,203,134,178,17,142,10,141,28]},"announce":[],"urlList":[]}}