{"title":"Subtitles Tools (12 in 1) AIO","uid":4527557,"size":16109623,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:d37e4f3eb5c4681798747a9b855e0cc9bd3febd9&amp;dn=Subtitles+Tools+%2812+in+1%29+AIO&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mcfilthynasty","files":1,"time":1227416340,"description":" AVISubDetector 0.6.0.7\n\nAVISubDetector is a tool for extraction and recognition of hard-burned subtitles from various video sources.\n\nCellulo 2.0.1\n\nWorks on Mac OS X whereas VobSub is pretty much only for the PC.\n\nCellulo is based on QuickTime which is an essential part of the Mac OS X technologies, and nothing less than today&amp;#039;s most powerful multimedia architecture. Therefore, Cellulo inherits from QuickTime&amp;#039;s reliability, speed and versatility. As a result, you can open a wide range of files such as MPEG-1, MPEG-21, MPEG-4, DivX1, XVid1, QuickTime, H.264, DV, Flash, BMP, TIFF, PDF, MP3, AAC... And as QuickTime evolves, Cellulo does!\n\nDo you like iTunesÃ‚Â® playlists? You&amp;#039;ll love Cellulo! Use drag and drop to organize your media files the way you like and browse through them more easily than ever.\n\nCellulo brings full-screen video to your Mac. We mean, real full-screen. Macs come with good screens, so why should you have to stand those black bars around your favorite movie and watch it no larger than in a window? Resize your media in real-time and get rid of them. There&amp;#039;s no re-encoding. You don&amp;#039;t even have to leave full-screen mode.\n\nEach media file in Cellulo has its own information panel. You can browse through individual tracks, activate or deactivate them, and get or set all the information you need. Cellulo can also import subtitles from the most popular file formats and have them displayed over the movie. No setup required, just drop your subtitle file and watch the show.\n\n    * Universal Binary\n    * Script for the Linkinus IRC client\n    * Minor user interface changes\n\nDivX Subtitle Displayer 5.00\n\nDivX Subtitle Displayer is a program that can  display subtitles while playing DivX movies. It is easy to use and has many features, such as subtitle font settable, FPS changeable, movie play list, and so on. It supports almost all the popular subtitle format!\n\nDVDSubber Final 1.\n\nDVD Video disk can include more than 20 different subtitle language. However there is a lot of DVD that don&amp;#039;t even include one subtitle track. DVD Subber was created to display during playback subtitle track that aren&amp;#039;t include on the disk. There is lot of site on Internet where you can find subtitle script but playing them along with the DVD was always painful. You are forced to start from the beginning of the movie at a precise sync point,you can&amp;#039;t stop, pause, or fast-forward without completely loosing the synchronization between the subtitle and the movie. DVD Subber use the timecode of the DVD to synchronize the subtitle with the movie. You pause, fast forward, go to you favorite scene, the subtitle always will follow you. DVD Subber subtitling engine is more powerful than the standard DVD Video format, where DVD subtitle are limited to 4 colors, DVD Subber give you access to more than 16 millions colors You can even add effect to the subtitle like a shadow or an outline to enhance readability. DVD Subber is compatible with some of the most used subtitle script format like Sub Station Alpha V4, Jacosub and SAMI.\n\nSubAdjust 1.56\n\nAdjust and convert subtitle files. New version also supports many more file formats, error detection, AVI frame rate detection and splits subtitle files in 2 separate files with time adjustment of the second file - highly recommended\n\nSubCleaner 1.05b\nSubCleaner is able to clean a srt subtitle removing common formatting errors. This is useful for hardware DivX players that require subtitle files without errors.\n\n\nSUBmax 5.4\n\nSUBmax is a subtitle tool which is able to :\n\nSubtitle file usage\n- Opens and saves (converts) 55 different formats\n- Supports the new (CRC checked) format .SMX\n- Renders 9 different formats\n- All supported formats are 64\n\nRendering functions\n- Renders subtitle into image files\n- Built-in subtitle position editor\n- Supports all important image formats (BMP, TGA, TIF, JPG)\n\nFrame rate based subtitle usage\n- Uses all frame rates (not only formal rates!)\n- Converts between any frame rates\n\nTime based subtitle usage\n- Uses all fixed time based formats (milisecond, second, minute etc.)\n- Uses dynamic time based format (MPSub)\n- Converts between any time based subtitles\n\nInformation about subtitle\n- Shows detailed information about subtitle\n- Shows statistics about subtitle (distributions)\n\nSubtitle text/line manipulation\n- Shows errors and warnings and fixes them\n- Subtitle text conversions\n- Breaks and unbreaks subtitle lines by more ways\n\nSubtitle time manipulation\n- Adjusts subtitle time to movie\n- Linear adjuster\n- Expands delay\n- Limits duration\n- Auto duration\n\nSplitting/joining subtitle\n- Join subtitles to one file (from any number of subs)\n- Split subtitle to more pieces\n\nMovie playing functions\n- Previews movie file with subtitle (adjusting)\n- Plays movie on full screen with subtitle\n- Shows information about movie\n- Supports the most important video formats\n\nGeneral functions\n- Creates new subtitle (any format)\n- Creates media startup file (.asx, .smil)\n- Shows and edits the lines of subtitle\n- Saves and loads separately the text of subtitle\n- Adds effects to the subtitle\n- Supports subtitle translating\n- Supports charsets\n- Supports command-line parameters (opening and conversion also)\n- Supports subtitle english spell-checking (don&amp;#039;t need any other softw)\n- Calculates the fitte\n\nSubtitle Edit 1.8.8\n\nSubtitle Edit is an editor for MicroDVD, SubRip, and other subtitles.\n\nThe most used feature is probably &amp;#039;Visual Sync&amp;#039; where you can sync a subtitle with a movie - easily!\n\nOther Features:\n- Adjust all subtitle times\n- Adjust display time\n- Remove text for hear impaired\n- Convert between MicroDVD, SubRib, and more\n- Spell checker: English, Dutch (included with TJanSpeller)\n- Split / append subtitles\n\n\nSubtitle Workshop 4.00 beta 3\n\nSubtitle Workshop is the most complete, efficient and convenient freeware subtitle editing tool. It supports all the subtitle formats you need and has all the features you would want from a subtitle editing program.\n\nSubtitle Workshop makes subtitle creating/editing/converting tasks almost a pleasure, the amicable and intuitive interface mixes easy to access menus &amp; must have features with advanced functions and a remarkable speed and stability, drastically reducing subtitle editing time. It includes spell check function and an advanced video preview feature which will ease the task even more. The best choice for the beginner, expert or the fansubber. Have a try, and you&amp;#039;ll forget the rest!\n\nSubEdit Player build 4066\n\nSubEdit Player can handle almost all common audio/video formats (with the right codecs installed) and subtitles.\n\nTo use SubEdit, is recommended to install standard Windows Media Player 6.4 or higher. If the movie requires non standard codec (DivX ;-) for example), you have to install it manually.\n\n\n\n\nScanned with Kaspersky - Clean\n\nFor more proper up&amp;#039;s\n  &lt;a href=&quot;\nhttp://thepiratebay.se/user/mcfilthynasty&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/mcfilthynasty&lt;/a&gt;\n  &lt;a href=&quot;\nhttp://i396.photobucket.com/albums/pp47/mcfilthynasty/mysiggifgif.gif&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i396.photobucket.com/albums/pp47/mcfilthynasty/mysiggifgif.gif&lt;/a&gt;\n\nEnjoy\t\n","torrent":{"xt":"urn:btih:d37e4f3eb5c4681798747a9b855e0cc9bd3febd9","amp;dn":"Subtitles+Tools+%2812+in+1%29+AIO","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d37e4f3eb5c4681798747a9b855e0cc9bd3febd9","infoHashBuffer":{"type":"Buffer","data":[211,126,79,62,181,196,104,23,152,116,122,155,133,94,12,201,189,63,235,217]},"announce":[],"urlList":[]}}