{"title":"My Weekly Budget MyWB 0.0.1.5.2","uid":11929025,"size":1930586,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:d5b19f071c2f6a158e05d7e1589bafd4058e259e&amp;dn=My+Weekly+Budget+MyWB+0.0.1.5.2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"wearehidden","files":1,"time":1431758165,"description":" &lt;a href=&quot;https://play.google.com/store/apps/details?id=com.avocsoft.myweeklybudget&amp;hl=en_GB&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;https://play.google.com/store/apps/details?id=com.avocsoft.myweeklybudget&amp;hl=en_GB&lt;/a&gt;\n\nMy Weekly BudgetÂ® (MyWB) lets you focus on a simple spending target for the current week. Focusing week-by-week on keeping within a spending target helps you meet your budget, and saves you money over time. When using MyWB consistently, it is easy to stay within your means because you are being updated on your spending each time you buy something.\nThis App is easy to use and easy to understand. It is SIMPLE but powerful. First, set yourself a weekly budget target. Then enter your spending with a uniquely simple, straight forward interface and instantly see whether you are meeting your budget. MyWB also shows you how much of your set budget you have at any given day of the week. The goal of this App is to help you control your spending with minimal effort.\nThe App is flexible enough to allow you to customize features to match your needs. There is also a quick and easy way to flick through your spending patterns from previous weeks - so you can get a clear view of where you have been spending your money.\nAt the end of each week, a brief summary for the week is presented showing how well (or badly?!) you have done against your target. Any money not spent may be carried over to the next week, so you can reward yourself with higher spending next week! Any money you received (birthday presents, cash-back on a pair of shoes you returned etc.) may also be added to your current week's spending plan if you choose.\nMyWB supports your local currency and several other international currencies. You can show the date format to your liking, organize spending in categories as broad or as focused as you want, and includes the option to make your own categories to show personalized descriptions of your spending.\nYou can also export your spending information from MyWB by email so you can use it in other applications on your computer.\nDo you find money slipping through your fingers? Not knowing where your hard-earned cash goes? Maybe you just need an occasional message to remind you what you were planning to spend this week? This is the App for you!\nFeatures:\n+ Enter a Weekly Budget for your Spending\n++ Choose which day is the first day of your week\n++ Select the money symbol you use, and your date format\n+ Quickly enter your purchases\n++ MyWB keeps track of your spending real-time\n++ Instant update of how much you have left to spend this week\n+ Simple, intuitive entry of each purchase\n++ Automatically records time of purchase\n+ Easy addition of money you have received\n++ Such as presents or money-back on returned items\n+ Customize MyWB by adding your own Categories\n++ Create a Favorites list\n++ Quickly search your Categories\n+ Modify purchase information\n++ Allows you to correct errors\n++ Input past or future purchases - adjust the date/time to the correct values\n+ View a week-by-week History of your spending\n++ Sort the list by Date, Price, Alphabetically, or even Group similar items together\n+ At the end of each week, MyWB reminds you how well you achieved your Budget!\n+ Optionally carry-forward any over-spend or under-spend to the next week\n++ Adjusts your spending for next week!\n+ Export information\n++ Send the file by email\n++ You can import this file to other applications on your computer (e.g. Excel, Numbers etc.)\n &lt;a href=&quot;\nhttp://makeitfappen.pw&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://makeitfappen.pw&lt;/a&gt; for more of my releases and direct downloads and streams\n&amp; http://animes.ga for my anime and manga uploads!","torrent":{"xt":"urn:btih:d5b19f071c2f6a158e05d7e1589bafd4058e259e","amp;dn":"My+Weekly+Budget+MyWB+0.0.1.5.2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d5b19f071c2f6a158e05d7e1589bafd4058e259e","infoHashBuffer":{"type":"Buffer","data":[213,177,159,7,28,47,106,21,142,5,215,225,88,155,175,212,5,142,37,158]},"announce":[],"urlList":[]}}