{"title":"Medicines For Women (2015).pdf Gooner","uid":12622273,"size":8950033,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d5c553eb296ef46d4e4ea61035c81f4f9c95f22c&amp;dn=Medicines+For+Women+%282015%29.pdf+Gooner&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"GoonerTPB","files":1,"time":1445619981,"description":"Publisher: Adis; 2015 edition (January 29, 2015)\r\nLanguage: English\r\nISBN-10: 3319124056\r\nISBN-13: 978-3319124056\r\n\r\nIn this definitive new text, the major medicines, devices and vaccines used by women worldwide are brought together for the first time in a single volume. Written and edited by international experts with an evidence-based approach, the book offers a comprehensive summary of all the key areas of women’s medicines. In the first part, issues relating to female drug exposure and considerations for prescribing for subgroups of women - for example during pregnancy and lactation - are presented in the context of contemporary clinical practice. In the second part, specific groups of pharmaceutical products are reviewed, including oral contraceptives, emergency contraception, treatment of chronic pelvic pain, hormone replacement therapy, bisphosphonates, herbal medicines for women, contraceptive devices and human papilloma virus (HPV) vaccines.  Every chapter reviews and summarises the efficacy and safety of each group of products and concludes with a useful set of clinical take home messages. In the third part, broader perspectives are presented - from a primary care overview of prescribing for women, through to regulatory, political and religious aspects, including issues with women’s medicines in developing countries. The final two chapters focus on risk communication and conclude that women themselves should be placed at the centre of all discussions about their medicines.\r\n\r\nThe book is aimed at prescribers, other healthcare professionals and students in the field of women’s health throughout the world. It is an extremely valuable resource for all in clinical practice, for students of medicine, nursing, pharmacy and related sciences, and also for those in medicines regulation, pharmacovigilance and the pharmaceutical industry","torrent":{"xt":"urn:btih:d5c553eb296ef46d4e4ea61035c81f4f9c95f22c","amp;dn":"Medicines+For+Women+%282015%29.pdf+Gooner","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d5c553eb296ef46d4e4ea61035c81f4f9c95f22c","infoHashBuffer":{"type":"Buffer","data":[213,197,83,235,41,110,244,109,78,78,166,16,53,200,31,79,156,149,242,44]},"announce":[],"urlList":[]}}