{"title":"Malayalam Film Veeraputhran LotusEQ - 350mb - PDVDRip","uid":6873795,"size":372054202,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:d6055b80201e26cda93b81c65b14c1ceb72b5daa&amp;dn=Malayalam+Film+Veeraputhran+LotusEQ+-+350mb+-+PDVDRip&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mallumvz123","files":6,"time":1323345151,"description":"Cast: Naren, Sarath Kumar, Raima Sen, Jagathy Sreekumar, Siddique \n\nDirector: P T Kunjumohammed \n\nCinematography: M G Radhakrishnan \n\nStory/Writer: N P Muhammed\n\nKunhi Mohammed makes it amply clear at the beginning of the film Veera Puthran, that his film isn't an exact replication of history, but rather a creative piece in which imagination has been blended with reality. Perhaps an anticipatory bail as this does give the film maker the liberty to adopt a stand that need not necessarily conform to the scruples of creating a historical.\n\nVeera Puthran tells the story of renowned freedom fighter Mohammed Abdul Rahiman, and his struggle against the British empire. Rahiman (1898 - 1945) in Kunhi Mohammed's film, is shown waging a war of his own in Malabar for the freedom of his country, with the major movements of the day reconstructed as a backdrop - the KPCC Convention, Khilafat Movement and the Salt Sathyagraha, to mention just a few.\n\nThe film is based on a story by NP Mohammed, and it's a surprise that Rahman's heroism is somewhat restricted to the title. Because in the film, we get to see him more as a romantic, who was head over heels in love with his wife Kunhi Beevathu (Raima Sen). Rahiman is depicted as being devastated by her untimely demise, and is literally haunted by her memories. ","torrent":{"xt":"urn:btih:d6055b80201e26cda93b81c65b14c1ceb72b5daa","amp;dn":"Malayalam+Film+Veeraputhran+LotusEQ+-+350mb+-+PDVDRip","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d6055b80201e26cda93b81c65b14c1ceb72b5daa","infoHashBuffer":{"type":"Buffer","data":[214,5,91,128,32,30,38,205,169,59,129,198,91,20,193,206,183,43,93,170]},"announce":[],"urlList":[]}}