{"title":"Wyrmstooth 1_11","uid":10451140,"size":102519675,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:d641bb4ac9b6fc40dfc1ddb5fd9ae2944c516427&amp;dn=Wyrmstooth+1_11&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Jonx0r","files":3,"time":1404020162,"description":"Storyline\n\nThe East Empire Company commissions the Dragonborn to slay a dragon that is interrupting trade routes throughout Skyrim. But is the dragon stirring up trouble with a particular reason and is there something more sinister behind it?\n\nAn immersive new quest that takes you across Skyrim to the large island of Wyrmstooth. Battle across new landscapes and through new dungeons in this unofficial expansion.\n\nThe quest begins for players at level 10 and above after you have been summoned by the Greybeards. Theodyn Bienne, an imperial courier, will track you down starting from the Bannered Mare in Whiterun and will deliver to you an important message. The task seems simple enough; slay a dragon that's stirring up trouble. But things don't go that easily...\n\n\n\nFeatures\n\nA challenging new quest with an exciting dragon battle.\nFight your way through one of the biggest dungeons in Tamriel with a group of followers.\nMind-control a Draugr to solve a unique dungeon puzzle!\n30+ new npc's.\n17 new quests; 2 main quests and 15 side quests.\nA large new handcrafted landmass with its own unique map and map markers!\nOver 200 lines of new recorded voice acting.\nMake a new player home out of an abandoned imperial fort.\nPlaceable bear traps sold by Ja'Shavi-Dar.\nPlayable bard instruments found across the island.\nUnlocks some cut content such as the shout Fiik Lo Sah (Phantom Form).\nLearn new spells such as Conjure Draugr and many more.\nNew harvestable ingredients.\nCustom music tracks.\n\n\n\nFAQ\n\nQ. What patch level is required?\nA. You should be running 1.8 or higher.\n\nQ. Do I need Dawnguard, Hearthfire or Dragonborn to play Wyrmstooth?\nA. No, neither of these are required to play Wyrmstooth.\n\nQ. Do I need any other additional mods or plugins like SKSE?\nA. No, nothing else is required except Skyrim.\n\nQ. What ENB did you use to take the screenshots?\nA. For the screenshots I used K ENB.\n\nQ. I really liked this mod, what can I do to show my support?\nA. Tell your friends about it, endorse and vote it on Nexus Mods so others can share in the adventure. I also accept Donations on PayPal.\n\nQ. Is the mod stable?\nA. The mod has been tested extensively and is completable. There are no show-stopping bugs with the mod itself however your Skyrim configuration and any other mods you have installed may affect the stability of Wyrmstooth.\n\nQ. Is development of Wyrmstooth complete?\nA. Yes.\n\nQ. How much time did you spend working on Wyrmstooth?\nA. About 1600 - 1700 hours.\n\nQ. What can I do with the Wyrmstone and Brimestone ore?\nA. Originally I had planned to add new craftable weapons and armors however smithing material categories are hardcoded and the filesize of Wyrmstooth is already at the maximum size permissible on Steam.\n\nQ. Can I mod Wyrmstooth?\nA. You may make mods that use Wyrmstooth.esp as a master but you may NOT modify the Wyrmstooth.esp or Wyrmstooth.bsa files themselves.\n\n\n\nNexusmods: http://www.nexusmods.com/skyrim/mods/25704/?\nSteam:","torrent":{"xt":"urn:btih:d641bb4ac9b6fc40dfc1ddb5fd9ae2944c516427","amp;dn":"Wyrmstooth+1_11","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d641bb4ac9b6fc40dfc1ddb5fd9ae2944c516427","infoHashBuffer":{"type":"Buffer","data":[214,65,187,74,201,182,252,64,223,193,221,181,253,154,226,148,76,81,100,39]},"announce":[],"urlList":[]}}