{"title":"Eagles - Dirty Laundry (Don Henley) [Farewell 1 Tour, 2004 HD].m","uid":11918024,"size":342812790,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:d7ee620316daa4472bae2a9b6d4da98532143604&amp;dn=Eagles+-+Dirty+Laundry+%28Don+Henley%29+%5BFarewell+1+Tour%2C+2004+HD%5D.m&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"SgtRlee","files":1,"time":1431576981,"description":"Eagles - Dirty Laundry (Don Henley) [Farewell 1 Tour, 2004 HD].mkv\n\n\nHD 720p live performance music video from a promo Bluray disc with DTS core audio. &quot;Dirty Laundry&quot; is a hit song written by Don Henley and Danny Kortchmar, from Henley's debut solo album I Can't Stand Still, released in 1982. The song hit #1 on the Billboard Top Album Tracks chart in October 1982, prior to being issued as a 45. Lyrically, the song describes mass media sensationalism and yellow journalism, featuring sound effects such as ringing phones and cameras taking pictures.\n\nReleased as the second single from I Can't Stand Still, it spent four weeks at #3 on the Billboard Hot 100 in early 1983. The single was quickly certified Gold by the Recording Industry Association of America, representing sales of over one million records in the US.\n\nThe song is about the callousness (and callowness) of TV news reporting as well as the tabloidization of all news. Henley sings from the standpoint of a news anchorman who &quot;could have been an actor, but I wound up here&quot;, and thus is not a real journalist. The song's theme is that TV news coverage focuses too much on negative and sensationalist news; in particular, deaths, disasters, and scandals, with little regard to the consequences or for what is important (&quot;We all know that crap is king&quot;). The song was inspired by the intrusive press coverage surrounding the deaths of John Belushi and Natalie Wood, and Henley's own arrest in 1980. Lines in the second verse, &quot;Is the head dead yet?&quot;, actually comes from journalism lingo, and refers to the major headline story being ready to post or print. If a head is dead, it has already been set and is being printed or created, and it is now too late to make changes to the story.\n\nAmong the musicians on the record were Timothy B. Schmit and Joe Walsh, two of Henley's Eagles bandmates. Walsh performs the first guitar solo, followed by Steve Lukather of the band Toto; the guitar basic tracks are played by Danny Kortchmar who also helped Henley composing this song. The late Jeff Porcaro (also of Toto) plays the drums on this track.\n\nIn the Eagles' Farewell 1 Tour Live from Melbourne concert DVD, Henley (speaking for the band) dedicated this song &quot;to Mr. Rupert Murdoch&quot;; in many live performances, this dedication remains, but sometimes is changed &quot;to Mr. Bill O'Reilly&quot;. The song was also used in the 2004 documentary Outfoxed as well as in the shorts for the 1995 movie To Die For. The song was performed on the Eagles' Long Road Out of Eden tour in 2008. During the song, a background video shows, among other things, clips from The O'Reilly Factor, Glenn Beck, and The Jerry Springer Show.\n(video does not have any logos)\n\n\n    &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Dirty_Laundry_(Don_Henley_song)&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Dirty_Laundry_(Don_Henley_song)&lt;/a&gt; \n      &lt;a href=&quot;\nhttp://postimg.org/image/k4yoq5xqj/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://postimg.org/image/k4yoq5xqj/&lt;/a&gt; \n   \n\n\nFile properties info using Media Player Classic:     \n   Video: MPEG4 Video (H264) 1280x720 29.97fps 5612kbps\n   Audio: DTS 48000Hz 6ch 1536kbps [DTS core, 24 bits]\n   Duration: 00:06:17\n\n\n\n\n*Install the &quot;Media Player Classic&quot; player if you can't play this file, \nor for better visual and audio quality playback of all your videos. \nIt's 100% free to download and use. Latest stable build is v1.7.8\n\n*Media Player Classic Home Cinema*         &lt;a href=&quot;\nhttp://mpc-hc.org/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://mpc-hc.org/&lt;/a&gt; \n\nSgtRlee (Sgt.R.Lee)","torrent":{"xt":"urn:btih:d7ee620316daa4472bae2a9b6d4da98532143604","amp;dn":"Eagles+-+Dirty+Laundry+%28Don+Henley%29+%5BFarewell+1+Tour%2C+2004+HD%5D.m","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d7ee620316daa4472bae2a9b6d4da98532143604","infoHashBuffer":{"type":"Buffer","data":[215,238,98,3,22,218,164,71,43,174,42,155,109,77,169,133,50,20,54,4]},"announce":[],"urlList":[]}}