{"title":"Santapprentice S01E14 The Big Exam TVRip.XviD-err0001","uid":9389504,"size":104736978,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:d9580fcedd5cf8bcd89a1c31d4d01949262eaa81&amp;dn=Santapprentice+S01E14+The+Big+Exam+TVRip.XviD-err0001&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"err0001","files":2,"time":1387856845,"description":"Santapprentice S01E14 - The Big Exam \n\nNicolas is tall enough to take the test of the Golden Reindeer. In the middle of the night, he and Waldorf have to set out on a search for a mysterious tree that only grows on the other side of the ice sea. From its branches he must weave his first Christmas basket, which will be examined by the Council of Wise Men, that is all the previous Santas gathered together for the occasion. They will decide whether or not he qualifies for his Golden Reindeer.\n\nThis animated series aired on YTV in Canada in late 2011. According to imdb, this series was first released in Germany in Nov 2006.  There are 50 episodes, but unfortunately I don't have all of them. This series appears to be the inspiration for the movie Santa's Apprentice (2010).\n\nYou can leave me comments at kickass or thepiratebay.\n\nSeries info (from alphanim.com):  Every 163 years, it's time to find a replacement for Santa Claus. The rule is that any Santa should retire after 178 years of good and loyal service. 15 years before Santa leaves, the Christmas elves go out to find the ideal candidate for the position. It must be an orphan named Nicolas who is pure of heart. That is how Nicolas Barnworth is whisked out of Australia and brought to the North Pole. He has 15 years to learn the tricks of the &quot;Santa Claus&quot; trade. He needs to master such skills as dropping down chimney flues, driving the sleigh, delivering gifts and inventing new toys. Nicolas will discover that Santa has a lot on his plate, each and every day and not only at the end of the year. Luckily Humphrey, the chief elf, Waldorf, the reindeer and Rufus, the little polar bear are more than ready to help.\n\n--- File Information --- \nFile Name:            Santapprentice.S01E14.The.Big.Exam.TVRip.XviD-err0001.avi\nFile Size:            104,734,720 bytes\n\n--- Video Information --- \nCodec:                XVID\nDuration:             12:29.123\nFrame Width:          512\nFrame Height:         384\nFramerate:            29.970 fps\nBitrate:              996 kbps\n\n--- Audio Information --- \nCodec:                0x0055 MPEG-1 Layer 3\nSample Rate:          48000 Hz\nBitrate:              108 kbps\nBitrate Type:         VBR\n","torrent":{"xt":"urn:btih:d9580fcedd5cf8bcd89a1c31d4d01949262eaa81","amp;dn":"Santapprentice+S01E14+The+Big+Exam+TVRip.XviD-err0001","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d9580fcedd5cf8bcd89a1c31d4d01949262eaa81","infoHashBuffer":{"type":"Buffer","data":[217,88,15,206,221,92,248,188,216,154,28,49,212,208,25,73,38,46,170,129]},"announce":[],"urlList":[]}}