{"title":"Hawkman v4 (May 2002-2006)","uid":4144832,"size":809729316,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:d964b49b9b360dc9f02a068bdac73074e56a9ea9&amp;dn=Hawkman+v4+%28May+2002-2006%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"gilgamesh07","files":71,"time":1208676806,"description":"By request from the forums\n\nThis torrent contains Hawkman v4 and Hawkgirl.\n\nHawkman first appeared in Flash Comics # 1 (1940), and was a featured character in that title throughout the 1940s. This Hawkman was Carter Hall, a reincarnation of an ancient Egyptian prince, Khufu, who had in the modern day discovered that the mysterious &quot;ninth metal&quot; could negate the effects of gravity and allow him to fly. He donned a costume with large wings to allow him to control his flight and became the crimefighter, Hawkman. An archaeologist by trade, Hall uses ancient weapons from the museum of which he was curator in his efforts.\n\nDuring the miniseries Identity Crisis it was established that Carter Hall had voted for the mindwipe of Dr. Light (indeed, he had been the one to initially suggest the idea) and it is from this that his enmity with Green Arrow stems (as he felt mental reprogramming beyond the scope of any vigilante group&amp;#039;s rights, and, in fact, those of any government).\n\nWith this new continuity, Hawkman was again reincarnated and given a new series in 2002 entitled Hawkman, written by James Robinson and Geoff Johns, with art by Rags Morales. However in 2006, the series was retitled Hawkgirl with issue #50 and given new creative team Walter Simonson and Howard Chaykin. This series has been cancelled with Hawkgirl issue #66 in July 2007.\n\nThanks to the scanners and the original sources.\n\nPlease seed. Please enjoy.","torrent":{"xt":"urn:btih:d964b49b9b360dc9f02a068bdac73074e56a9ea9","amp;dn":"Hawkman+v4+%28May+2002-2006%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d964b49b9b360dc9f02a068bdac73074e56a9ea9","infoHashBuffer":{"type":"Buffer","data":[217,100,180,155,155,54,13,201,240,42,6,139,218,199,48,116,229,106,158,169]},"announce":[],"urlList":[]}}