{"title":"HBO Comedy (1981) Pee-Wee Herman (NOT the kid's show!)","uid":4954559,"size":523867335,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:db260c35f8e92257952e2fc56801924e67565689&amp;dn=HBO+Comedy+%281981%29+Pee-Wee+Herman+%28NOT+the+kid%5C%27s+show%21%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"rambam1776","files":-1,"time":1245045446,"description":"HBO Comedy (1981) Pee-Wee Herman\n\nVideo Codec..........: XviD ISO MPEG-4\nVideo Bitrate........: 1074kbps\nDuration.............: 58:39.318\nResolution...........: 512*384\nFramerate............: 29.970\n\nAudio Data:\n\nAudio Codec..........: 0x0055 MPEG-1 Layer 3\nAudio Bitrate........: 102 kbps VBR\nAudio Channels.......: 2\n\nFile Data:\n\nFilename.............: HBO Comedy Special - PeeWee Herman.avi\nFilesize.............: 523,597,824\n\n\nCULTURAL NOTES - The &quot;Mekka-lekka-hi, Mekka-Hiney-ho&quot; bit featured on a few FAMILY GUY episodes comes from this comedy special. The featured actors were all members of the famous comedy sketch group THE GROUNDLINGS, many of whom later went on to fame with SCtv, SATURDAY NIGHT LIVE, and RENO 911.\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0081915/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0081915/&lt;/a&gt;\n &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/The_Pee-wee_Herman_Show&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/The_Pee-wee_Herman_Show&lt;/a&gt;\n\nThe Pee-wee Herman Show is a stage show developed by Paul Reubens in 1980. It marks the first significant appearance of his comedic fictional character, Pee-wee Herman, five years before Pee-wee's Big Adventure, and six years before Pee-wee's Playhouse. The act initially took place at the Groundlings theater, but in time it was moved to Los Angeles' The Roxy Theatre, where the HBO cable network taped one of the shows and aired it in 1981. This nightclub show had more adult humor than the later children's TV series.\n\nDevelopment\n\nThe roots of that stage show were in 1981 when Reubens was one of 22 finalists to be chosen as a regular on Saturday Night Live (the famous first season of an all-new cast, and one of five seasons without Lorne Michaels as a producer). Reubens lost to actor Gilbert Gottfried and thought his career was over. According to Reubens, he was about to return home when he came up with the idea of a stage show featuring the character he premiered back in 1977, Pee-wee Herman. That year, the character had made his first appearance to a national (but mostly adult) audience when he made a cameo in Cheech &amp; Chong's Next Movie. With $3,000 (mostly money wired from his parents), and help from 60 people working for him (including his fellow Groundling Phil Hartman), Reubens created the show.\n\nPlotline\n\nThe Pee-wee Herman Show begins with the same routine of &quot;show &amp; tell&quot; toy demos that Reubens did as Pee-wee when he premiered the character four years earlier (before he started to tell jokes).\n\nAt home in his Puppetland playhouse, Pee-wee entertains his audience of &quot;boys &amp; girls&quot; in an homage to low budget 1950s TV kiddie-shows such as Howdy Doody and Pinky Lee.\n\nPee-wee spends the day with his friends and fellow citizens of Puppetland (including Pterri the pterodactyl, Mr. Knucklehead, Captain Carl, Miss Yvonne, Jambi the genie in a box, Clockey the USA wall-map/clock, Randy the Rascal, Mailman Mike, Hammy and his sister Susan, Hermit Hattie, and the singing next door neighbors Mr. and Mrs. Jelly Do-nut).\n\nPee-wee really wants to be able to fly after given a wish by Jambi the genie, but he decides to give his wish away to Miss Yvonne who wants Captain Carl to &quot;really like her&quot; and think she's &quot;beautiful from head to toe&quot;.\n\nDuring the course of his busy day, Pee-wee sings &amp; dances, reads pen pal letters &quot;from around the world&quot; (including prison), conducts a hypnosis puppet act with a female audience member who undresses under his command, and shows cartoons and a vintage &quot;Mr. Bungle&quot; 1950s educational film about good manners.\n\nLater, Pee-wee gets upset that he unselfishly gave away his magic wish when he sees Captain Carl and Miss Yvonne happily on a date. After much pouting and throwing a tantrum, Pee-wee finally runs away.\n\nThe concerned citizens of Puppetland find out about Pee-wee's secret wish and after Captain Carl reveals that he had already liked Miss Yvonne to begin with, they all realize that Pee-wee still has a wish coming. Jambi the genie then grants Pee-wee's wish to be able to fly.\n\nPee-wee triumphantly soars and &quot;roars&quot; above Puppetland and proclaims that he is the &quot;luckiest boy in the world.&quot;\n\nCast (Originally members of the Groundlings)\n\n* Pee-wee Herman - Paul Reubens\n* Mailman Mike - John Moody\n* Jambi - John Paragon\n* Hammy - Tito Larriva\n* Mr. &amp; Mrs. Jelly Donut - Brian Seff, Monica Ganas\n* Captain Carl - Phil Hartman\n* Miss Yvonne - Lynne Marie Stewart\n* Joan - Joan Leizman\n* Hermit Hattle - Edie McClurg\n","torrent":{"xt":"urn:btih:db260c35f8e92257952e2fc56801924e67565689","amp;dn":"HBO+Comedy+%281981%29+Pee-Wee+Herman+%28NOT+the+kid%5C%27s+show%21%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"db260c35f8e92257952e2fc56801924e67565689","infoHashBuffer":{"type":"Buffer","data":[219,38,12,53,248,233,34,87,149,46,47,197,104,1,146,78,103,86,86,137]},"announce":[],"urlList":[]}}