{"title":"CooolSoft Power Flac Cd Maker v6.1 Multilingual (1-click run) (r","uid":8010184,"size":7495250,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:dc03e74bd5b5706cf079f53873ac4a74f02816cf&amp;dn=CooolSoft+Power+Flac+Cd+Maker+v6.1+Multilingual+%281-click+run%29+%28r&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"The_Duck1","files":-1,"time":1357979130,"description":"No need to install,\nNo need to put serials and cracks to get the full version, (already done it for you).\nNo unnecessary registry changes,\nNo boring installation of tool-bars in your browser,\nThis makes a 1-click run version a better version.\n\nPower Flac Cd Maker is a powerful tool to convert your music to CD directly, specially for flac or ape flawless compressed music files. You can use it to make your own music CD just like the origin CD, it have fastest CD making speed, and no extra disk space needed while converting, all is done in your memory.\n\nSupported music format:\n\nConvert from : wav mp3 wma CD-audio ogg ape wmv asf m4a m2a mp2 mpg mp1 mpga mpa mpx mp4 mpc rm flac shn tta wv ac3 aac aiff amr\nConvert to : wav mp3 wma ogg ape mp2 m2a\nBurn CD\n\nMain features of Power Flac Cd Maker:\n\nDirect Cd Making: no extra disk space needed.\nMost familiar audio format support: Now supports mp3, wma, wav, ogg, ape, asf(audio part), wmv(audio part) and CD audio format, and it will keep on adding.\nCD Ripping: can rip CD into mp3, wma, wav, ogg, ape files directly. And it even can burn another CD directly at the same time, that is, direct copy of CD audio files is supported. Power MP3 WMA Converter also supports CDDB auto searching.\nAPE flac and CUE index support: can divide APE format with CUE files into several separate sound track according the information in CUE files.\nPart conversion of one audio file support: can convert part of one audio file according to the desired conversion start position and length. And this can be done batching.\nCombine of several audio files support: can combine several seleted files into one with the disired format.\nPlayback support: can play the file in the converter list. This is an effective assistance to audio conversion and CD burning.\nPowerful function of tag information edit support: supports the fast modification of file tag information, and it also support the simultaneous edit of several audio files's tag information. You can rename the files as the tag information. By supporting ID3V1/V2 it can make the management of files clear and easy.","torrent":{"xt":"urn:btih:dc03e74bd5b5706cf079f53873ac4a74f02816cf","amp;dn":"CooolSoft+Power+Flac+Cd+Maker+v6.1+Multilingual+%281-click+run%29+%28r","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dc03e74bd5b5706cf079f53873ac4a74f02816cf","infoHashBuffer":{"type":"Buffer","data":[220,3,231,75,213,181,112,108,240,121,245,56,115,172,74,116,240,40,22,207]},"announce":[],"urlList":[]}}