{"title":"MC5 - Helsinki, Finland 17-11-1972 (PRO)DVD","uid":9417671,"size":2517553152,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:dc09b828786f287b1216118305e246196b5da501&amp;dn=MC5+-+Helsinki%2C+Finland+17-11-1972+%28PRO%29DVD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"hellstorm79","files":-1,"time":1388490531,"description":"MC5 - Live 1972-11-17 Helsinki,Finland Kulttuuralo (Pro-shot DVD)\n\n\n\n\n\nPublisher: Unknown\nReference :\nDate :2010\nMade In :\nQuality :Pro-shot b&amp;w\nBooklet &amp; packaging :Black &amp; white DVD case artwork, basic menu\nTotal duration: 69:10\n\n\nSet :\n\nRamblin`rose\nI want you right now\nGloria\nLooking at you\nLet it rock \nLouie louie\nKick out the jams\n\n\n\n\n\n\n\nComments\n\n\n\nThe MC5 live at the Kulttuuralo, Helsinki, Finland, on 17 November 1972. Presumably recorded for Finnish TV (in black and white, which seems odd, as colour TV was introduced in the UK in the late 1960s, and it would be surprising if northern Europe was far behind), there is a time counter at the bottom of the screen througout - the picture is, well, it looks like old TV footage! The sound is very good. This European tour came at near the end of the road for the band, which would perform its last show a few weeks later at the Grande Ballroom, site of their triumphant shows recorded for the incandescent &quot;Kick out the Jams&quot; album in 1968 - but the last show, on New Year's Eve 1972, was a dispirited affair to a very small crowd, with one of the band leaving well before the end to go off and get a fix. Anyway, back to this one. After touring and recording in Europe a few times that year with indifferent success, two of the band baulked at yet another trip, leaving only Fred &quot;Sonic&quot; Smith and Wayne Kramer to keep the flag flying (bass player Michael Davis had been sacked earlier). Dave Hughes had joined the band on a semi-permanent basis on bass, and Jay Scharma joined the tour on drums - as Hughes later put it (in the &quot;Testimonial&quot; doscumentary), &quot;it was the MC2, plus one, plus one&quot;. Wayne Kramer reminisced in the same documentary that these shows were the pits, with having to sing lead vocals in Rob Tyner's absence, and not even knowing some of the words, having never sung lead vocals before. The show plods early on, but it does pick up for the last two or three songs. But pro-shot MC5 footage being almost as rare as rocking-horse shit, it's hard to pass up on something like this...\n\n\n\nENJOY MY FRIENDS...","torrent":{"xt":"urn:btih:dc09b828786f287b1216118305e246196b5da501","amp;dn":"MC5+-+Helsinki%2C+Finland+17-11-1972+%28PRO%29DVD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dc09b828786f287b1216118305e246196b5da501","infoHashBuffer":{"type":"Buffer","data":[220,9,184,40,120,111,40,123,18,22,17,131,5,226,70,25,107,93,165,1]},"announce":[],"urlList":[]}}