{"title":"Big Chief - Drive It Off (1991)","uid":4104384,"size":43956692,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:dcacdeb4a63fc91dd17acb8f61c806df5e2c73cb&amp;dn=Big+Chief+-+Drive+It+Off+%281991%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"nakiel","files":11,"time":1206731506,"description":"Big Chief - Drive It Off (1991)\n\n01 Brake Torque\n02 Glare\n03 Blowout Kit\n04 Iron Pimp\n05 Get Down And Double Check\n06 Crackwhore\n07 Chrome Helmet\n08 Built Like An Ordeal\n09 Superstupid\n\n\nBig Chief stretched their dollar provided from Sub Pop -- intended for use to record one Singles Club release -- to record the clutch of tracks collected on Drive It Off. These were originally released as singles through various labels, and Pennsylvanian indie Get Hip did the honors by compiling them for portable listening. With each release that followed, this disc became increasingly developmental sounding, since the band grew considerably from here on out. Aside from some Blaxploitation samples, there&amp;#039;s little hint of the funk influence that would eventually infiltrate their sound. This is basically balls-to-the-wall post-hardcore rock, subtracting the thrash tendencies of vocalist Barry Henssler&amp;#039;s Necros and replacing that with Black Sabbath and Blue Cheer without the blues influence. So it&amp;#039;s Black Cheer. These nine songs deliver the goods quite well, but they don&amp;#039;t sound terribly distinct when lined up against any number of late-&amp;#039;80s/early-&amp;#039;90s post-hardcore bands. Riffs get used to their full potential, pounded into the ground and battered to oblivion. Not much soloing is offered, save for some gnashing Wayne Kramer-like passages in &quot;Superstupid.&quot; Henssler&amp;#039;s inchoate howling ably fits the Ford Lake shore sludge knocked out by his cronies, but his range would expand considerably throughout the remainder of the band&amp;#039;s discography.","torrent":{"xt":"urn:btih:dcacdeb4a63fc91dd17acb8f61c806df5e2c73cb","amp;dn":"Big+Chief+-+Drive+It+Off+%281991%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dcacdeb4a63fc91dd17acb8f61c806df5e2c73cb","infoHashBuffer":{"type":"Buffer","data":[220,172,222,180,166,63,201,29,209,122,203,143,97,200,6,223,94,44,115,203]},"announce":[],"urlList":[]}}