{"title":"BBC Why Poverty 1 of 8 Four Born Every Second 2012 XviD.2","uid":7892673,"size":734871379,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:dcdb4c75915abee67b486a8e84c363792f6614ba&amp;dn=BBC+Why+Poverty+1+of+8+Four+Born+Every+Second+2012+XviD.2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"e8hffff","files":2,"time":1354762906,"description":" &lt;a href=&quot;http://www.bbc.co.uk/programmes/p010jxky&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.bbc.co.uk/programmes/p010jxky&lt;/a&gt;\n\n130 million babies are born each year, but the circumstances and country of \ntheir birth will determine their life story. Brian Hill travels from the UK to \nAmerica, Cambodia and Sierra Leone to reveal the shocking lottery of child \nbirth across the globe.\n\nIn Sierra Leone - the worst country to be born in terms of infant mortality - \nwe meet Hawa, who is expecting her fifth baby, as well as the MSF obstetricians \nworking to reduce the infant and maternal mortality rate. However for some of \nthe women arriving at the Gondama Referral Centre with complications, they will \nalready be too late.\n\nIn Cambodia, babies are more likely to grow up malnourished than attend high \nschool. We meet Neang, 36, and her 12-year-old son Pisey who helps support his \npregnant mother and little sister by scavenging the streets. \n\nIn the UK - where four million children live in poverty - we follow single mum, \nLisa, 22, who is expecting her second child. She is reluctant to be a \n'stereotypical mum on benefits' and wants to work to provide for her children. \nHowever with her childcare costs at Â£1,400 per month, her options are limited. \n\nIn America, the infant mortality rate has worsened over the last 20 years. In \nSan Francisco, we meet expectant mother Starr, her partner and two children. A \nyear ago, they became homeless, making her children among the 1.6 million homeless children now living in the US.\n\nPoignant and sobering, the film features scenes of stillbirths and shocking \nstatistics about infant mortality. \n\nA BBC Storyville film, produced in partnership with the Open University, Four \nBorn Every Second screens as part of Why Poverty? - which sees the BBC and the \nOU, in conjunction with more than 70 broadcasters around the world, host a \ndebate about contemporary poverty.\n","torrent":{"xt":"urn:btih:dcdb4c75915abee67b486a8e84c363792f6614ba","amp;dn":"BBC+Why+Poverty+1+of+8+Four+Born+Every+Second+2012+XviD.2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dcdb4c75915abee67b486a8e84c363792f6614ba","infoHashBuffer":{"type":"Buffer","data":[220,219,76,117,145,90,190,230,123,72,106,142,132,195,99,121,47,102,20,186]},"announce":[],"urlList":[]}}