{"title":"Street Fighter Anniversary Collection ps2  ntsc","uid":4892357,"size":3407834673,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:ddb77d54c5feb74d9fae092a3859c9fd4a27892b&amp;dn=Street+Fighter+Anniversary+Collection+ps2++ntsc&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"thenoobish","files":4,"time":1242068626,"description":"Plataforma: PS2\nIdioma: English\nRegion: NTSC\nCalidad: DVD\nFormato: MDF-MDS\nTamaÃƒÂ±o: 3.33 GB\nFecha: 20-12-2006\nUploader: tico80 \n\nPara celebrar el 15th aniversario de la primera versiÃƒÂ³n casera de Street Fighter II, Capcom nos ha sorprendido gratamente con el relanzamiento en conjunto de los mejores juegos que ha tenido su clÃƒÂ¡sica y veterana franquicia.\n\nAquÃƒÂ­ disponemos de cada versiÃƒÂ³n del inmortal Street Fighter II junto con el mejor juego de lucha que pasÃƒÂ³ por la difunta Dreamcast, el genial Street Fighter 3: 3rd Strike, todo junto en un solo pack Ã‚Â¿No os produce una enorme sonrisa de felicidad?\n\nPero no podemos jugar por separado a cada una de las versiones de Street Fighter II, en vez de eso los programadores muy inteligentemente unificaron cada versiÃƒÂ³n en una sola. Por ejemplo veras luchar entre sÃƒÂ­ al Ken del Street Fighter II: Champion Edition contra una Cammy del Super Street Fighter II. El problema principal es que esta diferenciaciÃƒÂ³n es solo en estilo, y se podrÃƒÂ­a decir que no ha sido suficientemente aprovechada, ya que el modo arcade es bÃƒÂ¡sicamente el mismo del Street Fighter II: Turbo con la adiciÃƒÂ³n de los viejos personajes, lo que produce una cierta sensaciÃƒÂ³n de descompensaciÃƒÂ³n e inconcordancia con los escenarios. A cambio ahora existe una opciÃƒÂ³n de elegir el estilo de pelea de cada personaje, esto sin duda hace que podamos re-jugar el tÃƒÂ­tulo sin llegar a aburrirnos.\n\nPor otro lado el Street Fighter 3: 3rd Strike se ve excelente y se juega tan bien como en la versiÃƒÂ³n arcade, en gran parte gracias al Dual Shock 2. La combinaciÃƒÂ³n de los viejos y nuevos juegos de Street Fighter hacen que los jugadores, en especial los nuevos, aprecien como ha evolucionado la saga con el paso del tiempo.\n\nComo bonus esta incluida la pelÃƒÂ­cula anime de Street Fighter II: The Movie, pero, al venir en el mismo disco junto a los 2 juegos, la calidad de reproducciÃƒÂ³n no estÃƒÂ¡ a la altura de la versiÃƒÂ³n original, aunque, para ser sinceros, solo unos pocos notarÃƒÂ¡n la diferencia, y vamos, Ã‚Â¡es un gran extra!. TambiÃƒÂ©n estÃƒÂ¡ doblada al ingles.","torrent":{"xt":"urn:btih:ddb77d54c5feb74d9fae092a3859c9fd4a27892b","amp;dn":"Street+Fighter+Anniversary+Collection+ps2++ntsc","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ddb77d54c5feb74d9fae092a3859c9fd4a27892b","infoHashBuffer":{"type":"Buffer","data":[221,183,125,84,197,254,183,77,159,174,9,42,56,89,201,253,74,39,137,43]},"announce":[],"urlList":[]}}