{"title":"The Rules of Work: A Definitive Code for Personal Success","uid":8430017,"size":846008,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ddeea4cd690f28ad9346559b68c9fabfe4fa374d&amp;dn=The+Rules+of+Work%3A+A+Definitive+Code+for+Personal+Success&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mdusanjay","files":-1,"time":1367468161,"description":"\nRichard Templar, &quot;The Rules of Work, Expanded Edition: A Definitive Code for Personal Success&quot;\nEnglish | 2010 | ISBN: 0137072066 | 272 pages | PDF | 1 MB\n\nSome people are simply great at their job. They always seem to say the right thing; do the right thing. They are mentioned in every conversation. Everybody likes them. They get promoted. They get pay rises. They get along with the boss.\n\nAnd somehow, they do all these things without being unpleasant, breaking much of a sweat or seeming to put in excess effort. And when they are offered another step up the corporate ladder or a fabulous new job, no one is surprised. After all, they have 'potential' written all over them. How do they do it? Do they know some secret we don't? Yes, they know The Rules of Work. These rules aren't about how to do your job, day-to-day (assuming you are pretty good at that already).\n\nThe Rules of Work are about how you are seen to be doing it. They are about how you appear to others. And they are about helping you to achieve the success you richly deserve. The first edition of The Rules of Work became a global phenomenon, topping bestseller charts around the world. This new, even better, edition includes 10 brand new rules to take you further, faster. These rules are the guiding principles that will improve both what you do and how you do it, giving you the unmistakable air of confidence that will win you admiration, respect, and the next promotion. With The Rules under your belt you'll have the edge in everything you do, without having to compromise your principles.\n","torrent":{"xt":"urn:btih:ddeea4cd690f28ad9346559b68c9fabfe4fa374d","amp;dn":"The+Rules+of+Work%3A+A+Definitive+Code+for+Personal+Success","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ddeea4cd690f28ad9346559b68c9fabfe4fa374d","infoHashBuffer":{"type":"Buffer","data":[221,238,164,205,105,15,40,173,147,70,85,155,104,201,250,191,228,250,55,77]},"announce":[],"urlList":[]}}