{"title":"Esbjorn Svensson Trio - Live in Hamburg - 2CD 2007","uid":6649544,"size":752642805,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:dea504a1879f04f740e95c9eaa9e590dd73a4edb&amp;dn=Esbjorn+Svensson+Trio+-+Live+in+Hamburg+-+2CD+2007&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"barber9","files":-1,"time":1315081346,"description":"What is there to say about this piano/bass/drums trio that hasn't been said before? What, after nearly 15 years at the cutting edge of European jazz improvisation can they offer an audience already so familiar with their canon that their world tours sell out and their albums top the jazz charts all around the globe? Well, that of course is the beauty of improvisation. Everything they do is new, everytime, in every place. So this 2006 world tour of their last album, Tuesday Wonderland, is both a record of that record but also something more - much more. The gig in Hamburg, features their trademark stretching out, re-inventing and re-interpreting of their own work.\n\nIn the studio, these three men can use the full panoply of studio effects to add to their basic sound. But it is on stage, even with effects pedals as advanced as they are now, that they really show just what they are about. Stunning musicianship, allied to an almost telepathic understanding. Frequently described in terms more akin to a rock band than a jazz trio, this band are simply, uniquely, stunning. The elegant piano of Esbjorn Svensson is up there with the best that this genre has to offer - from Horace Silver to Thelonius Monk and to Keith Jarrett. Mixed with the skittering but oh-so-controlled drumming of Magnus Ostrom and the dynamic fuzztone bass of Dan Berglund you get an overwhelming, hypnotic, visceral experience.\n\nIt would be invidious to single out any particular track for special attention - that's not how an e.s.t. gig works - and the 10 tracks on these two cds are more than a collection of tunes. They form an organic whole, 3 minds and hearts beating together in the moment. Best to let the power and grace wash over you and carry you away - to forget the pointless questions as to whether this is jazz or rock or anything inbetween. From the subtle stylings of Svensson on Tuesday Wonderland the hypnotic, repetitive effects-laden Definition Of A Dog there is both power and grace aplenty on this album. Each player follows where another leads, constantly pushing and probing to find a harmony - a very muscular, very male, harmony to be sure - that is genuinely moving. I wish I had been in Hamburg that night in 2006, but fortunately I can join them now. You should come along too. \n(Guy Hayden, bbc.co.uk)\n\n\n\nEsbjÃƒÂ¶rn Svensson Trio - E.S.T. live in Hamburg 2007\n(2CD MÃƒÂ¼nchen Act)\n\n 1. Tuesday wonderland \n 2. The rube thing  \n 3. Where we used to live \n 4. Eighthundred streets by feet \n 5. Definition of a dog \n 6. The goldhearted miner \n 7. Dolores in a shoestand \n 8. Sipping on the solid ground  \n 9. Goldwrap \n10. Behind the Yashmak\n\n\nEsbjÃƒÂ¶rn Svensson, piano \nDan Berglund, bass\nMagnus OstrÃƒÂ¶m, drums\n","torrent":{"xt":"urn:btih:dea504a1879f04f740e95c9eaa9e590dd73a4edb","amp;dn":"Esbjorn+Svensson+Trio+-+Live+in+Hamburg+-+2CD+2007","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dea504a1879f04f740e95c9eaa9e590dd73a4edb","infoHashBuffer":{"type":"Buffer","data":[222,165,4,161,135,159,4,247,64,233,92,158,170,158,89,13,215,58,78,219]},"announce":[],"urlList":[]}}