{"title":"Refugee Health Care - An Essential Medical Guide","uid":12833735,"size":13146006,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:df052dfde12f77f539cf4a474552c060a297177c&amp;dn=Refugee+Health+Care+-+An+Essential+Medical+Guide&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1448416837,"description":"Refugee Health Care - An Essential Medical Guide (Springer, 2014).pdf\r\n\r\nRefugees arrive in the United States from different parts of the world and their numbers increase every year. Refugees undergo a medical screening soon after arrival, as recommended by the U.S. Department of State, and it is often primary care practitioners or psychiatrists who usually evaluate these patients at this first visit. Though physicians receive a variable amount of training in cross-cultural medicine, virtually none is in the area of refugee evaluations. Refugee evaluations are different from routine patient evaluations in several significant ways: 1) They are new immigrants from countries where the disease epidemiology is different from the U.S.; 2) Certain infectious disease processes need to be ruled out upon arrival to prevent the spread of communicable diseases; 3) The prevalence of mental health disorders in refugees is higher than the local population; 4) The medical and psychiatric health problems of refugees are often caused or affected by their past experience with trauma and their current acculturation difficulties; and 5) Significant cultural barriers can arise in the accurate evaluation and treatment of these refugees. Books on refugee health usually are written from ecological and public health perspectives and address generic refugee population issues. There are very few clinical textbooks, and most focus only on mental health. Refugee Health Care is a practical guide providing focused information for busy primary care practitioners, and many of the recommendations in the book apply to all immigrants. This concise pocketbook reviews medical and psychiatric conditions that are essential to know in the evaluation and treatment of refugees","torrent":{"xt":"urn:btih:df052dfde12f77f539cf4a474552c060a297177c","amp;dn":"Refugee+Health+Care+-+An+Essential+Medical+Guide","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"df052dfde12f77f539cf4a474552c060a297177c","infoHashBuffer":{"type":"Buffer","data":[223,5,45,253,225,47,119,245,57,207,74,71,69,82,192,96,162,151,23,124]},"announce":[],"urlList":[]}}