{"title":"Concerning the Spiritual in Art (Kandinsky Repost).pdf","uid":13711048,"size":16030201,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:df1da92a503a328b895e654252614c3cc937dd18&amp;dn=Concerning+the+Spiritual+in+Art+%28Kandinsky+Repost%29.pdf&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"STBGD","files":1,"time":1456871878,"description":"Wassily Kandinsky: Concerning the Spiritual in Art\r\nDover Publications | 1977 | ISBN 0486234118 | English | 116 pages | PDF | 15.3 MB\r\n\r\nA pioneering work in the movement to free art from its traditional bonds to material reality, this book is one of the most important documents in the history of modern art. Written by the famous nonobjective painter Wassily Kandinsky (1866–1944), it explains Kandinsky's own theory of painting and crystallizes the ideas that were influencing many other modern artists of the period. Along with his own groundbreaking paintings, this book had a tremendous impact on the development of modern art. Kandinsky's ideas are presented in two parts. The first part, called &quot;About General Aesthetic,&quot; issues a call for a spiritual revolution in painting that will let artists express their own inner lives in abstract, non-material terms. Just as musicians do not depend upon the material world for their music, so artists should not have to depend upon the material world for their art. In the second part, &quot;About Painting,&quot; Kandinsky discusses the psychology of colors, the language of form and color, and the responsibilities of the artist. An Introduction by the translator, Michael T. H. Sadler, offers additional explanation of Kandinsky's art and theories, while a new Preface by Richard Stratton discusses Kandinsky's career as a whole and the impact of the book. Making the book even more valuable are nine woodcuts by Kandinsky himself that appear at the chapter headings. This English translation of Über das Geistige in der Kunst was a significant contribution to the understanding of nonobjectivism in art. It continues to be a stimulating and necessary reading experience for every artist, art student, and art patron concerned with the direction of 20th-century painting","torrent":{"xt":"urn:btih:df1da92a503a328b895e654252614c3cc937dd18","amp;dn":"Concerning+the+Spiritual+in+Art+%28Kandinsky+Repost%29.pdf","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"df1da92a503a328b895e654252614c3cc937dd18","infoHashBuffer":{"type":"Buffer","data":[223,29,169,42,80,58,50,139,137,94,101,66,82,97,76,60,201,55,221,24]},"announce":[],"urlList":[]}}