{"title":"101 Quick and Easy Ideas from Master Photographers{BBS}","uid":6870980,"size":16539602,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:dfdede5a0600795855e951bead049eb84245e928&amp;dn=101+Quick+and+Easy+Ideas+from+Master+Photographers%7BBBS%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bigbluesea","files":-1,"time":1323274203,"description":"If you've ever found yourself looking at a photograph in a museum or gallery and thinking, &quot;I can do that,&quot;this is the book for you. 101 QUICK AND EASY IDEAS TAKEN FROM THE MASTER PHOTOGRAPHERS OF THE TWENTIETH CENTURY shows you how to recognize and use the techniques of some of the great photographers of the last century. Each chapter of the book focuses on one photographer, and includes a brief biography that highlights what life experiences influenced his or her work, as well as descriptions of one or several iconic images they photographed that include the key photographic elements that apply to that work - light, shadow, narrative, and symbolism. Along with the descriptions are recreations of the images that use similar subject matter and settings, as well as the steps to help you compose and manipulate your own version of the image. As you work through the book you'll find that the same concepts and themes were used by many of the photographers, but the meanings change as their work is shaped as the events, technology, and environment changed throughout the twentieth century. Arranged alphabetically, 101 QUICK AND EASY IDEAS TAKEN FROM THE MASTER PHOTOGRAPHERS OF THE TWENTIETH CENTURY, features photographers you'll easily recognize and some that are new to you, such as Ansel Adams, Dorothea Lang, Robert Mapplethorpe, Berenice Abbott, Heri Cartier-Bresson, and many more. By learning about and trying the common photography concepts and techniques used by famous photographers you'll enhance your photographic skill set and hopefully find inspiration and ideas for your own work.\n\n\n# Paperback: 232 pages\n# Publisher: Course Technology PTR; 1 edition (December 15, 2009)\n# Language: English\n# ISBN-10: 1435454367\n# ISBN-13: 978-1435454361","torrent":{"xt":"urn:btih:dfdede5a0600795855e951bead049eb84245e928","amp;dn":"101+Quick+and+Easy+Ideas+from+Master+Photographers%7BBBS%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dfdede5a0600795855e951bead049eb84245e928","infoHashBuffer":{"type":"Buffer","data":[223,222,222,90,6,0,121,88,85,233,81,190,173,4,158,184,66,69,233,40]},"announce":[],"urlList":[]}}