{"title":"Outboxx- (2013)   Projeto Chernobyl","uid":8409024,"size":113362573,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:e06868c91bf5eb5b6a6d35f87429d463b45411f9&amp;dn=Outboxx-+%282013%29+++Projeto+Chernobyl&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"klinho","files":11,"time":1366869901,"description":"A full-length has felt like Outboxx's natural next step for a while. In just 18 months, Jacob Martin and Matt Lambert have effortlessly and playfully explored plenty of ground, from ebullient house to serene electro to downbeat sci-fi fare, largely on labels with a Bristol postcode but drawing influence from much further afield. This album for Idle Hands feels like a natural compendium of everything Outboxx has done before (though one very much in two halves). Authentically lo-fi and analogue but at the same time very precise in its animating melodies and lingering keys, it seems like this LP was written with the sofa in mind as much as the session, not least because the opener is called &quot;Home.&quot; It's an inviting one that recalls the pure bliss of Nightmares On Wax, drifting along on plucked bass as a starry sky unfolds above. From there the steps grow more strident. &quot;All The Right Moves&quot; is similarly relaxed, before the golden, levitating house of lead single &quot;Jaded&quot; finally kicks you into dancing action. Outboxx have never been afraid of camp, and the exultant bounce of &quot;Sunshine Mills&quot; proves that resoundingly at the midpoint before the moods and grooves turn more cerebral and introverted in the second half. The arrangements remain spacious and uncluttered, though, with plenty of room for poignant atmospheres to percolate. \n\nTracklist:\n\n01 Home\n02 All The Right Moves \n03 Jaded\n04 Sunshine Mills\n05 Jewel City\n06 Lost Soul\n07 Thrashing Groovester\n08 Withdrawal\n09 My Destination","torrent":{"xt":"urn:btih:e06868c91bf5eb5b6a6d35f87429d463b45411f9","amp;dn":"Outboxx-+%282013%29+++Projeto+Chernobyl","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e06868c91bf5eb5b6a6d35f87429d463b45411f9","infoHashBuffer":{"type":"Buffer","data":[224,104,104,201,27,245,235,91,106,109,53,248,116,41,212,99,180,84,17,249]},"announce":[],"urlList":[]}}