{"title":"Evil_Islands_OSX_Intel","uid":9547720,"size":511390706,"categoryP":"games","categoryS":"mac","magnet":"?xt=urn:btih:e19b4f46eea312760165fe9d0e1d8deb84c66058&amp;dn=Evil_Islands_OSX_Intel&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"evilfoundnation","files":1,"time":1391166616,"description":" Evil Islands\nVersion: - Wineskin 2.5.12\n\nMac Platform: Intel\nIncludes: K\n\nOS version: 10.6.8\nProcessor type(s) &amp; speed: Intel Core Solo 1.6 Ghz\nRAM minimum: 2 GB\nVideo RAM: 64 MB\n\nLink for more information: http://www.mobygames.com/game/windows/evil-islands-curse-of-the-lost-soul\n\n\nDescription\n\nThere is trouble in the land of Gipath. Legends tell of the Chosen One that will come and save its inhabitants. However, they didn't think he'd appear as a mere boy with blond hair and grey pantaloons... This boy, whose name is Zak, finds himself dazed and confused in a middle of some ruins. Without any idea who or where he is, he must travel between three islands in search of his identity, with plenty of tasks to accomplish.\n\nEvil Islands: Curse of the Lost Soul is a fantasy role-playing game with real-time combat and stealth elements. The player-controlled party can support up to three people, which are for the most part fixed for scripting reasons. The gameplay focuses on outwitting the enemies by crawling or sneaking to backstab and surprise them, or pickpocketing a valuable item from an unsuspecting victim. Magic is also prominently featured, as many of the enemies are best met with a fire bolt or a lightning strike at long range. The gallery of enemies varies from orcs, wizards and skeletons to mighty dragons, lizards and cyclops.\n\nThis game also features blueprints which allow players to create their own armor, weapons and other accessories, provided they possess the required materials. There are several types of materials with various characteristics. The player is responsible for equipping every character in the party with items gained from travels and combat.\n\n\n\nNotes:\nSet resolution is 1280x800. CD-check has been compromised. Video\nplayback has been fixed. Nothing was ripped. Other widescreen\nresolutions are supported. Rendering issues have been fixed. Multiplayer\nhas not been tested.\n\nKnown Issues:\nNone as of yet.","torrent":{"xt":"urn:btih:e19b4f46eea312760165fe9d0e1d8deb84c66058","amp;dn":"Evil_Islands_OSX_Intel","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e19b4f46eea312760165fe9d0e1d8deb84c66058","infoHashBuffer":{"type":"Buffer","data":[225,155,79,70,238,163,18,118,1,101,254,157,14,29,141,235,132,198,96,88]},"announce":[],"urlList":[]}}