{"title":"The.Falcon.and.the.Snowman.(1985).xvid","uid":7410626,"size":811143976,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:e3477aa521082a8681b5a94ac8cfe230d78c115e&amp;dn=The.Falcon.and.the.Snowman.%281985%29.xvid&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"00rimme","files":6,"time":1341373096,"description":"\nSean Penn and Timothy Hutton Star in this Cold War era drama. Based on a true story.\n\nThe Falcon and the Snowman\n\nJohn Schlesinger directed this fact-based drama - adapted from Robert Lindsay s bestseller of the same title -- about two Californians, friends since boyhood, who are caught selling government secrets to the Soviet Union. Christopher Boyce (Timothy Hutton) is an all-American boy, studying for the priesthood in a seminary. But Boyce decides to drop out of school, and with the help of his father (Pat Hingle), a FBI agent, he gets a job working for the CIA in a message-routing center.\n\n While reading the messages, Boyce is shocked to learn that the CIA is involved in fixing Australian elections. Watching the Watergate hearings on television, he feels an ever-mounting sense of outrage at the arrogance of the U.S. government and decides to do something about it. Deciding to supply the CIA messages to the Russians, he enlists his childhood friend Daulton Lee (Sean Penn) to help him. Lee is to deliver the CIA secrets to a Russian operative (David Suchet) at the Soviet Embassy in Mexico City. But Lee is an unreliable drug dealer, and his sloppy spy trail leads the two old friends into more trouble than they bargained for.\n\n\n\nFresh and invigorating political thriller. An exercise in vagueness. A smart, nuanced spy thriller that's all about the gray areas.","torrent":{"xt":"urn:btih:e3477aa521082a8681b5a94ac8cfe230d78c115e","amp;dn":"The.Falcon.and.the.Snowman.%281985%29.xvid","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e3477aa521082a8681b5a94ac8cfe230d78c115e","infoHashBuffer":{"type":"Buffer","data":[227,71,122,165,33,8,42,134,129,181,169,74,200,207,226,48,215,140,17,94]},"announce":[],"urlList":[]}}