{"title":"Pink - Get The Party Started","uid":4484296,"size":121393156,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:e582e6a990777d054b79260859a9daff87804c4f&amp;dn=Pink+-+Get+The+Party+Started&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"2nafish","files":-1,"time":1225703459,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 256 kbps\n\n\n&quot;Get the Party Started&quot; is a song by Pink, and was the first single from her second album, M!ssundaztood (2001). It became an international hit and reached the top ten in many countries.\n\nIt reached number four on the U.S. Billboard Hot 100, becoming Pink&amp;#039;s second biggest solo hit in the U.S. alongside &quot;Most Girls&quot; (2000), because in 2008 &quot;So What&quot; reached #1. It peaked at number two in the UK, where it was narrowly denied the top spot by the posthumous release of George Harrison&amp;#039;s &quot;My Sweet Lord&quot;. It reached number-one in Australia and on the United World Chart, and number-two in many European countries most notably Austria, Germany, Italy and Switzerland, being held off from the top position by Shakira&amp;#039;s smash hit &quot;Whenever, Wherever&quot;.\n\n&quot;Get the Party Started&quot; was certified gold in Australia, Austria, Germany, Sweden and Switzerland, and in Norway it received a platinum certification.\n\nThe song was nominated for a Grammy Award in 2003 in the category of &quot;Best Female Pop Vocal Performance&quot;, which it lost to Norah Jones&amp;#039;s &quot;Don&amp;#039;t Know Why&quot;. It won the award for &quot;Favourite Song&quot; at the Kids&amp;#039; Choice Awards of 2002, and at the MTV Europe Music Awards of 2002 it won the award for &quot;Best Song&quot;. &quot;Get the Party Started&quot; is often considered one of Pink&amp;#039;s signature songs.\n\nThe music video was shot by director Dave Meyers in Los Angeles. In the video Pink is showering and getting ready to go out, trying on different outfits. One of her friends picks her up, and they drive in a car headbanging to the music. They get out of the car and steal two skateboards from two boys, after which Pink falls off her skateboard because men in a car are whistling at her. The women arrive at the club but are refused entry by the bodyguard, so to get in they use a window washing platform to reach the top of the building. Inside the club the bartender is played by Linda Perry. Pink changes her clothes and starts to party, and at the end Pink dances with two other dancers. She takes off her earrings and necklace and gives it to a person. One of the dancers in the video is Kevin Federline, who subsequently became a back-up dancer for Britney Spears and was married to her. Gwen Stefani was also in this video.\n\nThe video was nominated at the 2002 MTV Video Music Awards for &quot;Best Pop Video&quot; and won the awards for &quot;Best Female Video&quot; and &quot;Best Dance Video&quot;.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:e582e6a990777d054b79260859a9daff87804c4f","amp;dn":"Pink+-+Get+The+Party+Started","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e582e6a990777d054b79260859a9daff87804c4f","infoHashBuffer":{"type":"Buffer","data":[229,130,230,169,144,119,125,5,75,121,38,8,89,169,218,255,135,128,76,79]},"announce":[],"urlList":[]}}