{"title":"Funderburk-Betrayal of America(Bush&amp;communist dictators)(1991)","uid":4454854,"size":1041162,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e6094f501e247ddb063a1310e995cb6b84888a71&amp;dn=Funderburk-Betrayal+of+America%28Bush%26communist+dictators%29%281991%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"red_gonzo","files":1,"time":1224432132,"description":"This is David B. Funderburk&amp;#039;s shocking book Betrayal of America - Bush&amp;#039;s Appeasement of Communist Dictators Betrays American Principles (1991) which exposes George Bush Sr.&amp;#039;s appeasement of communist dictators as part of a bigger plan for establishing a &quot;new world order&quot;. Funderburk, former US ambassador to Romania from 1981 to 1985, resigned out of frustration with the U.S. State Department&amp;#039;s policy of supporting communist dictator Nicolae Ceausescu. Even after his leave the State Department continued to criticize him but when the overthrow of Ceausescu occurred in December 1989, the whole world realized that the State Department was wrong and Funderburk has been right all along. In his books he warns audiences around the country that the U.S. Government, led by President Bush, is now propping up brutal dictators in China, Romania and the Soviet Union - in the same way that Bush and the State Department helped Ceausescu. His past criticism of U.S. foreign policy has proven to be deadly accurate. For that reason one may want to pay particularly close attention to his warnings in this book about George Bush&amp;#039;s dangerous courtship of Communist dictators like Deng Xiaoping and Mikhail Gorbachev. Instead of safeguarding U.S. national autonomy and defending the vital interests of its citizens, US government has rejected even a moral alliance with innocent people struggling for liberty in the Baltics, preferring instead to transfer our resources, our technology, and our moral capital to Marxist-Leninist despots in China, the USSR and too many other places. Being full of tangible evidence of the instrumentalities used by former US president Bush Sr. to promote the goals of a &quot;New World Order&quot;, Betrayal of America tells an invaluable story which provides the reader with a far-sighted warning regarding Communist deception and the tragedy of US government&amp;#039;s collaboration with the very forces which seek to deprive us of our freedom. 140 pages, some pictures. A must read for everyone.\n","torrent":{"xt":"urn:btih:e6094f501e247ddb063a1310e995cb6b84888a71","amp;dn":"Funderburk-Betrayal+of+America%28Bush%26communist+dictators%29%281991%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e6094f501e247ddb063a1310e995cb6b84888a71","infoHashBuffer":{"type":"Buffer","data":[230,9,79,80,30,36,125,219,6,58,19,16,233,149,203,107,132,136,138,113]},"announce":[],"urlList":[]}}