{"title":"20130110-Stossel-[The Business of Bad News].Fox News (replay).CF","uid":8016066,"size":274532522,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:e6a38dfd134985d078daf47945a297d37fe4909e&amp;dn=20130110-Stossel-%5BThe+Business+of+Bad+News%5D.Fox+News+%28replay%29.CF&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"skJGZV6z","files":-1,"time":1358103645,"description":"----------\n\nSTOSSEL - [The Business of Bad News] - Fox Business Network (via FNC replay)\n2013, January 10, Thursday\n\nXvid/MP3 AVI - encoded from medium quality ReplayTV stream\n\n----------\n\n[excerpted from John Stossel's blog:]\n\nWhen tragedy strikes, what do you do if your company is at the center of it?\n\nWhat if you manufacture the Bushmaster rifle? What if you run BP when it spills oil?\n\nOn this week's show, Rohit Bhargava and Fraser Seitel explain crisis management strategy, like how Apple handled Steve Jobs' illness, and how the company that makes Skittles reacted after Trayvon Martin was killed holding them.\n\nThe media exaggerate bad news. &quot;The Skeptical Environmentalist&quot; author, Bjorn Lomborg, addresses claims about genetically modified food, and global warming, as in this Newsweek article about &quot;The End of Pasta.&quot;\n\nJulie Gunlock of the Independent Women's Forum points out how the danger of BPA products has been overblown by activists.\n\nSome people earn money thanks to people's (often irrational) fear of bad news. Janet Nelson of Epicenter Supplies and Aton Edwards of the International Preparedness Network are entrepreneurs who recommend &quot;doomsday prepper&quot; products like &quot;bear repellant.&quot;\n\nCelebrities seem to live by a different standard. Sordid publicity makes them more famous. Just look at Kim Kardashian, or Lindsay Lohan, or Chris Brown. Kennedy, our show's special correspondent, and PR expert Howard Bragman explain why &quot;bad news&quot; affects careers differently in Hollywood.\n\nFinally, I'm grateful to Brian Doherty and Marianne Stebbins for reminding libertarians that our bad news - Ron Paul's defeat and Republicans' treatment of him - is just one step on the road to peace, freedom, and sound money.","torrent":{"xt":"urn:btih:e6a38dfd134985d078daf47945a297d37fe4909e","amp;dn":"20130110-Stossel-%5BThe+Business+of+Bad+News%5D.Fox+News+%28replay%29.CF","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e6a38dfd134985d078daf47945a297d37fe4909e","infoHashBuffer":{"type":"Buffer","data":[230,163,141,253,19,73,133,208,120,218,244,121,69,162,151,211,127,228,144,158]},"announce":[],"urlList":[]}}