{"title":"Softheap 1st Security Agent v10.0 with Key [TorDigger]","uid":8134342,"size":2014877,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:e6f595db90ca98532e9efadbbde423286cb6ef3b&amp;dn=Softheap+1st+Security+Agent+v10.0+with+Key+%5BTorDigger%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"TorDigger","files":10,"time":1360683790,"description":"1st Security Agent\n\n1st Security Agent is an excellent password-protected security utility to secure Windows-based computers. It works under any Windows platform and offers an administrative support for controlling which users are allowed to access your computer and the level of access each user may have. You can choose to restrict access to lots of Control Panel applet functions, including Display, Network, Passwords, Printers, System, Add/Remove Programs, etc. You can also assign separate system profile folders to each user, providing each with their own custom Desktop, Start Menu, Favorites, My Documents, etc. Additionally, you can: disable Start Menu items, lock local, network and USB drives, disable the DOS prompt, boot keys, real DOS mode, Registry editing, taskbar, task manager, and network access, hide desktop icons, and much more. You can apply password protection to Windows and restrict users to running specific applications only. Security restrictions can be applied universally or just to specific users. 1st Security Agent also supports Internet Explorer security that enables you to customize many aspects of the Internet Explorer Web browser. It lets you disable individual menu items, prevent others from editing your Favorites, disable individual tabs in the Internet Options dialog, as well as specific settings from each tab. 1st Security Agent allows you to import and export PC security settings, and offers a flexible and complete password protection. You'll find the program interface very easy to negotiate. Excellent online help is available. Try our password and security tools.\n\nSupported OS:\n\nWindows 9x/ME\nWindows NT4\nWindows 2000\nWindows XP\nWindows 2003\nWindows Vista\nWindows 7\n\nHomepage: http://www.softheap.com/newadmin.html\n\nInstallation Instructions:\n\n- Install program.\n- Register application with given key.\n- Done, Enjoy.\n\nHave A Nice Day\n\nNote: Uploader is only responsible if any problem in torrent, never responsible for software functionality problems.","torrent":{"xt":"urn:btih:e6f595db90ca98532e9efadbbde423286cb6ef3b","amp;dn":"Softheap+1st+Security+Agent+v10.0+with+Key+%5BTorDigger%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e6f595db90ca98532e9efadbbde423286cb6ef3b","infoHashBuffer":{"type":"Buffer","data":[230,245,149,219,144,202,152,83,46,158,250,219,189,228,35,40,108,182,239,59]},"announce":[],"urlList":[]}}