{"title":"Constantine [Ntsc], Ps2","uid":5156804,"size":1839376634,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:e767a5e4ba2d2203bcaab018146b45ac02bac3c7&amp;dn=Constantine+%5BNtsc%5D%2C+Ps2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"Big_dude","files":-1,"time":1257896482,"description":"Constantine for the Ps2                                           Rel. 02/14/2005\n\n\nFormat:        DVD5 NTSC-USA\nLang.:         English\nDiscs:         1\nImage:         MDS/ISO\nRating:        M (Mature)\nGenre.:        Sci-Fi Action Adventure\nRequirements:  Modded/Chipped Ps2 or Swap Magic Disc Method. \n\n\nCompressed with 7Zip, Game was tested and works. \n\n\nNote: No Ps2 backup disc/game or copy will work unless your Ps2 Console is Modded \n      (allows playing of backups), or if you use Swap Magic.\n\n\n\nYou could try the homebrew exploit to (Free Mc Boot - Also known as soft modding for ps2), if your ps2 system isn't hard modded with a chip or if Swap Magic isn't working as a last resort. There are ps2 emulators but its not 100% &amp; the quality isn't as good as playing your game on your ps2 console.\n\nIf your using swap magic and don't have a flip top, you'll need to first\nremove the front cover of the disc tray for use of the slide card.\n\nHere's a link for how to remove the front cover...\n         &lt;a href=&quot;\nhttp://www.modchipstore.com/support/index.php?_m=knowledgebase&amp;_a=viewarticle&amp;kbarticleid=49&amp;nav=0,2&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.modchipstore.com/support/index.php?_m=knowledgebase&amp;_a=viewarticle&amp;kbarticleid=49&amp;nav=0,2&lt;/a&gt;\n\nAnd here's some links on using the slide tool to open the tray to swap in your ps2 copy or backup game.\n         &lt;a href=&quot;\nhttp://www.swapmagic3.com/slide-tool/Instructions.htm&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.swapmagic3.com/slide-tool/Instructions.htm&lt;/a&gt;\n        &lt;a href=&quot;\nhttp://forums.afterdawn.com/thread_view.cfm/340944&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forums.afterdawn.com/thread_view.cfm/340944&lt;/a&gt;\n        &lt;a href=&quot;\nhttp://forums.afterdawn.com/thread_view.cfm/15105&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forums.afterdawn.com/thread_view.cfm/15105&lt;/a&gt;\n\nThose that don't have a modded Ps2 Here's a few links for Free MC Boot &amp; how to use it to soft mod your ps2 so you can be able to play burned games. Free Mc Boot won't work on newer models of ps2 \n\nyou'll have to use an older version the tutorial explains this.\n\n-- &lt;a href=&quot; http://bootleg.sksapps.com/tutorials/fmcb/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://bootleg.sksapps.com/tutorials/fmcb/&lt;/a&gt;\n\nThen you will also need to patch the iso (the PS2 game) with ESR disc patcher GUI v0.24a if your using free mc boot with ESR Elf to boot your p2 copies or backups (No-swapping required for esr method).\n\nAfter patching burn the iso with Imgburn or Dvd Decrypter to respectable media\nthen use the ESR through fmcb after you installed everything to boot your game.\n\nYou will still need to use the proper media for the game to run or load properly regardless if your using fmcb, a modded ps2, or swap magic. Verbatim or Taiyo Yuden is preferred.\n\nNote: If fmcb isn't working and your Ps2 isn't Modded, Swap Magic should do the\ntrick.\n\n\n\nGame Description:\n\nJohn Constantine is the name of the main character in the Hellblazer comic by Vertigo DC. This game is based on the movie Constantine, starring Keanu Reeves. The player assumes the role of Constantine, a mage/exorcist/demonslayer of the modern age, a man who fights Evil, but remains cynical and skeptical in the face of Good. He also smokes a lot.\n\nThe game is played in third person perspective, switching to first person when the hero enters narrow spaces. \n\nConstantine's goal is to discover how and why Demons have managed to physically enter Earth, although the ancient laws forbid it. He utilizes a number of holy weapons and artifacts, from twin revolvers (dubbed the Witch's Curse) shooting stones from the Holy Lands to Holy Water Bombs and the Holy Shotgun. He faces various kinds of Demons and is often obliged to travel to Hell, which resembles a \nperpetually ablaze and decaying version of our world, in order to bypass obstacles. The game is pretty linear, offers minimal interaction with Constantine's surroundings and lacks real-time physics.\n\n\nFeatures:\n\n* The videogame inspired by the highly anticipated Warner Bros. Pictures film. \n\n* Play as John Constantine in an intense third-person action horror game. \n\n* Encounter terrifying enemies in haunting locations throughout Hell and Earth. \n\n* Use an array of powerful incantations and an arsenal of spectacular holy \n  artifacts including the Crucifier, Holy Shotgun and Dragon's Breath \n  Flamethrower. \n\n* Use the unique &quot;True Sight&quot; ability to identify deadly half-breeds and other \n  unearthly demonic secrets.\n\n\n\nGame Pics Included.\n\n\nBurn with DVD Decrypter, (Included in download).  \n\nBurn at 8x or 4x speed.\n\nUse Verbatim or Taiyo Yuden DVD Media for best quality, or if other media\nisn't working.\n\n\nIf using DVD+R then booktype to DVD-ROM. \n(If your mod-chip, or Ps2 doesn't support DVD+R).\n\n\nAny Problems or questions please post a comment.\n\n\nIf this is working fine for you let us know write a comment.\n\n\nPlease Seed this when your done.\n\n(I can't seed 24/7, do your part and seed to keep the torrent healthy).\n\n\nEnjoy!","torrent":{"xt":"urn:btih:e767a5e4ba2d2203bcaab018146b45ac02bac3c7","amp;dn":"Constantine+%5BNtsc%5D%2C+Ps2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e767a5e4ba2d2203bcaab018146b45ac02bac3c7","infoHashBuffer":{"type":"Buffer","data":[231,103,165,228,186,45,34,3,188,170,176,24,20,107,69,172,2,186,195,199]},"announce":[],"urlList":[]}}