{"title":"Gmail Notifier Pro v4.4.1 Incl License [iahq76]","uid":7823813,"size":6724705,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:e7b6a773069d208abededf558dd3d3dc41b301b1&amp;dn=Gmail+Notifier+Pro+v4.4.1+Incl+License+%5Biahq76%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"TorDigger","files":4,"time":1352886695,"description":"Gmail Notifier Pro for Windows \n\nGmail Notifier Pro is a Windows application capable of checking multiple Google Gmail accounts for new mail and display notifications. Google Calendar, Google Reader, Google News, Google Docs, Google+, Facebook, Twitter and RSS/Atom feeds are also supported. \nIn addition to the Google services, Gmail Notifier Pro provides notifications for any IMAP or POP mail account, including Microsoft Live Hotmail and Yahoo! Mail\n\n\nFeature highlights\n\n\nProfessional Gmail Notifier:\n\nCheck multiple Gmail accounts, including Google Apps, for new mail.\nSupports both Atom and IMAP protocols for mail. \n\nE-mail Features:\n\nRead, write, reply, preview and save attachments, mark as read and delete mail without the web browser. Supports Google Contacts. \n\nE-mail Integration in Windows:\n\nCan register as default program for e-mail in Windows. Supports mailto-links and sending e-mail attachments from Windows using Send To feature. \n\nGoogle Calendar:\n\nIntegration with Google Calendar accounts to display reminders for calendar events. \n\nGoogle News, Google Reader &amp; RSS:\n\nGet news notifications from Google News &amp; Google Reader.\nSupports RSS/Atom feeds to get notifications from any news source. \n\n\nGoogle Docs:\n\nGet notifications when changes are made to any of your documents stored at Google Docs .\n\nGoogle+:\n\nGet notifications from Google+ (Google Plus) - the new social network from Google. \n\nFacebook:\n\nGet notifications from Facebook, including friend requests, status and stream updates. \n\n\nTwitter:\n\nGet the latest Tweets from your Twitter home timeline as notifications in Gmail Notifier Pro.\n\nMicrosoft Live Hotmail:\n\nGet e-mail notifications for multiple Microsoft Live Hotmail accounts.\nConnects to Hotmail using POP. \n\nYahoo! Mail:\n\nGet email notifications for multiple Yahoo! Mail accounts.\nMark mail as read, flagged, spam and delete mail. \n\nAutomatic Sign In:\n\nYou never have to type your password again. When launching Gmail in a web browser, you will be automatically signed in to Gmail. \n\nThemes:\n\nSupports customizable themes and individual account settings, making Gmail Notifier Pro the best looking Gmail notifier on the web! \n\nCustomization:\n\nGmail Notifier Pro provides many easy-to-use features and settings.\nDefine schedules when to check for mail and display notifications. \n\nPortability:\n\nIn addition to the installation package, Gmail Notifier Pro can also run from a USB-stick without any installation. \n\nAutomatic Updates:\n\nGmail Notifier Pro supports automatic updates. A new version can be downloaded and installed with a single click. \n\nSecurity:\n\nSecure account management and encrypted connections (HTTPS / SSL) are used. 100% FREE from virus, spyware and adware. \n\nTranslations:\n\nChinese, Czech, Danish, Dutch, English, French, German, Hebrew, Hungarian, Italian, Korean, Norwegian, Persian, Polish, Portuguese, Russian, Serbian, Slovak, Slovenian, Spanish, Swedish, Turkish, Ukrainian and Vietnamese \n\nFull Windows 7 and Windows 8 support:\n\nSupports 32-bit &amp; 64-bit Windows XP, Windows Vista, Windows 7 &amp; Windows 8.\nGmail Notifier Pro is simply the best Gmail notifier for Windows\n\nSystem requirements\n\n-Supports 32-bit and 64-bit editions of Windows XP, Windows Vista and Windows 7 \n-Requires Microsoft .NET Framework 3.5 (already included in Windows 7).\n\nHomepage: http://www.gmailnotifier.se/\n\nInstallation Instructions:\n\n1. Install program.\n2. Run application, select language.\n3. Close application even from system tray.\n4. copy crack and paste into given path (See instruction in License folder)\n5. Done, Enjoy.","torrent":{"xt":"urn:btih:e7b6a773069d208abededf558dd3d3dc41b301b1","amp;dn":"Gmail+Notifier+Pro+v4.4.1+Incl+License+%5Biahq76%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e7b6a773069d208abededf558dd3d3dc41b301b1","infoHashBuffer":{"type":"Buffer","data":[231,182,167,115,6,157,32,138,190,222,223,85,141,211,211,220,65,179,1,177]},"announce":[],"urlList":[]}}