{"title":"STAR WARS: The Unaltered Original Trilogy MINI (MKV files)","uid":8880323,"size":6030181510,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:e7f96e59d4e9f5ea598540a6ebae1677dc285c5e&amp;dn=STAR+WARS%3A+The+Unaltered+Original+Trilogy+MINI+%28MKV+files%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Spandex_Angel","files":-1,"time":1378309520,"description":"Some peeps complained at the large file size of my last release, so here it is in a smaller size.\n\nThis is the Original Star Wars Trilogy, as seen before the Special Editions.\n\nAll three movies have been ripped using Handbrake and are better than VHS quality.  When I sit at a regular distance from my TV, the picture is still much clearer than what I'm currently getting from my Time Warner Cable (standard def).  Looking closely, I don't see much of a difference in the video quality between the two releases.\n\n---------------------------------------\nDifferences from the larger release:\n\n--While the alien subtitles were forced last time, allowing your indivdual player to dictate the font, these subtitles are burned in.\n\n--While the larger release has audio in 5.1 surround sound, this smaller release has the trilogy in stereo (the way I originally heard it).\n\n---------------------------------------\n---------------------------------------\n\n*****FROM THE OTHER RELEASE:\n\nWhat you have here is the original Star Wars Trilogy as they were first presented before George Lucas &amp; Friends decided to go beyond a simple digital restoration and instead place all kinds of cartoon shit in the movies we love.  There's no more Looney Tunes entry into Mos Eisley.  Boba Fett has his original voice before he was redubbed to sound like Jango Fett.  That stupid digital song and dance sequence in Jabba's place... GONE!  There's no Hayden Christensen at the end of ROTJ, and we get back our beloved Yub Nub!  We even have the original monkey-eyed Emperor in ESB, voiced by Clive Revil.\n\nThis comes from the DVD editions by Demonoid.com and uploaded by Legendarian.  That release has 3 burnable ISO files meant for dual-layer discs, and it came with menus and multiple subtitles.\n\nThe problem I had with that release was that the picture was too small.  The video was widescreen, but for a 4:3 television; thus it looked like a small rectangle surrounded by black bars.  \n\nI used Handbrake to rip the DVD files and turn them into MKVs, while also cropping the picture for 16:9 widescreen displays.\n\nWhat's missing from this release?  Well, I actually remade the movies into MKVs for my own personal viewing and decided to place these online for others only as an after-thought.\n\nTherefore, there are no subtitles in any language throughout the movies EXCEPT for the alien subtitles in English.  I know this sucks for some of you, but my plan is to burn all 3 mkv files onto one Blu-ray disc, and I wanted to make sure the alien subtitles popped up correctly without having to mess around with my remote.\n\n----------------------------------------------------\n(Note:  Lucasfilm or Disney does not lose any money because you download this, BECAUSE YOU CAN'T FIND THIS TRILOGY UNLESS YOU BUY IT OFF eBAY!  I'll take this torrent down the day they release the theatrical releases of the Star Wars original trilogy on DVD and/or Blu-Ray.)\n----------------------------------------------------\nHOPE YOU ENJOY!!!","torrent":{"xt":"urn:btih:e7f96e59d4e9f5ea598540a6ebae1677dc285c5e","amp;dn":"STAR+WARS%3A+The+Unaltered+Original+Trilogy+MINI+%28MKV+files%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e7f96e59d4e9f5ea598540a6ebae1677dc285c5e","infoHashBuffer":{"type":"Buffer","data":[231,249,110,89,212,233,245,234,89,133,64,166,235,174,22,119,220,40,92,94]},"announce":[],"urlList":[]}}