{"title":"Advanced High Strength Sheet Steels - Nina Fonstein","uid":15100607,"size":14829732,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ea39a561dacfd0c9716bf8e6a30bd1467c131205&amp;dn=Advanced+High+Strength+Sheet+Steels+-+Nina+Fonstein&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1466953605,"description":"Advanced High Strength Sheet Steels - Nina Fonstein (Springer, 2015).pdf\r\n\r\nISBN 978-3-319-19164-5\r\n\r\nThe book covers all types of advanced high strength steels ranging from dual-phase, TRIP. Complex phase, martensitic, TWIP steels to third generation steels, including promising candidates as carbide free bainitic steels, med Mn and Quenching &amp; Partitioning processed steels. The author presents fundamentals of physical metallurgy of key features of structure and relationship of structure constituents with mechanical properties as well as basics of processing AHSS starting from most important features of intercritical heat treatment, with focus on critical phase transformations and influence of alloying and microalloying. This book intends to summarize the existing knowledge to show how it can be utilized for optimization and adaption of steel composition, processing, and for additional improvement of steel properties that should be recommended to engineering personal of steel designers, producers and end users of AHSS as well as to students of colleges and Universities who deal with materials for auto industry","torrent":{"xt":"urn:btih:ea39a561dacfd0c9716bf8e6a30bd1467c131205","amp;dn":"Advanced+High+Strength+Sheet+Steels+-+Nina+Fonstein","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ea39a561dacfd0c9716bf8e6a30bd1467c131205","infoHashBuffer":{"type":"Buffer","data":[234,57,165,97,218,207,208,201,113,107,248,230,163,11,209,70,124,19,18,5]},"announce":[],"urlList":[]}}