{"title":"Strawberry &amp; Chocolate (Fresa y Chocolate)","uid":5701054,"size":1327250487,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:ebe32ea354f082c3d33636f75df2d052e3be678c&amp;dn=Strawberry+%26+Chocolate+%28Fresa+y+Chocolate%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"rubusdemonoid","files":2,"time":1279506866,"description":"Please help to seed this torrent when you are completed as my ISP has a monthly limit that I always max out on since I have over 60 torrents that I seed for you all. My ISP is going to terminate my service if I max out my monthly limit, so I just can't continue to seed all by myself so often. PLEASE help to seed. Thank you.  :)\n\n\n\nA man finds that friendship and understanding can span many boundaries -- age, politics, and gender preference among them -- in this comedy-drama from Cuba. David (Vladimir Cruz) is a student and ardent Communist whose personal life is in something of a slump; his girlfriend recently left him to marry another man after he took her to a hotel in hopes of seducing her, and she announced that she couldn't believe anyone could make love in such an ugly room. One day, David stops by the park and gets some ice cream, where he meets Diego (Jorge Perrugoria); as if his flamboyant manner wasn't announcement enough, David is convinced that Diego must be a homosexual because he's eating strawberry ice cream, even though it's one of the rare days when chocolate is available. David is less than impressed with Diego's open criticism of Castro's regime (especially the government's persecution of gays), but he accepts an invitation to visit Diego's apartment; while David realizes that Diego has seduction on his mind, this is outweighed by the knowledge that Diego's flat houses such forbidden pleasures as Time Magazine, American record albums, and Johnny Walker Red scotch. David's friend Miguel (Francisco Gatorno) is convinced that Diego is a dangerous dissident and urges David to spy on him and pass along his findings to the government. But the more time David spends with Diego, the more he finds that he's intrigued by this very different man, and that he enjoys spending time with him; David also finds he likes Nancy (Mirta Ibarra), Diego's sexy neighbor. Helmed by legendary Cuban director Tomas Gutierrez Alea and based on a story by Senel Paz, Fresa y Chocolate was the first Cuban film to be nominated for an Oscar (Best Foreign Language Film of 1995); it also won honors at the Berlin International Film Festival and the Sundance Film Festival.\n\n\n\n\n\nMore of my music &amp; movie downloads that you may find of interest are located here: &lt;a href=&quot; http://thepiratebay.se/user/rubusdemonoid/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://thepiratebay.se/user/rubusdemonoid/&lt;/a&gt;\n","torrent":{"xt":"urn:btih:ebe32ea354f082c3d33636f75df2d052e3be678c","amp;dn":"Strawberry+%26+Chocolate+%28Fresa+y+Chocolate%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ebe32ea354f082c3d33636f75df2d052e3be678c","infoHashBuffer":{"type":"Buffer","data":[235,227,46,163,84,240,130,195,211,54,54,247,93,242,208,82,227,190,103,140]},"announce":[],"urlList":[]}}