{"title":"Radioisotopes and the Age of the Earth, Volume I-II - ICR","uid":11773377,"size":32659701,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ec2398384e90601c9e66d38038de111f7867508c&amp;dn=Radioisotopes+and+the+Age+of+the+Earth%2C+Volume+I-II+-+ICR&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"starxteel","files":2,"time":1427166073,"description":"\n\nThe age of the earth is an important issue in Christianity today. If the six-day Genesis account is fallacious, then how can the rest of scripture be relied upon? Scientists associated with the Institute for Creation Research have finished an eight-year research project known as RATE, or Radioisotopes and the Age of the Earth.\n\nFor over a hundred years, evolutionists have insisted that the earth is billions of years old, and have arrogantly dismissed any views contrary to this belief. The RATE team dared to ask tough questions and has discovered that radioactive dating methods and their results are not thorough, consistent or reliable. The team of seven creation scientists have discovered incredible physical evidence that supports what the Bible says about the young age of the earth. Learn about their discoveries and explore the scientific evidence that supports biblical truth!\n\nVolume 1: The RATE book is a definitive resource on radioactive dating for every scientist's library, whether evolutionist or creationist. It examines radioisotope theory, exposes its plaguing problems, and offers a better alternative. 676 pages.\n\nVolume 2: The age of the earth is an important issue in Christianity today. If the 6 day Genesis account is fallacious, then how can the rest of scripture be relied upon? Radioisotopes and the Age of the Earth: Results of a Young-Earth Creationist Research Initiative addresses the issues raised by the first RATE technical book in 2000. 818 pages.\n\nA shorter less technical book is also available for a larger audience: &lt;a href=&quot;\nhttp://www.demonoid.pw/files/details/3012362/10402158/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.demonoid.pw/files/details/3012362/10402158/&lt;/a&gt;\n\nAbout the author:\nDr. Andrew Snelling is one of the world?s most respected creation scientists specializing in geological studies and also is a passionate speaker for layperson and technical audiences.\nAndrew A. Snelling, B.Sc.(Hons), Ph.D. (Geology) was for many years Geologist, Senior Research Scientist and Editor of the CEN Technical Journal (now Journal of Creation) at Creation Science Foundation (now Creation Ministries International), Brisbane, Australia. From 1998 he worked for the Institute for Creation Research, USA, where he was an Associate Professor of Geology. Since 2007 he has been working for Answers in Genesis USA","torrent":{"xt":"urn:btih:ec2398384e90601c9e66d38038de111f7867508c","amp;dn":"Radioisotopes+and+the+Age+of+the+Earth%2C+Volume+I-II+-+ICR","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ec2398384e90601c9e66d38038de111f7867508c","infoHashBuffer":{"type":"Buffer","data":[236,35,152,56,78,144,96,28,158,102,211,128,56,222,17,31,120,103,80,140]},"announce":[],"urlList":[]}}