{"title":"Harry Potter and Philosophy -Ultimate Edition- Mp3+Epub","uid":8254147,"size":229409573,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:ec42bbc2821edbe1f828a6d9fdcfbef728114b8f&amp;dn=Harry+Potter+and+Philosophy+-Ultimate+Edition-+Mp3%2BEpub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"hombrep","files":-1,"time":1363220812,"description":"A philosophical exploration of the entire seven-book Harry Potter series\n\nHarry Potter has been heralded as one of the most popular book series of all time and the philosophical nature of Harry, Hermione, and Ron's quest to rid the world of its ultimate evil is one of the many things that make this series special. The Ultimate Harry Potter and Philosophy covers all seven titles in J.K. Rowling's groundbreaking series and takes fans back to Godric's Hollow to discuss life after death, to consider what moral reasoning drove Harry to choose death, and to debate whether Sirius Black is a man or a dog.\n\nWith publication timed to coincide with the release of the movie Harry Potter and the Deathly Hallows (Part 1), this book will be the definitive guide for all fans looking to appreciate the series on a deeper level.\n\nCovers a range of intriguing topics such as the redemption of Severus Snape, the power of love, and destiny in the wizarding world\nGives you a new perspective on Harry Potter characters, plot lines, and themes\nMakes a perfect companion to the Harry Potter books and movies\nPacked with interesting ideas and insights, The Ultimate Harry Potter and Philosophy is an ideal companion for anyone interested in unraveling the subtext and exploring the greater issues at work in the story.\n\nEditorial Reviews\nReview\n'Packed with interesting ideas and insights...an ideal companion for anyone interested in unraveling the subtext and exploring the greater issues.' (Planet-Print Blog.com, July 2011).\nFrom the Back Cover\nIs it always wrong to use a love potion?\nIs death something to be feared . . . or &quot;mastered&quot;?\n\nWhat can Severus Snape teach us about the possibility of redemption?\n\nIs love the most powerful magic of all?\n\nJ. K. Rowling's wildly popular Harry Potter books may appear to be simple children's tales on the surface, but like Hogwarts, they conceal many hidden chambers, trapdoors, and perplexing secrets. Drawing on all seven books in the Harry Potter series, The Ultimate Harry Potter and Philosophy offers a powerful brew of insights about good and evil, love, death, power, sacrifice, and hope. Is it true, as Dumbledore says, that our choices reveal far more about us than our abilities do? Is there an afterlife, and what might it be like? Here's a Pensieve for your thoughts. So take a healthy slug of Baruffio's Brain Elixir and join Bassham's Army of talented philosophers in exploring the mind-stretching deeper questions of the Potter books and films.\n\nTo learn more about the Blackwell Philosophy and Pop Culture series, visit www.andphilosophy.com\n\nBLACKWELL PHILOSOPHY AND POP CULTURE SERIES\n\nThis book has not been approved, licensed, or sponsored by any entity or person involved in creating or producing Harry Potter, the book series, or films.\n\nSee all Editorial Reviews\nProduct Details\nPaperback: 304 pages\nPublisher: Wiley; 1 edition (September 14, 2010)\nLanguage: English\nISBN-10: 0470398256\nISBN-13: 978-0470398258\n","torrent":{"xt":"urn:btih:ec42bbc2821edbe1f828a6d9fdcfbef728114b8f","amp;dn":"Harry+Potter+and+Philosophy+-Ultimate+Edition-+Mp3%2BEpub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ec42bbc2821edbe1f828a6d9fdcfbef728114b8f","infoHashBuffer":{"type":"Buffer","data":[236,66,187,194,130,30,219,225,248,40,166,217,253,207,190,247,40,17,75,143]},"announce":[],"urlList":[]}}