{"title":"Richard Hawley - Lowedges (2003) [320kbps]","uid":7407814,"size":103286658,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:edf1568fbf236a974f3688f1eb69975d2ed9a7ce&amp;dn=Richard+Hawley+-+Lowedges+%282003%29+%5B320kbps%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"dankencity","files":12,"time":1341297544,"description":"out of print cd everyone should have...\n\n1. Run For Me\n2. Darlin'\n3. Oh My Love\n4. The Only Road\n5. On The Ledge\n6. You Don't Miss Your Water (Till Your River Runs Dry)\n7. The Motorcycle Song\n8. It's Over Love\n9. I'm On Nights\n10. Danny\n11. The Nights Are Made For Us\n\n\nLowedges is Richard Hawley's third album. Neither of its predecessors caused riots in record stores, but pretty much everyone who has paid attention to British pop music in the last decade has heard Richard Hawley. As a session guitarist for Pulp, Robbie Williams, Beth Orton, and others, Hawley commands the airwaves to a degree that any similar singer-songwriter would kill for. It can't be easy though to live with the irony that the work that appears under his own name is his least known and by some distance his best.\nLowedges sees Hawley sticking to the template he established on his two previous solo albums: knelling, tuneful ballads are built around an acoustic guitar and sung with a guttural croon that pitches somewhere between Edwyn Collins and the Divine Comedy's Neil Hannon. Like Leonard Cohen and Lee Hazlewood, Hawley revels in melancholy. Tracks such as &quot;On the Ledge&quot; and &quot;You Don't Miss Your Water (Till Your River Runs Dry)&quot; are confections of the most sumptuous misery. --Andrew Mueller\n\nMassively anticipated follow up to 2001's acclaimed 'Late Night Final'. Displaying his unique brand of windswept Yorkshire/Nashville crossover, 'Lowedges' is both classic and timeless. As a musician's musician Richard has received reverential acclaim from the likes of Coldplay, Doves, Nick Cave, Badly Drawn Boy and Radiohead. After working with amongst others Pulp, All Saints, Perry Farrell, Nellee Hooper &amp; Baz Luhrman. XL Recordings. 2003.","torrent":{"xt":"urn:btih:edf1568fbf236a974f3688f1eb69975d2ed9a7ce","amp;dn":"Richard+Hawley+-+Lowedges+%282003%29+%5B320kbps%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"edf1568fbf236a974f3688f1eb69975d2ed9a7ce","infoHashBuffer":{"type":"Buffer","data":[237,241,86,143,191,35,106,151,79,54,136,241,235,105,151,93,46,217,167,206]},"announce":[],"urlList":[]}}