{"title":"Coleman Hawkins - 1955 - The Hawk Talks (vinyl 24 192) FLAC","uid":9525701,"size":1308969705,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:edfca31bbb8c8fa31a699cd3682be5de23a44247&amp;dn=Coleman+Hawkins+-+1955+-+The+Hawk+Talks+%28vinyl+24+192%29+FLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"eika256","files":-1,"time":1390748187,"description":"Coleman Hawkins - 1955 - The Hawk Talks\nVinyl 24 bits, 192 KHz\n\nColeman Hawkins was the first important tenor saxophonist and he remains one of the greatest of all time. A consistently modern improviser whose knowledge of chords and harmonies was encyclopedic, Hawkins had a 40-year prime (1925-1965) during which he could hold his own with any competitor.\nColeman Hawkins started piano lessons when he was five, switched to cello at age seven, and two years later began on tenor. At a time when the saxophone was considered a novelty instrument, used in vaudeville and as a poor substitute for the trombone in marching bands, Hawkins sought to develop his own sound. A professional when he was 12, Hawkins was playing in a Kansas City theater pit band in 1921, when Mamie Smith hired him to play with her Jazz Hounds. Hawkins was with the blues singer until June 1923, making many records in a background role and he was occasionally heard on instrumentals. After leaving Smith, he freelanced around New York, played briefly with Wilbur Sweatman, and in August 1923 made his first recordings with Fletcher Henderson. When Henderson formed a permanent orchestra in January 1924, Hawkins was his star tenor.\nAlthough (due largely to lack of competition) Coleman Hawkins was the top tenor in jazz in 1924, his staccato runs and use of slap-tonguing sound quite dated today. However, after Louis Armstrong joined Henderson later in the year, Hawkins learned from the cornetist's relaxed legato style and advanced quickly. By 1925, Hawkins was truly a major soloist, and the following year his solo on &quot;Stampede&quot; became influential. Hawk (who doubled in early years on clarinet and bass sax) would be with Fletcher Henderson's Orchestra up to 1934, and during this time he was the obvious pacesetter among tenors; Bud Freeman was about the only tenor who did not sound like a close relative of the hard-toned Hawkins. In addition to his solos with Henderson, Hawkins backed some blues singers, recorded with McKinney's Cotton Pickers, and, with Red McKenzie in 1929, he cut his first classic ballad statement on &quot;One Hour.&quot;\nBy 1934, Coleman Hawkins had tired of the struggling Fletcher Henderson Orchestra and he moved to Europe, spending five years (1934-1939) overseas. He played at first with Jack Hylton's Orchestra in England, and then freelanced throughout the continent. His most famous recording from this period was a 1937 date with Benny Carter, Alix Combille, Andre Ekyan, Django Reinhardt, and Stephane Grappelli that resulted in classic renditions of &quot;Crazy Rhythm&quot; and &quot;Honeysuckle Rose.&quot; With World War II coming close, Hawkins returned to the U.S. in 1939. Although Lester Young had emerged with a totally new style on tenor, Hawkins showed that he was still a dominant force by winning a few heated jam sessions. His recording of &quot;Body and Soul&quot; that year became his most famous record. In 1940, he led a big band that failed to catch on, so Hawkins broke it up and became a fixture on 52nd Street. Some of his finest recordings were cut during the first half of the 1940s, including a stunning quartet version of &quot;The Man I Love.&quot; Although he was already a 20-year veteran, Hawkins encouraged the younger bop-oriented musicians and did not need to adjust his harmonically advanced style in order to play with them. He used Thelonious Monk in his 1944 quartet; led the first official bop record session (which included Dizzy Gillespie and Don Byas); had Oscar Pettiford, Miles Davis, and Max Roach as sidemen early in their careers; toured in California with a sextet featuring Howard McGhee; and in 1946, utilized J.J. Johnson and Fats Navarro on record dates. Hawkins toured with Jazz at the Philharmonic several times during 1946-1950, visited Europe on a few occasions, and in 1948 recorded the first unaccompanied saxophone solo, &quot;Picasso.&quot;\nBy the early '50s, the Lester Young-influenced Four Brothers sound had become a much greater influence on young tenors than Hawkins' style, and he was considered by some to be out of fashion. However, Hawkins kept on working and occasionally recording, and by the mid-'50s was experiencing a renaissance. The up-and-coming Sonny Rollins considered Hawkins his main influence, Hawk started teaming up regularly with Roy Eldridge in an exciting quintet (their appearance at the 1957 Newport Jazz Festival was notable), and he proved to still be in his prime. Coleman Hawkins appeared in a wide variety of settings, from Red Allen's heated Dixieland band at the Metropole and leading a bop date featuring Idrees Sulieman and J.J. Johnson, to guest appearances on records that included Thelonious Monk, John Coltrane, and (in the early '60s) Max Roach and Eric Dolphy. During the first half of the 1960s, Coleman Hawkins had an opportunity to record with Duke Ellington, collaborated on one somewhat eccentric session with Sonny Rollins, and even did a bossa nova album. By 1965, Hawkins was even showing the influence of John Coltrane in his explorative flights and seemed ageless.\nUnfortunately, 1965 was Coleman Hawkins' last good year. Whether it was senility or frustration, Hawkins began to lose interest in life. He practically quit eating, increased his drinking, and quickly wasted away. Other than a surprisingly effective appearance with Jazz at the Philharmonic in early 1969, very little of Hawkins' work during his final three and a half years (a period during which he largely stopped recording) is up to the level one would expect from the great master. However, there are dozens of superb Coleman Hawkins recordings currently available and, as Eddie Jefferson said in his vocalese version of &quot;Body and Soul,&quot; &quot;he was the king of the saxophone.&quot; (AllMusic)\n\nTracklist:\n01 - Lucky Duck\n02 - Spellbound\n03 - I Can't Get Started\n04 - Lonely Wine\n05 - Ruby\n06 - Trust In Me\n07 - If I Could Be With You\n08 - The Song From Moulin Rouge\n09 - Midnight Sun\n10 - Amber\n11 - Lost In A Fog\n12 - Carioca\n\nEnjoy and share!","torrent":{"xt":"urn:btih:edfca31bbb8c8fa31a699cd3682be5de23a44247","amp;dn":"Coleman+Hawkins+-+1955+-+The+Hawk+Talks+%28vinyl+24+192%29+FLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"edfca31bbb8c8fa31a699cd3682be5de23a44247","infoHashBuffer":{"type":"Buffer","data":[237,252,163,27,187,140,143,163,26,105,156,211,104,43,229,222,35,164,66,71]},"announce":[],"urlList":[]}}