{"title":"Detroits Historic Places of Worship (Architecture History).pdf","uid":11357128,"size":138448710,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ee52164d7d1f9a766d45bec4382b212acbaa1708&amp;dn=Detroits+Historic+Places+of+Worship+%28Architecture+History%29.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"STBGD","files":-1,"time":1414960964,"description":"Detroit's Historic Places of Worship By John Gallagher\n2012 | 272 Pages | ISBN: 0814334245 | PDF | 132 MB\n\nIn Detroit's Historic Places of Worship, authors Marla O. Collum, Barbara E. Krueger, and Dorothy Kostuch profile 37 architecturally and historically significant houses of worship that represent 8 denominations and nearly 150 years of history. The authors focus on Detroit's most prolific era of church building, the 1850s to the 1930s, in chapters that are arranged chronologically. Entries begin with each building's founding congregation and trace developments and changes to the present day. Full-color photos by Dirk Bakker bring the interiors and exteriors of these amazing buildings to life, as the authors provide thorough architectural descriptions, pointing out notable carvings, sculptures, stained glass, and other decorative and structural features. \n\nNearly twenty years in the making, this volume includes many of Detroit's most well known churches, like Sainte Anne in Corktown, the Cathedral of the Most Blessed Sacrament in Boston-Edison, Saint Florian in Hamtramck, Mariners' Church on the riverfront, Saint Mary's in Greektown, and Central United Methodist Church downtown. But the authors also provide glimpses into stunning buildings that are less easily accessible or whose uses have changed-such as the original Temple Beth-El (now the Bonstelle Theater), First Presbyterian Church (now Ecumenical Theological Seminary), and Saint Albertus (now maintained by the Polish American Historical Site Association)-or whose future is uncertain, like Woodward Avenue Presbyterian Church (most recently Abyssinian Interdenominational Center, now closed). \n\nAppendices contain information on hundreds of architects, artisans, and crafts-people involved in the construction of the churches, and a map pinpoints their locations around the city of Detroit. Anyone interested in Detroit's architecture or religious history will be delighted by Detroit's Historic Places of Worship","torrent":{"xt":"urn:btih:ee52164d7d1f9a766d45bec4382b212acbaa1708","amp;dn":"Detroits+Historic+Places+of+Worship+%28Architecture+History%29.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ee52164d7d1f9a766d45bec4382b212acbaa1708","infoHashBuffer":{"type":"Buffer","data":[238,82,22,77,125,31,154,118,109,69,190,196,56,43,33,42,203,170,23,8]},"announce":[],"urlList":[]}}