{"title":"The Meteors- In Heaven","uid":4173504,"size":52823164,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:ee82f2427484ef6cd1531b2ae7957c7a6547d811&amp;dn=The+Meteors-+In+Heaven&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"crepesdrapes","files":23,"time":1210001573,"description":"Island Records\n1.In Heaven 2.Shout So Loud 3.Earwigs In My Brain 4.In the Cards 5.Attack of the Zorch Men 6.The Crazed 7.Get Off of My Cloud 8.Love You To Death 9.Teenagers From Outer Space 10.Maniac 11.Into the Darkness 12.Death Dance 13.Psycho For Your Love 14.The Room 15.Rockabilly Psychosis\n             This is where it all started. The release of In Heaven by The Meteors in 1981 was the equivalent to the Big Bang for the world of psychobilly. Generally regarded as the first, and best psychobilly album ever released, In Heaven is absolutely essential listening for every psycho fan out there.\n             Featuring the original Meteors line-up of P. Paul Fenech (guitar &amp; lead vocals, Nigel Lewis (bass &amp; vocals) and Mark Robertson (drums), In Heaven would be the first step in establishing The Meteors as the undisputed kings of psychobilly. This would lay the groundwork for many more albums to come.\n             Following the album-opening chant of &quot;In Heaven, everything is fine,&quot; is the manic &amp;#039;Shout So Loud&amp;#039;. The song kicks things off in what would become typical Meteors fashion, telling the story of a mental patient set free from his institution, only to find himself back inside before too long. The raging rockabilly sound mixed with the punk energy and insane subject matter of &amp;#039;Shout So Loud&amp;#039; would represent the formula employed by The Meteors to this day.\n             The remainder of In Heaven includes Meteors classics that have stood the test of time, and are still featured regularly in their live set today. Highlights include a manic cover of the Rolling Stones&amp;#039; &amp;#039;Get Off of My Cloud&amp;#039;, the defiant &amp;#039;Maniac&amp;#039;, and excellent highpoint of the album &amp;#039;Psycho For Your Love&amp;#039;.\n             Plagued by poor distribution and a very small pressing when the album was originally issued on Island Records in 1981, In Heaven has been re-released on CD by Cherry Red Records as part of their Anagram Psychobilly Collectors Series. This re-issue gives psychobilly fans a chance to hear the original recording of this classic album, which was previously almost impossible to find a copy of.\n             If you don&amp;#039;t already own The Meteors&amp;#039; &quot;In Heaven&quot; album, do yourself a favor and head to your local record store to find a copy. This is absolutely the best album that the genre has ever offered.\n","torrent":{"xt":"urn:btih:ee82f2427484ef6cd1531b2ae7957c7a6547d811","amp;dn":"The+Meteors-+In+Heaven","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ee82f2427484ef6cd1531b2ae7957c7a6547d811","infoHashBuffer":{"type":"Buffer","data":[238,130,242,66,116,132,239,108,209,83,27,42,231,149,124,122,101,71,216,17]},"announce":[],"urlList":[]}}