{"title":"Plant Desiccation Tolerance _F1_","uid":6495687,"size":3994091,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:eec442fd4c623d88c62e117793a688343b7b33c5&amp;dn=Plant+Desiccation+Tolerance+_F1_&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"_F1_","files":1,"time":1309058791,"description":"Ulrich LÃƒÂ¼ttge, &quot;Plant Desiccation Tolerance (Ecological Studies)&quot;\nPublisher: Springer | 2011 | ISBN: 3642191053 | PDF | 403 pages | 5.9 MB\n\nDesiccation tolerance was essential when plants first began to conquer land, roughly 400 million years ago. While most desiccation-tolerant plants belong to basal phylogenetic taxa, this capacity has also evolved among some vascular plant species.\n\nIn this volume renowned experts treat plant desiccation tolerance at the organismic as well as at the cellular level. The diversity of ecophysiological adaptations and acclimations of cyanobacteria, eukaryotic algae, mosses, and lichens is addressed in several chapters. The particular problems of vascular plants during dehydration/rehydration cycles resulting not only from their hydraulic architectures, but also from severe secondary stresses associated with the desiccated state are discussed. Based on the treatment of desiccation tolerance at the organismic level, a second section of the book is devoted to the cell biological level. It delineates the general concepts of functional genomics, epigenetics, genetics, molecular biology and the sensing and signalling networks of systems biology involved in dehydration/rehydration cycles.\n\nThis book provides an invaluable compilation of current knowledge, which is a prerequisite for a better understanding of plant desiccation tolerance in natural as well as agro- and forest ecosystems where water is one of the most essential resources.","torrent":{"xt":"urn:btih:eec442fd4c623d88c62e117793a688343b7b33c5","amp;dn":"Plant+Desiccation+Tolerance+_F1_","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eec442fd4c623d88c62e117793a688343b7b33c5","infoHashBuffer":{"type":"Buffer","data":[238,196,66,253,76,98,61,136,198,46,17,119,147,166,136,52,59,123,51,197]},"announce":[],"urlList":[]}}