{"title":"Stray Cats - Rock This Town [Friday Night, 1981].VOB","uid":9366470,"size":119230464,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:efd6631b361cd2da9966bf1ec10fd27496a21992&amp;dn=Stray+Cats+-+Rock+This+Town+%5BFriday+Night%2C+1981%5D.VOB&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"SgtRlee","files":-1,"time":1387426926,"description":"Stray Cats - Rock This Town [Friday Night, 1981].VOB\n\n\nHQ rare &quot;Friday Night&quot; TV show live performance music video. &quot;Rock This Town&quot; is a song by the Stray Cats from their UK debut album Stray Cats. Its first U.S. release was on the 1982 album Built for Speed. It peaked at #9 on the Billboard Hot 100 in 1982, becoming the first of the band's three top ten hits in the U.S. It had also previously reached this position on the UK Singles Chart in 1981.\n\nThe song has been listed by the Rock and Roll Hall of Fame as one of the 500 songs that shaped Rock and Roll. Even the side-project band The Brian Setzer Orchestra and fictional music group Alvin and the Chipmunks have each recorded a cover of the song.\n\nBuilt for Speed is the first American album from the rockabilly band Stray Cats. It was the most successful record for the band, with the videos for songs such as &quot;Rock This Town&quot; and &quot;Stray Cat Strut&quot; reaching MTV regular rotation status. This album is a compilation of 12 songs taken from the band's first two albums which were released in the UK. Six songs from Stray Cats and five songs from Gonna Ball plus the title track, which had not previously been released in the UK.\n\nThe Stray Cats are an American rockabilly band formed in 1980 by upright bassist Lee Rocker, Slim Jim Phantom (drums) and guitarist Brian Setzer in the Long Island town of Massapequa, New York. The group had numerous hit singles in the UK, Australia, Canada and the U.S. including &quot;Stray Cat Strut&quot;, &quot;(She's) Sexy + 17&quot;, &quot;Look at That Cadillac,&quot; &quot;I Won't Stand in Your Way&quot;, &quot;Bring it Back Again&quot;, and &quot;Rock This Town&quot;, which the Rock and Roll Hall of Fame has listed as one of the 500 most important songs in the history of rock and roll.\n\nThe group, whose style was based upon the sounds of Sun Records artists and other artists from the 1950s, were heavily influenced by Eddie Cochran, Carl Perkins, Gene Vincent and Bill Haley &amp; His Comets. The Stray Cats quickly developed a large following in the New York music scene playing at CBGB and Max's Kansas City as well as venues on Long Island. When the Cats heard a rumor that there was a revival of the 1950s Teddy Boy youth subculture in England, the band moved to the UK. They then spearheaded the nascent rockabilly revival, by blending the 1950s Sun Studio sound with modern punk musical elements. In terms of visual style the Stray Cats also blended elements of 1950 rockabilly clothes such as wearing drape jackets, brothel creepers and western shirts with punk clothes such as tight black zipper trousers and modern versions of 1950s hair styles.\n\nThe Stray Cats have reunited periodically for live performances. Setzer is still part of his 1990s swing-revival band The Brian Setzer Orchestra. Rocker continued recording and touring throughout the 1990s and on to today. His albums include Black Cat Bone and Racin' the Devil on Alligator records as well as Bulletproof.\n\nThe band was inducted into the Long Island Music Hall of Fame on October 15, 2006.\n(video does not have any logos)\n\n\n    &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Rock_This_Town&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Rock_This_Town&lt;/a&gt; \n      &lt;a href=&quot;\nhttp://bayimg.com/MAEeCAaFk&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/MAEeCAaFk&lt;/a&gt; \n   \n\n\nFile properties info using Media Player Classic:     \n   Video: MPEG2 Video 720x480 (4:3) 29.97fps 7000kbps\n   Audio: LPCM 48000Hz stereo 1536kbps [DVD LPCM, 16 bit]\n   Duration: 00:02:51\n\n\n\n\n*Install the &quot;Media Player Classic&quot; player if you can't play this file, \nor for better visual and audio quality playback of all your videos. \nIt's 100% free to download and use. Latest stable build is v1.7.1\n\n*Media Player Classic Home Cinema*         &lt;a href=&quot;\nhttp://mpc-hc.sourceforge.net/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://mpc-hc.sourceforge.net/&lt;/a&gt; \n\nSgtRlee (Sgt.R.Lee) \n\t","torrent":{"xt":"urn:btih:efd6631b361cd2da9966bf1ec10fd27496a21992","amp;dn":"Stray+Cats+-+Rock+This+Town+%5BFriday+Night%2C+1981%5D.VOB","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"efd6631b361cd2da9966bf1ec10fd27496a21992","infoHashBuffer":{"type":"Buffer","data":[239,214,99,27,54,28,210,218,153,102,191,30,193,15,210,116,150,162,25,146]},"announce":[],"urlList":[]}}