{"title":"High School Story v3.9.0 mod [apkpita]","uid":14636994,"size":84431832,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:f158aa97e4e9b77b72eb80e0b518926b4ddeb9e2&amp;dn=High+School+Story+v3.9.0+mod+%5Bapkpita%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"tiropitaki","files":1,"time":1463466221,"description":"Throw parties, make friends, and date the coolest kids in town... in YOUR High School Story!\r\nPlay as a jock, nerd, or prep - the choice is yours as you live your teenage years your way! Be the guy or girl that EVERYONE wants to know!\r\n\r\nAttend parties with new friends at homecoming or prom to add them to the campus of your dreams, and check out the Isle of Love where romance is in the air! Get an all-star boyfriend... or date the head cheerleader! Go on wild trips with your classmates, and learn all their secrets! Discover these and hundreds of other stories at your awesome campus today!\r\n\r\n- Add UNIQUE CLASSMATES to your squad! From prom kings to homecoming queens, befriend them all!\r\n- Become BFFs with awesome characters like Payton in THE PARTY GIRL or Nishan in MISSION NERDPOSSIBLE!\r\n- Host parties to meet over 30 CLASSMATE TYPES! Writers, cheerleaders, rock climbers, and more!\r\n- Date YOUR CRUSH and help your BFFs find romance too!\r\n- Meet cute boys and girls at the FANTASY PHOTOBOOTH, and make your choice!\r\n- Battle a rival high school at the epic HOMECOMING GAME!\r\n- Get pumped up with the cheer captain at CHEERLEADER CAMP!\r\n- Nerd out at the SCIENCE FAIR, or get creative in a massive PRANK WAR with your classmates!\r\n- Decorate your DREAM CAMPUS with everything from prom thrones to boxes of puppies!\r\n- Customize your look! Casual or formal, nerdy or sporty... YOU CHOOSE!\r\n- Dress up in FORMALWEAR for prom and romance your date on the dance floor!\r\n- GO STEADY with a hot girl or boyfriend, and PLAY MATCHMAKER for your friends!\r\n- Get an intro to coding in a special quest with GIRLS WHO CODE!\r\n- Learn advanced high school vocabulary words in FUN MINI-GAMES!\r\n- Enjoy new stories, romances, parties, and choices EVERY WEEK!\r\n\r\nHigh School Story is completely free to play, but you can purchase some in-game items with real money. If you do not want to use this feature, you can disable in-app purchases in your device's settings.\r\n\r\n-----------------------------------------------\r\nTo our players: Thank you for your passion. Pixelberry is a firm believer that games can make a difference. And you’ve proven they can.\r\n\r\nWhen we partnered with non-profits, like The Cybersmile Foundation, a cyberbullying non-profit, and the National Eating Disorders Association (NEDA) you responded with great enthusiasm. Together, we’ve done some amazing things. \r\n* Over 4 million players have learned more about cyberbullying.\r\n* Over 30,000 players have visited NEDA's sites to learn more about eating disorders.\r\n* And thousands of players have reached out to Cybersmile, often for help with bullying.\r\n\r\nThank you! We sincerely appreciate your enthusiasm and support.\r\n\r\n- The Pixelberry Team\r\n\r\nWhat’s new:\r\nGraduation is here, and we're celebrating with a brand new feature: character MAKEOVERS! Wanna dress Julian up for a special date? Now you can! We've added EIGHT MAKEOVER LOOKS for your favorite characters, including Autumn, Payton, Nishan, and Mia!\r\nReady to mix up your own style? Try a new outfit, like On Call! And don't forget to collect tickets for the Weekly Goals Exclusive Outfit, Fireman Inferno!\r\nLove HSS? Let us know by leaving a FIVE-STAR REVIEW!\r\nMegan\r\nLevel 9 Varsity and Writer\r\n\r\nMod Info:\r\n1. Infinite Coins \r\n2. Infinite Rings \r\n3. Infinite Books \r\n4. Infinite Pencils \r\n5. Infinite Tickets\r\n\r\nRequirements: Android OS 4.0 and up","torrent":{"xt":"urn:btih:f158aa97e4e9b77b72eb80e0b518926b4ddeb9e2","amp;dn":"High+School+Story+v3.9.0+mod+%5Bapkpita%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f158aa97e4e9b77b72eb80e0b518926b4ddeb9e2","infoHashBuffer":{"type":"Buffer","data":[241,88,170,151,228,233,183,123,114,235,128,224,181,24,146,107,77,222,185,226]},"announce":[],"urlList":[]}}