{"title":"Hip Hop Collection - Beef II","uid":7541953,"size":2438154240,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:f32cd77ba1d2818192ed182bf3a0196aee04ef0c&amp;dn=Hip+Hop+Collection+-+Beef+II&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"GRNS3","files":-1,"time":1345239278,"description":"\nThe Hip Hop Collection - a series of educative and entertaining info dvd's\n\nPlease enjoy, share with friends and seed :)\n\nBeef II (released on DVD in August 2004) is a sequel to the 2003 documentary Beef, which continued to document the history of rivalries in hip-hop and rap music. Like its prequel, the film was executive produced by Quincy Jones III (QD3), written by Peter Alton and Peter Spirer (who also directed), and was this time narrated by actor Keith David.\n\nBeef II shows a chronological look of battles (some friendly, but many personal), dating back to rap musics infancy in the early 1980s. Among the rivalries that were profiled, they include KRS-One vs. Nelly, Roxanne Shante and Marley Marl vs. U.T.F.O. (see The Roxanne Wars), LL Cool J vs. Canibus, K-Solo vs. DMX, Cypress Hill vs. Ice Cube &amp; Westside Connection, D12 (minus Eminem) vs. one-time Detroit cross-town ally Royce da 5'9&quot;, EPMD partners Erick Sermon vs. Parrish Smith,and Eminem vs.Benzino.\n\nOnce again, similar to the first film, Russell Simmons, Snoop Dogg, Kool Moe Dee, Jay-Z, KRS-One, Mack 10, DMX, Big Daddy Kane, Redman, Method Man and Ice-T participate in the film through interviews (new interviews for the film itself), as well as archived interviews from footage of other sources.\n\nBeef II also features never-before seen performances of many of the films participants, plus extended portions of interviews that did not make the final cut of the film. One portion of the extra interviews features Grandmaster Caz discussing his animosity towards Big Bank Hank from the rap group The Sugar Hill Gang for him using Caz's rhymes for the hit song &quot;Rapper's Delight&quot; and then not being properly compensated. Other portions include Violent J from the rap group Insane Clown Posse discussing the birth of the beef between his group and superstar rapper Eminem and KRS-One talking about the incident that occurred between him and rapper Prince Be from the group P.M. Dawn. \n","torrent":{"xt":"urn:btih:f32cd77ba1d2818192ed182bf3a0196aee04ef0c","amp;dn":"Hip+Hop+Collection+-+Beef+II","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f32cd77ba1d2818192ed182bf3a0196aee04ef0c","infoHashBuffer":{"type":"Buffer","data":[243,44,215,123,161,210,129,129,146,237,24,43,243,160,25,106,238,4,239,12]},"announce":[],"urlList":[]}}