{"title":"When Life Doesn't Make Sense (Suffering, Loss, and Betrayal)","uid":15617736,"size":25730546,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:f39967a17e48f18ab52519d7d724ba7776c9068c&amp;dn=When+Life+Doesn%27t+Make+Sense+%28Suffering%2C+Loss%2C+and+Betrayal%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"catholicstuff","files":1,"time":1471847563,"description":"Fr. Benedict Groeschel - When Life Doesn’t Make Sense (Suffering, Loss, and Betrayal) [audio presentation]\r\n\r\nHave you ever wondered why bad things happen to good people? Trained psychologist Fr. Benedict Groeschel examines some of life's most difficult questions in the context of faith. He reveals penetrating insights and deeply personal reflections to find answers to the perpetually plaguing question &quot;Why?&quot;, and explains how in these painful moments, God manifests His loving Presence.\r\n\r\nThis CD contains the first two programs from the EWTN series &quot;What to do when life doesn't make sense?&quot; The first talk deals with the human condition and the ways in which we all suffer. Fr. Groeschel points us to the cross and the mystery that God himself, came down to earth, became a man, suffered, died and was buried. But He didn't leave us there. By death He conquered death and to those in the grave He granted life! God is about the business of turning our sufferings into resurrections.\r\n\r\nThe second talk deals with the loss or betrayal of friends. Again Fr. Groeschel points us to the betrayal and abandonment that Jesus experienced with His closest friends. Father encourages us with the knowledge that even when friends fail, God sends others into our lives to be with us in time of need. \r\n\r\n---\r\n\r\nIf you enjoy this presentation, please seed and support Lighthouse Catholic Media, NFP, which is a 501(c)(3) Not For Profit Company that seeks to answer the call for a New Evangelization. Lighthouse Catholic Media specializes in promoting the Catholic Faith through high quality presentations on audio CDs and MP3s from many of the best Catholic speakers in both English and Spanish. You can purchase CD copies of this presentation to give to your friends and family and find many other wonderful presentations available for MP3 download at https://www.lighthousecatholicmedia.org/ \r\n\r\nYou can also support Lighthouse Catholic Media and the New Evangelization by making a tax-deductible donation at https://www.lighthousecatholicmedia.org/donate\r\n\r\nFor more Catholic ebooks, audiobooks, audio presentations, movies &amp; video, visit \nhttps://thepiratebay.org/user/catholicstuff/","torrent":{"xt":"urn:btih:f39967a17e48f18ab52519d7d724ba7776c9068c","amp;dn":"When+Life+Doesn%27t+Make+Sense+%28Suffering%2C+Loss%2C+and+Betrayal%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f39967a17e48f18ab52519d7d724ba7776c9068c","infoHashBuffer":{"type":"Buffer","data":[243,153,103,161,126,72,241,138,181,37,25,215,215,36,186,119,118,201,6,140]},"announce":[],"urlList":[]}}