{"title":"Rainwater Kisses by Krista Lakes","uid":9615558,"size":285774,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f52769f347bd5f67d608e692f1daafe90d27c7fa&amp;dn=Rainwater+Kisses+by+Krista+Lakes&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"PirateBook","files":1,"time":1392414453,"description":"\nThe older sister of Emma LaRue wasn't looking for love. In fact, the last thing Kaylee LaRue thought as she attended her sister's Caribbean wedding was that she would meet a man as confident as Owen Parker. The suave businessman oozed charm, and when that charm was directed at Kaylee, it gave her pause. She couldn't be sure if the man was actually interested in her or just interested in a good time.\n\nIn reality, Owen Parker had never met anyone like Kaylee LaRue. The quiet girl from Iowa made him forget to breathe the first time he saw her. When he tried to work his magic, her wit proved to be a match for his, and his charms had no effect. He knew what it looked like- she probably thought that he wanted to have a vacation tryst with her just as Jack Saunders had with Emma. Nothing could be farther from the truth.\n\nKaylee tried hard not to yield to his advances, but their last night in the Caribbean was simply magical. After a passionate night spent in the arms of Owen, Kaylee ruefully observed that there was no fake wedding to keep the two of them together. As she flew home, she thought it'd be back to the same old life for her. She never expected Owen to show up at her door.\n\nHowever, this small town girl wasn't sure she was ready to change for this city boy. When Kaylee tried to fit into Owen's world, everything came crashing down. In the blink of an eye, what seemed like a strong foundation suddenly found itself built on a pillar of sand. Would their relationship blossom like Jack and Emma's, or would the two of them forever be haunted by the memories of rainwater kisses?\n\nGenre: Romance","torrent":{"xt":"urn:btih:f52769f347bd5f67d608e692f1daafe90d27c7fa","amp;dn":"Rainwater+Kisses+by+Krista+Lakes","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f52769f347bd5f67d608e692f1daafe90d27c7fa","infoHashBuffer":{"type":"Buffer","data":[245,39,105,243,71,189,95,103,214,8,230,146,241,218,175,233,13,39,199,250]},"announce":[],"urlList":[]}}