{"title":"Instrumental Tourist - VA [2012] - Lossy","uid":9212866,"size":132647033,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:f5b7df5ecf3e0bdf46491dc8206b6b334113810b&amp;dn=Instrumental+Tourist+-+VA+%5B2012%5D+-+Lossy&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Xern0n","files":-1,"time":1384819676,"description":"Contains the whole album of &quot;Instrumental Tourist&quot; by Tim Hecker &amp; Oneohtrix Point Never's Daniel Lopatin in 320 MP3.\n------------------------------------------------\n\nExcerpt from the Pitchfork review of the album\n &lt;a href=&quot;\nhttp://pitchfork.com/reviews/albums/17327-instrumental-tourist/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://pitchfork.com/reviews/albums/17327-instrumental-tourist/&lt;/a&gt;\n------------------------------------------------\n\nHecker and Lopatin admire each other's work and move in some of the same circles. Earlier this year, at Lopatin's urging, they got together to experiment. Crucially, they were actually in the same room together for the project, sharing sketches and creating new music in real time. When so much music is being made by sharing files online, the fact that they actually played together and improvised is unusual and gives the album a unique quality. Here and there you can hear artifacts from the sessions, like the &quot;Are you ready? We're recording...&quot; voices very quietly at the opening of &quot;Vaccination (for Thomas Mann)&quot;, which reinforce the air of spontaneity. One precedent for this sort of project comes from artists both producers admire, the collaborations between Christian Fennesz, Jim O'Rourke, and Peter Rehberg under the name Fenn O'Berg. But while those collaborations could be dense and heavily abstract, Instrumental Tourist is an easy listen, loaded with billowy atmosphere and discernible melody.\n\nIt's almost eerie in how you can hear the melding of two sounds. On tracks like &quot;Intrusions&quot;, &quot;Grey Geisha&quot;, and &quot;Vaccination No. 2&quot;, Hecker's blown-out digital shoegaze forms the basis of the tracks while Lopatin adds quasi global accents on top. On tracks like &quot;Vaccination (for Thomas Mann)&quot; and &quot;Racist Drone&quot;, Lopatin's thinner new age tones dominate and the accents are Hecker's. The overall mood drifts from lightly narcotic bliss to mild tension and then back again, but the album hangs together. The way these things usually work, it's unlikely that every &quot;Hecker-like&quot; sound comes from him and vice-versa. But it's uncanny how much these tracks sound like two guys jamming and bringing their individual voices into a shared context. ","torrent":{"xt":"urn:btih:f5b7df5ecf3e0bdf46491dc8206b6b334113810b","amp;dn":"Instrumental+Tourist+-+VA+%5B2012%5D+-+Lossy","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f5b7df5ecf3e0bdf46491dc8206b6b334113810b","infoHashBuffer":{"type":"Buffer","data":[245,183,223,94,207,62,11,223,70,73,29,200,32,107,107,51,65,19,129,11]},"announce":[],"urlList":[]}}