{"title":"MacFamilyTree v. 6.2.7 with Core keygen","uid":7110343,"size":92248624,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:f64269facdade1781ec231af18ed7c2ab3e0fe61&amp;dn=+MacFamilyTree+v.+6.2.7+with+Core+keygen&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"polisdavid","files":-1,"time":1332012642,"description":"Official Web Site: &lt;a href=&quot; http://www.syniumsoftware.com/macfamilytree/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.syniumsoftware.com/macfamilytree/&lt;/a&gt;\nApp Store Web Site:  &lt;a href=&quot; http://itunes.apple.com/us/app/macfamilytree/id402390872?mt=12&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://itunes.apple.com/us/app/macfamilytree/id402390872?mt=12&lt;/a&gt;\n\nEasily enter and then visualize your family history. Be it creating reports, diagrams or browsing your data in the innovative 3D view called Virtual Tree - MacFamilyTree offers a solution for every task. Get an overview of where you hail from and maybe enthuse your relatives about exploring your family's past at your upcoming family reunion.\n\nVisualize\n\nMacFamilyTree turns dates, names and facts into informative and impressive reports and diagrams. Explore your close and not so close relatives and easily spot persons whose history you might want to dig deeper into. Of course, standard Ancestor Charts, Fan Charts, Descendant Charts, Statistics, Person Reports, Family Reports and several other visualizations can be created and printed with ease.\n\nResearch\n\nCollect data and enter it in MacFamilyTree on your Mac or MobileFamilyTree on your iPhone, iPod touch or iPad. Genealogy work has never been more convenient and rewarding. MacFamilyTree's intuitive user interface makes the otherwise time-consuming work of entering all information about family members comfortable and purposeful. Whenever you encounter new information, adding it to your data is a breeze.\n\nBuilt for Mac OS X\n\nMacFamilyTree is not just another cross-platform application written for MS Windows and ported over to Mac OS X. Being developed exclusively for Mac OS X 10.5 Leopard, Mac OS X 10.6 Snow Leopard and Mac OS X 10.7, MacFamilyTree profits from the latest and greatest in Apple's Core Technologies. Many convenience features in MacFamilyTree make heavy use of CoreAnimation to point out important information, create shortcuts for you and just make you feel right at home as a Mac user. The CoreData database technology performs well even when browsing family trees of tens of thousands of entries. And on the more recent Macs with Mac OS X 10.6 or Mac OS X 10.7 installed, MacFamilyTree even runs in 64 Bit, squeezing out that last bit of processing power so you don't have to wait for your Mac to catch up with your own working speed.\n\n14 Years of MacFamilyTree\n\nBetween the first release and the latest version 6 of our program for genealogists, a total of 12 years of development were invested. If you're interested, take the grand scenic tour around the development history of MacFamilyTree from as early as 1998 up until today's version 6.\n\nSystem Requirements:\n\nIntel of PPC Mac, OS X.5 or greater (Lion compatible)\n\n--- PLEASE SEED ---\n\n\n","torrent":{"xt":"urn:btih:f64269facdade1781ec231af18ed7c2ab3e0fe61","amp;dn":"+MacFamilyTree+v.+6.2.7+with+Core+keygen","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f64269facdade1781ec231af18ed7c2ab3e0fe61","infoHashBuffer":{"type":"Buffer","data":[246,66,105,250,205,173,225,120,30,194,49,175,24,237,124,42,179,224,254,97]},"announce":[],"urlList":[]}}