{"title":"Daylene Rio -That Busty, Lusty Spanish Teacher ScoreHD.wmv","uid":8895684,"size":321143988,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:f64b7c0f0adf477aa1d1b2ee68700e20751cc1d6&amp;dn=Daylene+Rio+-That+Busty%2C+Lusty+Spanish+Teacher+ScoreHD.wmv&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":null,"files":1,"time":1378696146,"description":" &lt;a href=&quot;http://picturemost.biz/share.php?id=BA94_522D1ECF&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://picturemost.biz/share.php?id=BA94_522D1ECF&lt;/a&gt;\n\nWho better to teach Spanish than this sexy damsel? Miss Daylene Rio, SCORE Girl and a part-time Spanish-language instructor in an adult education class, is trying to tutor a guy who has other things on his mind. These things include Miss Rio's whopping blouse mountains, her jutting bubble butt and her cock sucking lips plus her beautiful face and shapely legs. Who the fuck can concentrate on any subject with an instructor like this?\n\nThis doesn't give Johnny a pass when, during a private Spanish lesson, he loses his mind, makes a grab for her culo and then her whoppa-whoppas. Miss Rio is shocked at his overgrown-delinquent behavior but not so shocked that she doesn't cave-in to her own horny desires. Before she can say &quot;Class dismissed,&quot; her thick nipples are being sucked and her heavy tits fucked right there by her desk.\n\nThrowing caution (and her skirt, low-cut top, bra, heels and panties) to the wind, Miss Rio finds her hot hole getting finger-banged. There goes the Spanish lesson out the window. Daylene drops to her knees and, her massive, naked tits dangling and hanging free, feasts on Johnny's extra-large enchilada, trying to stuff as much as she can into her hungry mouth. She squeezes her heavy pillows together--with his cock in the middle--one of her favorite things to do for a guy. If it was a tube of toothpaste, every speck would have been squeezed out.\n\nDaylene gets on her desk for her first dose of hard wood in her pussy and by the time her boob-shaking fuck class ends with a splash, they'll have fucked on the floor, fucked standing up and fucked on a chair. He even picks Miss Rio up and carry-fucks her. Looks like he's getting an A and a gold star from Miss Rio. When the teacher is stacked and hot Daylene, who would not want to be her #1 pupil? This student has taught the teacher a few tricks!\n\n\nSize: 321143988 bytes (306.27 MiB), duration: 00:18:49, avg.bitrate: 2276 kb/s\nAudio: wmav2, 44100 Hz, 2 channels, s16, 128 kb/s\nVideo: wmv3, yuv420p, 1280x720, 29.97 fps(r)","torrent":{"xt":"urn:btih:f64b7c0f0adf477aa1d1b2ee68700e20751cc1d6","amp;dn":"Daylene+Rio+-That+Busty%2C+Lusty+Spanish+Teacher+ScoreHD.wmv","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f64b7c0f0adf477aa1d1b2ee68700e20751cc1d6","infoHashBuffer":{"type":"Buffer","data":[246,75,124,15,10,223,71,122,161,209,178,238,104,112,14,32,117,28,193,214]},"announce":[],"urlList":[]}}