{"title":"One Sheaf, One Vine: Racially Conscious White Americans Talk Abo","uid":11760322,"size":897153,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f682fdb1996dd768f8d46704e68dcd29922c92ba&amp;dn=One+Sheaf%2C+One+Vine%3A+Racially+Conscious+White+Americans+Talk+Abo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"HowdyDooDoo","files":1,"time":1426564678,"description":"This book is made up of the personal statements about race from seventeen white Americans. What they share is that, for them, the fact that they are white is more than an incidental, insignificant, or peripheral aspect of their being; it is central to how they view themselves and conduct their lives. The men and women you will meet in this book aren't public figures or leaders of organizations. They are everyday people: a postal worker from Philadelphia, a college student from Texas, an attorney from New York City, a bookstore owner from Washington State, an appliance repair man from Connecticut, a teacher from Chicago, and so on. We have a very negative image of racially conscious and committed whites gained largely from the media: neo-Nazi bigots, menacing skin heads, thugs who commit hate crimes. We are informed about people of this sort, but we don't hear from them. They aren't on television news shows speaking for themselves. They don't make movies or publish books. Politicians don't articulate their perspective or advocate their positions. Journalists and intellectuals don't write about them unless it is to be little them. Schools make no attempt to deal with them objectively. In this book, you'll hear from them. The words in this book are the speakers' as they spoke them; they haven't been altered, softened, or censored. And more than come to know their thoughts on race, you'll meet these people as human beings. Some of them you won't soon forget. Democracy depends on the free exchange of ideas. You make the call whether what these Americans have to say is to any extent valid. You decide whether what they say has any implications for what you believe and the way you believe","torrent":{"xt":"urn:btih:f682fdb1996dd768f8d46704e68dcd29922c92ba","amp;dn":"One+Sheaf%2C+One+Vine%3A+Racially+Conscious+White+Americans+Talk+Abo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f682fdb1996dd768f8d46704e68dcd29922c92ba","infoHashBuffer":{"type":"Buffer","data":[246,130,253,177,153,109,215,104,248,212,103,4,230,141,205,41,146,44,146,186]},"announce":[],"urlList":[]}}