{"title":"Indie Classic!: Ride - Going Blank Again [1992]","uid":3532229,"size":72647963,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:f6e5efdb37b9889b09258434210f9646bf5e58e5&amp;dn=Indie+Classic%21%3A+Ride+-+Going+Blank+Again+%5B1992%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"tigerduck","files":10,"time":1159729695,"description":"&quot;From the sounds of the cloistered, chaotic opener, &quot;Leave Them All Behind,&quot; Going Blank Again sounds like it could be headed down the same Nowhere path. Guitars as far as the ear can hear -- not much different from the effect gained after riding a sit-and-spin for eight straight minutes -- are just as dizzying as the prior record&amp;#039;s opener. But rather than sink into a thick underbelly of melancholy, Going Blank Again offers sunshiney melodies and gleaming, bold production. All the band&amp;#039;s elements are more pliable, and overall it&amp;#039;s pretty cheery. In fact, some of the album could be loosely classified as power pop. Bouncy tunes like &quot;Twisterella,&quot; &quot;Not Fazed,&quot; &quot;Mouse Trap,&quot; and &quot;Time of Her Time&quot; each share more than a thing or two in common with the likes of Teenage Fanclub, but with more layered vocals and less-cutting guitars. Though Ride&amp;#039;s guitars don&amp;#039;t bite as much, there are loads of them everywhere; the band doesn&amp;#039;t completely sacrifice their love of reverberating noise, but it&amp;#039;s more done in the name of pop than to merely cause a blistering racket. Though the lyrics often read as overtly simple or obtuse (a common Ride foible), Mark Gardener&amp;#039;s and Andy Bell&amp;#039;s voices are too pretty to let this shortcoming mar things. They create enough of a mood with their proper instruments, and their sighing and random vocal intonations are undeniably lovely. No longer do they hide shortcomings with sheets of distortion, and there&amp;#039;s a lot more focus and confidence on display throughout. Don&amp;#039;t let a Ride fan tell you otherwise: Going Blank Again is anything but empty.&quot;\n\nTracklist:\n1.Leave Them All Behind \n2.Twisterella\n3.Not Fazed\n4.Chrome Waves\n5.Mousetrap\n6.Time of Her Time\n7.Cool Your Boots\n8.Making Judy Smile\n9.Time Machine\n10.OX4","torrent":{"xt":"urn:btih:f6e5efdb37b9889b09258434210f9646bf5e58e5","amp;dn":"Indie+Classic%21%3A+Ride+-+Going+Blank+Again+%5B1992%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f6e5efdb37b9889b09258434210f9646bf5e58e5","infoHashBuffer":{"type":"Buffer","data":[246,229,239,219,55,185,136,155,9,37,132,52,33,15,150,70,191,94,88,229]},"announce":[],"urlList":[]}}