{"title":"Fundamentals of Midwifery -A Textbook for Students (2015) Gooner","uid":12425155,"size":10398081,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f79b1b23181e7670dbe6bcc5fc6c11a2556c35e1&amp;dn=Fundamentals+of+Midwifery+-A+Textbook+for+Students+%282015%29+Gooner&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"GoonerTPB","files":1,"time":1442361776,"description":"Publisher: Wiley-Blackwell; 1 edition (March 2, 2015)\nLanguage: English\nISBN-10: 1118528026\nISBN-13: 978-1118528020\n\nFundamentals of Midwifery: A Textbook for Students makes the subject of midwifery accessible, informative and motivating, ensuring that it is an essential text for the aspiring midwife! This resource brings together knowledge from a collection of clinical experts and experienced academics to support your learning and prepare you for the challenges faced in contemporary midwifery healthcare. It presents you with the 'must-have' information that you need concerning both the theoretical and practical aspects of what it means to be a midwife. With extensive full colour illustrations throughout, as well as activities and scenarios, this user-friendly textbook will support you throughout your entire education programme. Fundamentals of Midwifery is essential reading for all pre-registration student midwives, as well as newly qualified midwives. KEY FEATURES: * Broad and comprehensive in scope, with chapters on: team working; antenatal care, intrapartum and postnatal care; infant feeding; public health and health promotion; perinatal mental health; complementary therapies; pharmacology and medicines management; and emergencies. * Interactive and student-friendly in approach, with activities throughout. * Brings together professional and clinical topics in one user-friendly book. * Ties in with the latest NMC Standards for pre-registration midwifery education. * Supported by an online resource centre featuring interactive multiple-choice questions, additional scenarios and activities, and links to further reading","torrent":{"xt":"urn:btih:f79b1b23181e7670dbe6bcc5fc6c11a2556c35e1","amp;dn":"Fundamentals+of+Midwifery+-A+Textbook+for+Students+%282015%29+Gooner","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f79b1b23181e7670dbe6bcc5fc6c11a2556c35e1","infoHashBuffer":{"type":"Buffer","data":[247,155,27,35,24,30,118,112,219,230,188,197,252,108,17,162,85,108,53,225]},"announce":[],"urlList":[]}}