{"title":"Crysis","uid":7771073,"size":25464042,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:f877af17c7a758f91ffa08e42fe783a60d96d783&amp;dn=Crysis&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Honda1890","files":1,"time":1351532116,"description":"Crysis 2 Guide: Professional Edition by TriggerSmash.com\nThis is a must have application for all Crysis 2 players. Whether your just starting out or whether you have been playing with the pros this application covers every single aspect of the game from a vast amount of people and organizations around the world. This includes game developers, MLG professionals, and several other large gaming corporations such as IGN and GameSpot.\nAs you may already know, Crysis 2 is all about game strategy and tactics if you don't know all of the special perks and game play tactics then you will be left out to dry. This application and its guides go in depth on game specific details that you would have never thought of. This professionals guide is completely uncut and unedited and 100% available to you. You may use these guides, tips, secrets, and information at your own will as long as you do not reveal these professional trademark tactics to your opponents.\nNew Information will added and old information will be updated as soon as possible. So please keep in mind and be on the lookout for the latest updates.\nDevelopers Note: This application is one of a kind and its information is time sensitive. As other people start to figure this out then the harder it will be to face your opponents in the battlefield. If you own Crysis 2 then you will want to own this application.","torrent":{"xt":"urn:btih:f877af17c7a758f91ffa08e42fe783a60d96d783","amp;dn":"Crysis","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f877af17c7a758f91ffa08e42fe783a60d96d783","infoHashBuffer":{"type":"Buffer","data":[248,119,175,23,199,167,88,249,31,250,8,228,47,231,131,166,13,150,215,131]},"announce":[],"urlList":[]}}