{"title":"[FFF] Btooom! 01 - 12 [TV][10bit]","uid":8054976,"size":4459706945,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:f87e41a113119ee8cd816c973f93524298aefd7f&amp;dn=%5BFFF%5D+Btooom%21+01+-+12+%5BTV%5D%5B10bit%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"k1ng_ruLz","files":12,"time":1358941810,"description":"BTOOOM : Episode 01 - 12\n\n\n\n\nSakamoto Ryota is an unemployed 22 year old who lives with his mother. In the real world, there may be nothing special about him, but online, he's one of the world's top players of the combat game called Btooom. One day, he awakes in wat appears to be a tropical island, though he has no memory of how or why he has come to be there. while wandering around, Ryota sees someone and calls out for help. The stranger responds by throwing a bomb at him, now Ryota realizes both that his life is in danger, and that he has somehow been trapped in a real-life version of his favorite game. Will Ryota be able to survive long enough to figure out how and why he ended up there.\nSakamoto Ryota is an unemployed 22 year old who lives with his mother. In the real world, there may be nothing special about him, but online, he's one of the world's top players of the combat game called Btooom. One day, he awakes on what appears to be a tropical island, though he has no memory of how he got there or why. While exploring the island, Ryota runs into a mysterious being who attacks him by throwing a bomb at him. Ryota then realizes that both his life is in danger, and that he has somehow become trapped in a real-life version of his favorite game. Ryota must now survive through the nightmare to figure out the reason why he ended up in the game in the first place.\n\n\n\n\nAired: Oct 4, 2012 to Dec 20, 2012\n\n\nAudio language : Japanese\n\n\nSubTitle language : English\n\n\nGenres: action, psychological, science fiction","torrent":{"xt":"urn:btih:f87e41a113119ee8cd816c973f93524298aefd7f","amp;dn":"%5BFFF%5D+Btooom%21+01+-+12+%5BTV%5D%5B10bit%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f87e41a113119ee8cd816c973f93524298aefd7f","infoHashBuffer":{"type":"Buffer","data":[248,126,65,161,19,17,158,232,205,129,108,151,63,147,82,66,152,174,253,127]},"announce":[],"urlList":[]}}