{"title":"Inkscape - Guide to a Vector Drawing Program 4th Edition{BBS}","uid":6654151,"size":30588995,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f9a8c9b51527cf082bc7c2fdba83b5d8783b1c6f&amp;dn=Inkscape+-+Guide+to+a+Vector+Drawing+Program+4th+Edition%7BBBS%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bigbluesea","files":-1,"time":1315266629,"description":"Inkscape: Guide to a Vector Drawing Program, Fourth Edition, is the guide to the Inkscape program. With coverage of versions 0.47 and 0.48, this authoritative introduction and reference features hundreds of useful illustrations.Using Inkscape, you can produce a wide variety of art, from photorealistic drawings to organizational charts. Inkscape uses SVG, a powerful vector-based drawing language and W3C web standard, as its native format. SVG drawings can be viewed directly in browsers such as Firefox, Opera, Chrome, Safari, and Internet Explorer 9. A subset of SVG has been adopted by the mobile phone market. Inkscape is available free for Windows,Macintosh, and Linux operating systems.\n\n \n\nSystematic coverage of the entire Inkscape program begins with twelve tutorials ranging in difficulty from very basic to highly complex. A new tutorial introduces the use of interactive SVG in HTML5.The remainder of the book covers each facet of Inkscape in detail, with an emphasis on practical solutions for common problems. The book is filled with valuable tips and warnings about the use of Inkscape and SVG. Find dozens of Inkscape illustrations from the book in the online color supplement available at http://tavmjong.free.fr/INKSCAPE/.\n\n \n\nUpdated for Inkscape version 0.48, this edition includes complete coverage of new features, including the new Spray Tool, updated Node and Text tools, improved bitmap image import, LaTeX export for PDF/EPS/PS, added extensions including the JessyInk extension for web-based presentations, the adaptive UI, and the new Glyphs dialog.\n\n \n\nComplete Coverage of New and Improved Inkscape 0.48 Features\n\n    *\n      Live Path Effects for tasks such as adding patterns along a path while maintaining complete editability\n    *\n      More than two hundred pre-built SVG filters for adding textures, manipulating color, and so forth\n    *\n      A tiling tool to create complex tilings with thirteen different symmetries\n    *\n      Clipping and Masking objects\n    *\n      An integrated spell checker\n    *\n      Built-in bitmap-to-vector tracing\n    *\n      The ability to export to more than a dozen graphics formats, including PDF and PostScript\n    *\n      The ability to import from more than two dozen graphics formats, including PDF, Adobe Illustrator, Corel Draw, AutoCad, and XFig Graphics\n    *\n      Complete vector drawing program supporting the W3C SVG standard\n    *\n      Three path-drawing tools (Pencil, Pen, Calligraphy)\n    *\n      Five shape-drawing tools (Rectangles, Ellipses, Stars, Spirals, 3D Boxes)\n    *\n      Linear and Radial Gradients\n    *\n      Pattern fills\n    *\n      Tweak Tool for fine adjustment of paths and colors\n    *\n      Spray Tool\n    *\n      Eraser Tool with both Vector and Bitmap modes\n    *\n      Sophisticated snapping for precision drawing and aligning objects\n    *\n      Extendable through scripting; more than one hundred scripts included\n\n\n\n    * Paperback: 504 pages\n    * Publisher: Prentice Hall; 4 edition (May 16, 2011)\n    * Language: English\n    * ISBN-10: 0132764148\n    * ISBN-13: 978-0132764148","torrent":{"xt":"urn:btih:f9a8c9b51527cf082bc7c2fdba83b5d8783b1c6f","amp;dn":"Inkscape+-+Guide+to+a+Vector+Drawing+Program+4th+Edition%7BBBS%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f9a8c9b51527cf082bc7c2fdba83b5d8783b1c6f","infoHashBuffer":{"type":"Buffer","data":[249,168,201,181,21,39,207,8,43,199,194,253,186,131,181,216,120,59,28,111]},"announce":[],"urlList":[]}}