{"title":"Shinyribs - Gulf Coast Museum [2013][WEB/FLAC]","uid":10574527,"size":230231919,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:f9ebe0348f44ce3d108a62ada106765ca7984df1&amp;dn=Shinyribs+-+Gulf+Coast+Museum+%5B2013%5D%5BWEB%2FFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dickspic","files":-1,"time":1405626370,"description":"FLAC / Lossless \nLabel/Cat#: Nine Mile Records #NMR 0211\nCountry: USA\nYear: April 16, 2013\nGenre: Americana\nFormat: WEB,Album\n\n\n1. Sweeter Than The Scars 05:05\n2. Take Me Lake Charles 03:16\n3. Limpia Hotel (Chihuahua Desert) 04:21\n4. Somebody Else 04:43\n5. Texas Talking 03:26\n6. Bolshevik Sugarcane 03:54\n7. Sweet Potato 04:41\n8. Song Of Lime Juice &amp; Despair 03:20\n9. If You Don't Know Me By Now 02:54\n\n\n\n\n\nShinyribs frontman Kevin Russell has made a career out of writing soulfully obscure rock with a distinctively Texan stamp. Throughout his 18 years as co-leader of Austin's legendary alt-country outfit the Gourds, Russell's warm, throaty drawl has hooted, warbled, and crooned its way through an immense catalog of bizarre and uniquely crafted songs. Alongside co-frontman Jimmy Smith, the Gourds carved out a sort of alternate-dimension Texan mythology that Russell continues to expand with his second Shinyribs release, 2013's Gulf Coast Museum. Pulling together tattered bits of soul, gospel, blues, and rock, Russell applies his bearded charm to nine songs that play like a road trip though his Gulf Coast roots. The wonderful opener &quot;Sweeter Than the Scars&quot; rides a mysterious mandolin/Wurlitzer groove to its guttural, chanting conclusion. The band swings lazily through &quot;Take Me Lake Charles&quot; before a languid trip back to West Texas on &quot;Limpia Hotel (Chihuahua Desert).&quot; If this kind of material hasn't already been covered by Russell in some way or another over the years, it certainly feels like a natural and familiar extension of his previous work. The barroom rave-up &quot;Bolshevik Sugarcane&quot; and the weirdly tender &quot;Sweet Potato&quot; both seem like vintage Russell, but it's on the two largely acoustic ballads where he shows a softness and subtlety that really work for him. The lovely &quot;Somebody Else&quot; is a classic slow country waltz and the gentle, unexpected ukulele cover of Harold Melvin's classic soul ballad &quot;If You Don't Know Me by Now&quot; closes the album on a graceful note. Throughout his Gourds tenure and now with Shinyribs, Russell seems to be the kind of prolific artist who delivers a steady stream of reliable albums to a core group of loyal fans. His style is certainly his own, and he's got plenty of originality left in the tank as evidenced by this Gulf Coast Museum.","torrent":{"xt":"urn:btih:f9ebe0348f44ce3d108a62ada106765ca7984df1","amp;dn":"Shinyribs+-+Gulf+Coast+Museum+%5B2013%5D%5BWEB%2FFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f9ebe0348f44ce3d108a62ada106765ca7984df1","infoHashBuffer":{"type":"Buffer","data":[249,235,224,52,143,68,206,61,16,138,98,173,161,6,118,92,167,152,77,241]},"announce":[],"urlList":[]}}