{"title":"The Reavers by GMFraser - 128Kbps - Audio Book","uid":3944645,"size":494863781,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:fa3ac712b2a4f678efec21a9865bf2de16d55491&amp;dn=The+Reavers+by+GMFraser+-+128Kbps+-+Audio+Book&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"myth100","files":122,"time":1198380155,"description":"Book Description\n================\nGeorge MacDonald Fraser&amp;#039;s eye for the absurd, and his historical knowledge, combine wonderfully to paint a unique and witty picture.\n\nSynopsis\n========\nElizabethan England, and a dastardly Spanish plot to take over the throne is uncovered. It&amp;#039;s up to Agent Archie Noble to save Queen and country in this saucy and swashbuckling romp from the bestselling author of &amp;#039;The Flashman Papers&amp;#039; and &amp;#039;The Pyrates&amp;#039;. Spoiled, arrogant, filthy rich, and breathtakingly beautiful, the young Lady Godiva Dacre is exiled from the court of Good Queen Bess (who can&amp;#039;t abide red-haired competition) to her lonely estate in distant Cumberland, where she looks forward to bullying the peasantry and getting her own imperious way. Little does she guess that the turbulent Scottish border is the last place for an Elizabethan heiress, beset by ruthless reivers (many of them unshaven), blackmailing ruffians, fiendish Spanish plotters intent on regime change and turning Merrie England into a ghastly European Union province. And no one to rely on but her half-witted blonde school chum, a rugged English superman with a knack for disaster, and a dashing highwayman who looks like Errol Flynn but has a Glasgow accent.To say nothing of warlocks, impersonators, taxi-drivers riding brooms, burlesque artists, the drunkest man in Scotland, and several quite normal characters - well, he&amp;#039;s getting on, and was bound to crack eventually. He admits (nay, insists) that it&amp;#039;s a crazy story for readers who love fun for its own sake.","torrent":{"xt":"urn:btih:fa3ac712b2a4f678efec21a9865bf2de16d55491","amp;dn":"The+Reavers+by+GMFraser+-+128Kbps+-+Audio+Book","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fa3ac712b2a4f678efec21a9865bf2de16d55491","infoHashBuffer":{"type":"Buffer","data":[250,58,199,18,178,164,246,120,239,236,33,169,134,91,242,222,22,213,84,145]},"announce":[],"urlList":[]}}