{"title":"Poker Pro 2006 + Fix! [RESEED] This time the setup works!","uid":3518148,"size":12689146,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:fa809ceceba60ed7b970fe26f443a0af35932f3f&amp;dn=Poker+Pro+2006+%2B+Fix%21+%5BRESEED%5D+This+time+the+setup+works%21&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"CoLLecToR 91","files":4,"time":1157137392,"description":"This is a re-seed of another torrent, where the setup got corrupted.\nThis is fixed here, so PLEASE DO NOT DOWNLOAD MY OTHER TORRENT, DOWNLOAD THIS!\nAnd pleas, help me seed!\n\nPokerPro 2006 is a Poker Odds calculator which gives you advice what to do!\nIt auto read cards and runs smoothly in the background.\nA voice will tell you to call, fold, bet or bluff when its your turn!\nIt&amp;#039;s really good, if your playing in a tournament with real money!\n\nIt comes with a fix, so you wont have to pay for it.\n\nREAD THIS TO UNDERSTAND HOW TO USE THE FIX/CRACK/PATCH:\n\n1.Install PokerPro 2006, do not run it yet.\n2.Copy the patch to the app directory (eg C:\\Programfiles\\PokerPro)\n3.Run the patch, and click &quot;patch&quot;.\n4.Open PokerPro and enter any registration name and number. It will be accepted.\n5.DO NOT UPDATE IT, OR ELSE IT WONT WORK!\n\n-Enjoy!\n\nMore info:\n\nPoker Pro is the industries most advanced online poker tool incorporating an online poker calculator, opponent tracking and poker strategy. Poker Pro gives you the powerful tools you need make calculated decisions on your Poker strategy. Whether you want to learn poker, know your odds of hitting a particular hand or to keep track of your opponents, have a game plan for every hand. The online poker calculator automatically advises whether to raise, fold, bluff, slow-play, or check-raise. Poker Pro captures all of the information about the poker game in real-time, including your cards, position, betting activity, pot odds, odds of winning and the number of players at the table. Poker Pro is designed for hold&amp;#039;em Poker Limit, hold&amp;#039;em no-limit and hold&amp;#039;em tournament play and currently supports online poker sites like Party Poker, Pacific Poker, Poker Stars, Betfair, Poker Room, and Paradise Poker.\t","torrent":{"xt":"urn:btih:fa809ceceba60ed7b970fe26f443a0af35932f3f","amp;dn":"Poker+Pro+2006+%2B+Fix%21+%5BRESEED%5D+This+time+the+setup+works%21","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fa809ceceba60ed7b970fe26f443a0af35932f3f","infoHashBuffer":{"type":"Buffer","data":[250,128,156,236,235,166,14,215,185,112,254,38,244,67,160,175,53,147,47,63]},"announce":[],"urlList":[]}}