{"title":"Putumayo Presents-South Pacific Islands by Ulysses56","uid":3513024,"size":86806496,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:fafc876febab76fa302f42d51945f64cb9388bd7&amp;dn=Putumayo+Presents-South+Pacific+Islands+by+Ulysses56&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ulysses56","files":14,"time":1155756864,"description":"Putumayo Records Presents:\nSouth Pacific Islands  2004\nAn extraordinary collection of contemporary music from the beautiful islands of the South Pacific\nRip VBR\nCovers Included\n\nPutumayo presents South Pacific Islands, one of the first widely distributed collections of contemporary music from this remote region of the world. In fact, most of the artists featured on South Pacific Islands are little known outside their country of origin. \nBlessed with stunning natural beauty and unique cultures, the islands of the South Pacific have long symbolized paradise on Earth to outsiders. Of course, life is more complicated than travel brochures and Gauguin paintings would lead one to believe. The people of the South Pacific, like elsewhere, struggle with the impact of modernization and are fighting to revitalize and redefine their traditions before they disappear. \nBoth Telek and O-shen come from Papua New Guinea, a tropical archipelago of dense rainforests and active volcanoes. Telek combines ancient Tolai traditions and contemporary Western music without compromising his native culture. O-shen, the son of American missionaries who was raised in a remote Papuan village, fuses traditional Pacific music with hip-hop and reggae. \nOK! Ryos and Gurejele are leading figures in New Caledonia?s Kaneka movement, a unique music that blends local polyphonic singing styles and traditional rhythms of the Kanak culture with pop and world beat flavors. \nTe Vaka, a New Zealand-based band with members from across Oceania, is creating a pan-Pacific pop music that incorporates elements from a variety of cultures into an appealing fusion. Fellow New Zealander Whirimako Black endeavors to bring Maori music, culture, and language to a broader audience. \nFinally, from far-off Rapa Nui, better known as Easter Island, comes Matato?a. Their native language is now spoken by less than 3000 people and is blended here with an upbeat, cross-cultural mix of music. \n\nTracklist:\nTe Vaka - Luliana \nMatato&amp;#039;a - Mana Ma&amp;#039;Ohi \nTe Vaka - Sei Ma Le Losa \nTelek - Abebe \nTe Vaka - Haloa Olohega \nOK! Ryos - Nengone Nodegu \nWhirimako Black - Wahine Whakairo \nTe Vaka - Nukukehe \nO-shen - Siasi \nOK! Ryos - Co Era So \nGurejele - Watolea \n\nThis is one of the many PutumayoÂ´s records I have in mind to upload, so please help keep seeding after you downloaded.\nEnjoy It!\nUlysses56\n\n\nFor more info: http://www.putumayo.com/\n","torrent":{"xt":"urn:btih:fafc876febab76fa302f42d51945f64cb9388bd7","amp;dn":"Putumayo+Presents-South+Pacific+Islands+by+Ulysses56","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fafc876febab76fa302f42d51945f64cb9388bd7","infoHashBuffer":{"type":"Buffer","data":[250,252,135,111,235,171,118,250,48,47,66,213,25,69,246,76,185,56,139,215]},"announce":[],"urlList":[]}}