{"title":"Manga Downloader 5.1.3 - Cyclonoid","uid":9551808,"size":10129428,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:fb61434ffa8d4f743fbf77f9f5744b6522438054&amp;dn=Manga+Downloader+5.1.3+-+Cyclonoid&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"cyclonoid","files":5,"time":1391281940,"description":"==============================================================================\n             DomDomSoft Manga Downloader 5.1.3 - Cyclonoid\n\nIMG:-\n==============================================================================\nDomDomSoft Manga Downloader is an easy to use application that enables you to download your favorite manga from a wide array of websites, while also providing some other tools to help you in this task.The program comes with an impressive collection of links to download manga, so it normally takes just a few seconds before the actual download process begins.\n\nThe interface is pretty intuitive, with a drop-down menu to allow users to pick the site they wish to search on for their favorite manga episodes. There's a search box as well, along with a list to display all manga content found on the selected websites.\n\nOf course, DomDomSoft Manga Downloader also comes with a bookmark manager, which means the user is able to add his very own websites to the list. Besides downloading, users are also offered an option to read the content online, rename a particular episode or bookmark it for later download. After the file lands on your computer, there are multiple features available, including a dedicated tool to open it with your favorite manga reader.\n\nWhich means that you need to install a separate manga reader as well, as DomDomSoft Manga Downloader doesn't come with built-in features to handle this task.\n\nThe Options menu includes tons of settings regarding most of its features, but also dedicated preferences to choose the default download folder, watermark, images and proxy setup.\n\nAll in all, DomDomSoft Manga Downloader is a decent solution if you're a manga fan and since it comes with such a small fee, it deserves a chance.\n\nOS : Windows XP, Vista, 7, and 8\nLanguage : English\n\nHome Page - http://domdomsoft.com\n\n\n                Don't be a jerk read the read me txt :)\n\n\n            Please Continue to seed after download Finishes\t","torrent":{"xt":"urn:btih:fb61434ffa8d4f743fbf77f9f5744b6522438054","amp;dn":"Manga+Downloader+5.1.3+-+Cyclonoid","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fb61434ffa8d4f743fbf77f9f5744b6522438054","infoHashBuffer":{"type":"Buffer","data":[251,97,67,79,250,141,79,116,63,191,119,249,245,116,75,101,34,67,128,84]},"announce":[],"urlList":[]}}