{"title":"Citizenship and Mental Health [MyebookShelf]","uid":11631556,"size":1882336,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:fbffa4a29451fbe7eb501a649d886ef88418ceb2&amp;dn=Citizenship+and+Mental+Health+%5BMyebookShelf%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"MyeBookShelf","files":-1,"time":1417679790,"description":"Citizenship and Mental Health [MyebookShelf]\nEnglish | 2015 | ISBN: 019935538X | 272 pages | PDF | 2 MB\n\nMore than 50 years ago, President Kennedy gave an address to congress that launched the community mental health movement in the U.S. This movement involved a vast and complex effort to replace the wholesale institutionalization of people with serious mental illnesses with community mental health centers, public education on mental illness, and prevention efforts. The mission and main thrust of this new movement, however, were quite simple: we would provide effective mental health treatment to people in their home communities and provide the conditions for them to have 'a life in the community.'\n\nStarting in the 1990s with Jim, a person who was homeless and initially refused help from outreach workers, Citizenship and Mental Health tells a 20-year story of practice, theory, and research to support the full participation of persons with mental illnesses who, in many cases, have also been homeless, have criminal charges in their past, and are poor. As the first of its kind, this book addresses the concept of citizenship as an applied theory for fulfilling the promise of the community mental health center movement. Citizenship is defined as a strong connection to the 5 R's of rights, responsibilities, roles, resources, and relationships that society offers to its members, and a sense of belonging that comes from others' recognition of one's valued membership in society. The citizenship model supports the strengths, hopes, and aspirations of people with mental illnesses to become neighbors, community members, and citizens","torrent":{"xt":"urn:btih:fbffa4a29451fbe7eb501a649d886ef88418ceb2","amp;dn":"Citizenship+and+Mental+Health+%5BMyebookShelf%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fbffa4a29451fbe7eb501a649d886ef88418ceb2","infoHashBuffer":{"type":"Buffer","data":[251,255,164,162,148,81,251,231,235,80,26,100,157,136,110,248,132,24,206,178]},"announce":[],"urlList":[]}}