{"title":"Dirty Masseur 8 [DVDRip]","uid":11716548,"size":2221698201,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:fc3279f4704a23a7ed477db3e25992046eed2423&amp;dn=Dirty+Masseur+8+%5BDVDRip%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"H4ckuos","files":1,"time":1424605835,"description":"Category\tAll Sex, Brazzers' Dirty Masseur Series\n\nStarring\tAlektra Blue, Nikki Benz, Mia Malkova, Amy Ried, Christy Mack, Megan Salinas, Blake Rose\n\nThe hottest pornstars getting the happiest of endings!\n\n\n\nScience Friction\n\nChristy Mack is about to run her favorite massage programs on her hologram deck. When the program runs its fingers between her legs, and into the crack of her plush butt, Christy gets so horny she inputs the command for a deep and satisfying fuck.\n\nWhite Yoga Pants\n\nMia Malkova was doing her daily yoga workout with her trainer Richie Black. He offered to help Mia out with a nice massage. He got around to rubbing her gorgeous juicy booty and big natural tits. She was so damn horny that she had to get a taste of his big cock!\n\nTry Before You Buy\n\nBefore Bill hires any women to work for him, he needs to make sure their massage skills are up to standard. Thankfully, Megan Salinas is a quick study, and the touch of Bill's hands rubbing oil into her juicy Latina ass fills her with excitement to fuck that very second.\n\nAmy's Ass Massage\n\nAmy Reid has booked herself a house-call from a dirty masseur who comes highly recommended by all her friends. She got started rubbing herself down. By the time Keiran showed up, her pussy was soaking wet and ready to get pounded hard.\n\nHorny Hosts Of Hell\n\nThose dirty devils Alektra and Nikki dragged Johnny down to hell to get a piece of his huge cock. They've laid him on a table, and started rubbing down his oily body with their huge tits. They're hoping to seduce him with a nasty threesome so he'll never want to leave.\n &lt;a href=&quot;\nhttp://xxxhost.info/img-54e9b4951e486.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.info/img-54e9b4951e486.html&lt;/a&gt;","torrent":{"xt":"urn:btih:fc3279f4704a23a7ed477db3e25992046eed2423","amp;dn":"Dirty+Masseur+8+%5BDVDRip%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fc3279f4704a23a7ed477db3e25992046eed2423","infoHashBuffer":{"type":"Buffer","data":[252,50,121,244,112,74,35,167,237,71,125,179,226,89,146,4,110,237,36,35]},"announce":[],"urlList":[]}}