{"title":"THE DINOSAURS The Nature of the Beast 3 of 4.mpg","uid":8800455,"size":3538354176,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:fc3cf5fa0d927b573ec54974395ce9faec64923d&amp;dn=THE+DINOSAURS+The+Nature+of+the+Beast+3+of+4.mpg&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"DinoLuigi","files":1,"time":1376187272,"description":"THE NATURE OF THE BEAST\n\nDiscover the startling facts and dramatic new theories currently revolutionizing our understanding of some of the largest, most ferocious animals ever to walk the Earth, THE DINOSAURS!  Banishing the once-accepted image of cold-blooded brutes plodding toward extinction, tantalizing new findings now show that some dinosaurs were intensely active, fleet-footed hunters; others were devoted, family-rearing parents; and, most heretical of all, warm-blooded!\n\nOn location with cutting-edge scientists unearthing the latest discoveries, and via dazzling, high-quality animation, this bold new series will forever change your view of these astonishing prehistoric overlords of the Earth!\n\nIn &quot;The Nature of the Beast&quot; you'll join scientists to explore the puzzling question of how dinosaurs originated, and how these amazingly diverse and successful animals came to dominate the entire planet over 140 million years.  Traveling to the high plateaus of Argentina, you'll glimpse the recently discovered remains of the earliest known dinosaur.  In Nova Scotia, you'll learn of a cataclysmic prehistoric extinction that destroyed the dinosaurs' competition and ushered in the age of the Terrible Lizards.  And, in the American West, you'll encounter the maiasaurs, or &quot;good mother lizards&quot; -- creatures that radically changed our concept of the nature of dinosaurs by showing that some of them lived in nesting colonies where they fed and protected their young.\n\nRunning Time 60 mins.","torrent":{"xt":"urn:btih:fc3cf5fa0d927b573ec54974395ce9faec64923d","amp;dn":"THE+DINOSAURS+The+Nature+of+the+Beast+3+of+4.mpg","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fc3cf5fa0d927b573ec54974395ce9faec64923d","infoHashBuffer":{"type":"Buffer","data":[252,60,245,250,13,146,123,87,62,197,73,116,57,92,233,250,236,100,146,61]},"announce":[],"urlList":[]}}