{"title":"Bob Mintzer Big Band - 2006 - Old School. New Lessons FLAC","uid":8692160,"size":462029969,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:fc42e5b940cf3f0329d7586e3fd7aca38e1c8097&amp;dn=Bob+Mintzer+Big+Band+-+2006+-+Old+School.+New+Lessons+FLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"eika256","files":-1,"time":1373904873,"description":"Bob Mintzer Big Band - 2006 - Old School. New Lessons\n\nHe may be best known these days as one quarter of the contemporary jazz group Yellowjackets' best lineup in 25 years, but woodwind multi-instrumentalist Bob Mintzer first cut his teeth in the big bands of Buddy Rich and Mel Lewis, along with the late bassist Jaco Pastorius' groundbreaking Word of Mouth Big Band. And so, while he's made a significant part of his reputation through work in smaller ensembles, he's always had an affinity for the sonic possibilities and sheer power of larger ensembles. His own big band has been an ongoing concern since the early 1980s.\nMintzer has clear reverence for the swing tradition of those early big bands' experiences. Still, with his own ensembles he's always been equally committed to moving that tradition forward, something he does to great effect on Old School: New Lessons, culled from a series of Manchester Craftsmen's Guild shows in Pittsburgh in 2004 and 2005. Augmenting his sixteen-piece band on two tracks with vocalist Kurt Elling, and on two others with his Yellowjackets bandmates, Mintzer has fashioned a large ensemble record that's respectful enough to appeal to staunch traditionalists, yet contemporary enough to perhaps act as an entry point for contemporary jazz fans who are less familiar with what a big band has to offer.\nThe two Elling tracks are a lush reading of &quot;My One and Only Love and a powerful version of &quot;Resolution that puts last year's Lincoln Center Jazz Orchestra's overly-arranged version of John Coltrane's A Love Supreme to shame. Otherwise, the compositions are all Mintzer's. And of those seven Mintzer titles, a full five were originally recorded with Yellowjackets.\nWhile the use of his electronic wind instrument (EWI) feels a little out of place on the samba-inflected &quot;Mofongo, which also features Yellowjackets pianist Russell Ferrante, electric bassist Jimmy Haslip and drummer Marcus Baylor, Mintzer's thirteen-piece horn section gives the piece a bright energy that surpasses the Yellowjackets version from Mint Jam (Heads Up, 2002). The pop balladry of &quot;Mosaic, which also first appeared on Mint Jam, on the other hand, feels more organically integrated here.\nBut Mintzer's Yellowjackets tunes interpreted by the big band alone best exemplify the convergence of these two seemingly disparate musical worlds. &quot;Go Go, rhythmically rooted in the underground scene of Washington, DC, manages to feel authentic yet swings a little harder; pianist Phil Markowitz's accompaniment to Bob Malach's tenor solo is more abstractly modal than Ferrante's take on Time Squared (Heads Up, 2003). And while the burning &quot;Runferyerlife grooved with a kind of Weather Report swagger on the live Mint Jam, it's more closely aligned here with traditional big band swing.\nAll too few artists today are exploring the greater possibilities a large ensemble can afford. So it's good news that Mintzer has chosen to remain committed to his big band throughout his career. Old School: New Lessons, a vivid set filled with excitement and color, continues to demonstrate Mintzer's ability to comfortably marry tradition with innovation. (allaboutjazz)\n\nTrack List:\n01. Not Quite Yet\n02. Mofongo\n03. My One And Only Love\n04. Runferyerlife\n05. Mosaic\n06. Resolution\n07. March Majestic\n08. Black Sand\n09. Go Go\n\nPersonnel:\nBob Mintzer - tenor saxophone, flute\nPete Yellin - alto saxophone, flute\nLawrence Feldman - alto saxophone, flute\nBob Malach - tenor saxophone, clarinet\nScott Robinson - baritone saxophone, clarinet\nBob Millikan - trumpet\nScott Wendholt - trumpet, flugelhorn\nTerell Stafford - trumpet\nFrank Greene - trumpet\nMichael Davis - trombone\nJason Jackson - trombone\nLarry Farrell - trombone\nDavid Taylor - bass trombone\nPhil Markowitz - piano\nJay Anderson - bass\nJohn Riley - drums\nspecial guests:\nKurt Elling - vocals\nYellowjackets -\nBob Mintzer - tenor saxophone, EWI\nRussell Ferrante - acoustic piano, synthesizer\nJimmy Haslip - electric bass\nMarcus Baylor - drums\n\nEnjoy and share! ","torrent":{"xt":"urn:btih:fc42e5b940cf3f0329d7586e3fd7aca38e1c8097","amp;dn":"Bob+Mintzer+Big+Band+-+2006+-+Old+School.+New+Lessons+FLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fc42e5b940cf3f0329d7586e3fd7aca38e1c8097","infoHashBuffer":{"type":"Buffer","data":[252,66,229,185,64,207,63,3,41,215,88,110,63,215,172,163,142,28,128,151]},"announce":[],"urlList":[]}}