{"title":"Mirah - Changing Light (2014) [FLAC]","uid":9843136,"size":275756455,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:fe2ea7dff3b778f4d02b7919509723af9079ed86&amp;dn=Mirah+-+Changing+Light+%282014%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"politux","files":-1,"time":1396025409,"description":" \n  Mirah - Changing Light (2014) [FLAC]\n\n  Genre: Pop/Rock\n  Styles: Indie, Lo-Fi, Singer/Songwriter\n  Source: CD \n  Codec: FLAC\n  Bitrate: ~ 1,000 kbps\n  Bit Depth: 16\n  Sample Rate: 44.1 kHz\n\n  01 Goat Shepherd\n  02 Oxen Hope\n  03 Turned the Heat Off\n  04 Gold Rush\n  05 Fleetfoot Ghost\n  06 I am the Garden\n  07 No Direction Home\n  08 24th St\n  09 LC\n  10 Radiomind\n\n  Mirah (pronounced mear-rah) -- full name Mirah Yom Tov Zeitlyn -- was born on her mother's kitchen table. The daughter of artistic parents, the singer/songwriter had a passion for music from early childhood. While fronting the jazz band the Hot Set in Olympia, WA, playing wedding parties and bar mitzvahs to earn extra cash, Mirah began writing her own brand of lo-fi, slice-of-life indie pop, a style later compared to that of grrrl rocker Liz Phair. Powered only by her guitar and standout singing voice -- known around small-town Olympia as the sexiest voice in rock -- Mirah performed her own songs under her own name and people took notice. Phil Elvrum of the psychedelic pop group the Microphones invited Mirah to lend her lilting voice and guitar playing to the Microphones' albums Don't Wake Me Up and Window. She later toured with the band across North America and Canada. Mirah's first full-length solo album, You Think It's Like This But Really It's Like This, was released in June 2000 by the K label. Elvrum produced the freshman record, assisting with much of the instrumentation. \n\n  Yo Yo Recordings released her single-sided album Storageland in 2001. In 2002, Mirah returned to K with the breathtaking Advisory Committee and, with collaborator Ginger Brooks Takahashi, released Songs from the Black Mountain Music Project in summer 2003. The following year was also busy for Mirah: To All We Stretch the Open Arm (which also featured the Black Cat Orchestra) and C'mon Miracle both arrived in 2004. The remix collection Joyride appeared in late 2006, while Share This Place, a concept album about the lives of insects featuring Spectratone International, was released in summer 2007. The following year The Old Days Feeling, a collection of pre-You Think It's Like This But Really It's Like This songs with liner notes courtesy of Calvin Johnson, arrived, and Mirah's fourth solo album, (A)spera, which featured production by Elvrum, Tucker Martine, and Adam Selzer, appeared in 2009. In 2011, Mirah teamed up with her friend Thao for the simply named Thao &amp; Mirah.","torrent":{"xt":"urn:btih:fe2ea7dff3b778f4d02b7919509723af9079ed86","amp;dn":"Mirah+-+Changing+Light+%282014%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fe2ea7dff3b778f4d02b7919509723af9079ed86","infoHashBuffer":{"type":"Buffer","data":[254,46,167,223,243,183,120,244,208,43,121,25,80,151,35,175,144,121,237,134]},"announce":[],"urlList":[]}}