{"title":"Petroleum Geology - From Mature Basins to New Frontiers","uid":12014024,"size":139754645,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:fe401c052d007cf270fb9baa1aa31b0810eef4e1&amp;dn=Petroleum+Geology+-+From+Mature+Basins+to+New+Frontiers&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1434275643,"description":"ISBN 9781862392984\n\nThe Proceedings of the 7th Petroleum Geology Conference is the seventh in a series that has become a tradition known as the Barbican conferences. They started life over 35 years ago, in 1974, with a focus solely on North-West Europe, and have a reputation, both from the conferences and the accompanying proceedings volumes, of being at the forefront of petroleum geoscience; the standard reference for successive generations of petroleum geoscientists.\nNorth-West Europe has matured as a petroleum province and, at the same time, the conference series has matured to be a truly global event. These proceedings embrace many of the worlds petroleum provinces in a two-volume set. There are sections on Europe (exploration, field development and production techniques in exploration exploitation) which still provides the heart of the proceedings; Russia, the former Soviet Union and Circum-Arctic; North Africa and the Middle East; Passive Margins; and Unconventional Hydrocarbon Resources.\n\nIn addition, the three Geocontroversies debates, highly acclaimed at the conference, are included, as is a summary of the Core Workshop. A DVD complements the books and, in addition to providing electronic versions of all the papers also includes selected posters and video clips from the Virtual Field Trip session; the latter being a major success at the conference.\n\nThe proceedings volumes of this seventh conference are therefore a must for every petroleum geoscientists bookshelf","torrent":{"xt":"urn:btih:fe401c052d007cf270fb9baa1aa31b0810eef4e1","amp;dn":"Petroleum+Geology+-+From+Mature+Basins+to+New+Frontiers","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fe401c052d007cf270fb9baa1aa31b0810eef4e1","infoHashBuffer":{"type":"Buffer","data":[254,64,28,5,45,0,124,242,112,251,155,170,26,163,27,8,16,238,244,225]},"announce":[],"urlList":[]}}