{"title":"Lonnie Smith - 2010 - Spiral FLAC","uid":8469959,"size":334711100,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:ffc55053c5e0f439e5890b9467ddc86a05a8403f&amp;dn=Lonnie+Smith+-+2010+-+Spiral+FLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"eika256","files":-1,"time":1368461162,"description":"Lonnie Smith - 2010 - Spiral\n\nDr. Lonnie Smith shows no signs of slowing down. Spiral is is his fifth studio album since 2003, and his fourth for Palmetto. Produced by Matt Balitsaris, Smith's trio includes guitarist Jonathan Kreisberg and drummer Jamire Williams. The program is a solid set of jazz nuggets, an original, and a couple of ballad standards. Things lead off with Jimmy Smith's &quot;Mellow Mood,&quot; which is relaxed but hardly what the title suggests. Smith is in prime soul-jazz mode here, paying tribute to his mentor by swinging hard on the melody.\nAnother nice touch is the reading of Slide Hampton's &quot;Frame for the Blues,&quot; a smoky, nocturnal slow burner that features a fine solo by Kreisberg. Smith's fire is reserved for Harold Mabern's stomping &quot;Beehive,&quot; where the band not only plays full-bore, but executes the knotty harmonic and tempo changes flawlessly, making the tune feel more like a crackling rock jam than just a jazz tune -- it'd be great to hear Smith's band perform this tune with Phish. Kreisberg's solo, which sounds a bit like steel drums, is the most mind-boggling thing on the record. More familiar material, such as &quot;Sweet &amp; Lovely&quot; and &quot;I Didn't Know What Time It Was,&quot; is handled with all the slippery swing that soul-jazz affords standards, and the trio is seamless -- check Williams' drumming on the former tune where he slips in breaks and off-meter fills while staying firmly in the pocket -- and deft in both surprise and depth. Spiral puts the full range of Smith's powers as an interpreter and improviser on display. This grooving trio makes it all sound easy, though nothing could be further from the truth.\n\nTrack list:\n01. Mellow Mood\n02. I've Never Been In Love Before\n03. Frame For The Blues\n04. I Didn't Know What Time It Was\n05. Sweet &amp; Lovely\n06. Spiral\n07. Beehive\n08. Sukiyaki\n\nPersonnel: Dr. Lonnie Smith: Hammond organ\nJonathan Kreisberg: guitar\nJamire Williams: drums.\n\nEnjoy and share! ","torrent":{"xt":"urn:btih:ffc55053c5e0f439e5890b9467ddc86a05a8403f","amp;dn":"Lonnie+Smith+-+2010+-+Spiral+FLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ffc55053c5e0f439e5890b9467ddc86a05a8403f","infoHashBuffer":{"type":"Buffer","data":[255,197,80,83,197,224,244,57,229,137,11,148,103,221,200,106,5,168,64,63]},"announce":[],"urlList":[]}}